{
  "title": "2021 Laser storage cleanup",
  "ns": 0,
  "id": 1313,
  "slug": "2021_Laser_storage_cleanup",
  "latest_revision": {
    "id": 5014,
    "timestamp": "2021-05-01T22:45:45Z",
    "contributor": {
      "username": "Gamebofh",
      "ip": null,
      "id": 710
    },
    "comment": "",
    "text": "\nAs discussed in the [This is not a] Proposal thread, I have cleaned out, organized and red-tagged all of the materials stored by the laser. \n\n*Just to make sure we level set, it's my understanding that \"Parking Passes\" are for short term storage of 7 days or less and help us control the clutter [1] [2] [3]\n*My intention is to complete this project after May 15th, so you have until then to claim and/or parking pass your material.\n** Some point after this day I will consolidate everything and announce to this list and slack that the material is free for the taking.\n** Some point after that I will cleanup the scrap and populate it with the things that make sense from the red-tag.\n\nSo, I  have cleared out and organized all of the material from that area.  Here is the before picture:\n\n* [[File:laser_before.jpeg|200px]]\n\nAnd after.\n\n* [[File:laser_after.jpg|200px]]\n\n==Interesting note==\n* There were items that had already been red-tagged.  Those are now in the \"scrap\" area, which will be my next project I guess.  Most of them had parking pass dates of 2017 and had been red-tagged in 2019, to give you a sense of their age.\n\n==Organization==\n\nThere is now a pile listed as red-tagged that has material with no identifying information on.  So, if you have something you know you had, but can't find, it might be in that pile.  It's over by the chair corral/can crusher.  (There is now a red-tag sign pointing at it on the sign)\n\n* [[File:noname.jpg|200px]]\n\nDisorganized random named items are located next to and on-top of the tables.  This includes things like the sheets of glass that couldn't be cut anyway (but maybe etched)  If you had one or two things they're likely in here.\n\n[[File:misc.jpg|200px]]\n\nPile of stuff where people had a good number of items.\n\n* [[File:PXL 20210426_230338708.jpg|200px]]\n\nThis pile contains material from the following identifications:\n\n* Luis\n* Shaundra\n* Schneider\n* Nancy Gibson\n* JME\n* Chase D\n* Greg Oswalt\n* James\n* Travis\n* (maybe others?)\n\nBig stack of plywood\n\n[[File:plywood.jpg|200px]]\n\nNames on this are Timmons and Crummey\n\nThere are also separate piles set aside and individually tagged from:\n\n* Lavelle\n* Milton\n* Linwood\n\nNathan has also parking passed his material and put it in the storage bin.\n\nApologies on the temporary clutter around the lab.  I struggled with making things accessible and not having them in the way.\n\n==Future work==\n* Organize the existing 3 bins by last name with 4th reserved for HSL materials.\n** A-G\n** H-O\n** P-Z\n** Note:  Chosen by splitting up last names from census data into approximate thirds.  [https://gist.github.com/apendleton/2638865 Github link].",
    "bytes": 2652
  },
  "revision_count": 7,
  "first_revision_timestamp": "2021-04-27T02:56:21Z",
  "is_redirect": false
}