{
  "title": "3D Scanner",
  "ns": 0,
  "id": 135,
  "slug": "3D_Scanner",
  "latest_revision": {
    "id": 3104,
    "timestamp": "2012-01-10T08:28:25Z",
    "contributor": {
      "username": "Uberschnitzel",
      "ip": null,
      "id": 9
    },
    "comment": "",
    "text": "To complement our 3D printer(Rep Rap)that we created it would be great if we had our very own affordable and accurate 3D scanning setup.  At the moment we can create 3D models in software and print them or we can download pre-made models from websites like instructables.com.  Having a 3D scanner would speed up the replication process for us if we have an object already.  \n\n=Method=\n\nThere is a community surrounding some free 3D scanner software called David LaserScanner.  We'll acquire a web cam and laser level.  And then install the David 3D scanner software to do a scan of a small object.\n\nOnce getting a basic functional setup we'll move towards commercial methods of doing multi-scans at the same time and combine the results after processing to ensure that we have the least amount of noise possible and the cleanest scan from the cheapest materials.\n\n=Budget=\n\nGoal is to have the ultimate cost for this project to be less than commercially available products.  The lowest commercial costing products that I've found so far is:\n\n'''NextEngine''' - $2,995\n\nor\n\n'''David 3D Package w/ Camera''' - circa $1,418.67\n\n=Trials=\n\n==First Scan Setup==\n\nTried my first scan using the following materials:\n\n*Free Version of David LaserScanner Software\n*MacBook Pro Intel Core 2 Duo 2.6GHz\n*Built-in iSight - USB 2.0, Plastic Lense, Fixed Focus, CMOS Active pixel sensor instead of a CCD(Apple has moved to using a sensor capable of 1280x1024 pixels, but when accessed using provided APIs, the image is re-sampled to 640x480 pixels.)  Frame Rate? Possibly 15fps-30fps\n*Black and Decker Laser Level Held Horizontally- http://www.blackanddecker.com/ProductGuide/Product-Details.aspx?ProductID=10968 (Class II Red Laser - Maximum Output <1mW at 630nm-670nm) - $17.47\n*90 degree calibration corner using the .pdf printout included with David Laser Scanner and a Poster Board\n\n'''Conclusion''' - This was successful and surprisingly satisfying seeing the results pop up on the screen immediately.  Scanned one side of a spray bottle and it was distinguishable in the resulting render.  The precision and detail wasn't that great with hand holding the laser.  Skipping around a bit.  I would like to fix that in the second revision.  Also, the laser is not diffracted as well as I would like.  The laser line varies from a bright spot to very thin line. Looks like the background poster board could be made larger to fill the full frame of the camera's field of vision.  The tape I used to tape down the calibration points ended up being detected by the software as calibration points.  I need the tape not to show up in the frame or to use alternative adhesives.  Lastly, I will need to play with controlled lighting in the scanning environment so that we don't have any stray shadows that take away from the scan.  Possibly an enclosed environment?  Possibly up the quality with an external [http://www.firewirecamera.org firewire camera].\n\n==Second Scan Setup==\n\nWith this revision I would like to attempt to create a rotational base for the objects that we want to scan.  This time I can set up the laser in a fixed setup scanning vertically and taking out the user error of the scanning.  With the steps from the motor we should get finer detail.  For the laser itself I am upgrading to a 10mw Green Laser that will be diffracted through a line generator lens or a stem from a wine glass.  Apparently green shows up better on camera CCDs(need to look a bit more into optics to verify this as I know green is at the peak of the optical spectrum for human beings).  Finally, as the object we are scanning is no longer static we will need to take video instead of still shots and then stitch the frames together to create our object.  The use of white paint on objects being scanned seems to heighten the quality of the scan as well.  \n\n'''Equipment Sources:'''\n*5mw Green(532nm) Laser - http://www.dealextreme.com/details.dx/sku.91\n*Parts to create something similar to this commercial base - http://ortery.com/products/photocapture360-360-degree-photo-animation-turntable.php\n*White Spray Paint(Washable?)\n\n==Third Scan Setup==\n\nWanting to move towards a design where I could control the lighting environment as well as automate the rotation of the object being scanned, I've decided to play with the Fab Scan software developed by Francis Engelmann at the Media Computing Group.\n\nhttp://hci.rwth-aachen.de/fabscan\n\nFinished building the Chassis.  Ordered all of the components.  Exploring the software but at the moment the control for the laser, motors, and the actual scanning are all separate.  So far looking to create a custom board for the motor controllers.  Will take pictures and add more details as I go along.\n\n=Links=\n==Commercial Models==\nNextEngine:<br>\nhttps://www.nextengine.com/indexSecure.htm\n\nRapMan Is Selling a David Laser Scanner Package:<br>\nhttp://www.rap-man.com/david3d.asp\n\n==Open Source Projects==\n\nMakerBot Industries Attempt at a Scanner:<br>\nhttp://www.makerscanner.com/<br>\nhttp://wiki.makerbot.com/makerscanner\n\nMakerBot Cyclops - 3D Scanner Mount:<br>\nhttp://www.thingiverse.com/thing:4271\n\n==Current News==\nhttp://blog.makezine.com/archive/2010/03/letters_from_the_fab_academy_part_4.html\n\n==Forums==\nA lot of people have tried different combinations of camera, laser, and software to improve upon the scans.  Saves time by cutting out things you don't have to try.\n\nPrimary Forums for David 3D Scanning Software:<br>\nhttp://www.david-laserscanner.com/forum/\n\nMakerBot has a group discussing a MakerScan device that would be cost affordable and in a nice package:<br>\nhttp://groups.google.com/group/makerscan/\n\n==Software==\n===David Laser Scanner===\n\nThe actual scanning software(David 3D):<br>\nhttp://www.david-laserscanner.com/\n\nPeople on Instructables using the software:\nhttp://www.instructables.com/id/3-D-Laser-Scanner/ <br>\nhttp://www.instructables.com/id/Make-your-own-3d-scanner/  <br>\nhttp://www.instructables.com/id/Structured-Light-3D-Scanning/  <br>\nhttp://www.instructables.com/id/David-3D-scanner/  <br>\n\n===Fab Scan===\n\nMain project page:<br>\nhttp://hci.rwth-aachen.de/fabscan\n\n===Meshlab===\n\nA point cloud can be brought into MeshLab as a PLY file, a simple ASCII format for 3D object description: <br>\nhttp://meshlab.sourceforge.net/\n\nFrom here you can merge scans together.  The merging process is sometimes easier if you mark certain areas of the object with sharpy so you can align the dots from different scans.\n\nAlso, this guy just started this project for a college project:\nhttp://hci.rwth-aachen.de/fabscan\n\n==Videos==\n\nsystm Covered Cheap 3D Scanning in this Episode: <br>\nhttp://revision3.com/systm/laserscan\n\n==Scanning Theory==\n\nStructured Light 3D Scanning: <br>\nhttp://www.instructables.com/id/Structured-Light-3D-Scanning/\n\n==Links Pages==\n\nThe MakerBot Community Has Their Own Link Page For 3D Scanning Projects: <br>\nhttp://wiki.makerbot.com/laser-scanner-links",
    "bytes": 6931
  },
  "revision_count": 40,
  "first_revision_timestamp": "2010-02-08T20:36:07Z",
  "is_redirect": false
}