{
  "title": "501(c)3 Filings",
  "ns": 0,
  "id": 1132,
  "slug": "501(c)3_Filings",
  "latest_revision": {
    "id": 4230,
    "timestamp": "2013-12-10T00:38:59Z",
    "contributor": {
      "username": "Will",
      "ip": null,
      "id": 22
    },
    "comment": "",
    "text": "== PARTIAL 501c3 Application and Attachments ==\n\nSegments of our application that don't contain personal or private information (names, addresses, ID numbers) and that may be relevant to future HSL decisionmaking are pasted below. The originals can be found in the HeatSync Board folder on Google Docs (current) / Dropbox (old).\n\n=== Articles of Incorporation ===\nARTICLES OF INCORPORATION \nOF A TAX-EXEMPT      \nPursuant to A.R.S. §10-3202 \n(Arizona Non-Profit Corporation) \n\n1.  Name:  The Name of the Corporation is:\nHeatSync Labs\n\n2.  Purpose:  The purpose for which the corporation is organized is:\nOur mission is to provide space and tools to the community for use in furthering technology, science, and education through self-instruction, workshops, and individual or group projects.\n\n3.  Character of Affairs:  The character of affairs of the corporation will be:\n\n\n4.  No part of the net earning of the corporation shall inure to the benefit of, or be  \ndistributable to its members, directors, officers, or other private persons, except that the \ncorporation shall be authorized and empowered to pay reasonable compensation for \nservices rendered and to make payments and distributions in furtherance of the purposes set forth in Article 2.  No substantial part of the activities of the corporation shall be the carrying on of propaganda, or otherwise attempting to influence legislation, and the corporation shall not participate in, or intervene in (including the publishing or distribution of statements,) any political campaign on behalf of any candidate for public office.  Notwithstanding any other provision of these Articles, the corporation shall not carry on any other activities not permitted to be carried on: (a) by a corporation exempt from Federal Income Tax under Section 501c3 of the United States Internal Revenue Code (or the corresponding provision of any future United States Internal Revenue Law) or: (b) by a corporation, contributions to which are deductible under Section 501c3 of the United States Internal Revenue Code (or the corresponding provisions of any future \nUnited States Internal Revenue Laws). \n \n5.  Upon the dissolution of the corporation, the Board of Directors shall, after paying or \nmaking provision for the payment of all of the liabilities of the corporation, dispose of all its assets exclusively for the purposes of the corporation in such a manner, or to such \norganizations organized and operated exclusively for charitable, educational, religious or scientific purpose as shall at the time qualify as an exempt organization or organizations under Section 501c3 of the United States Internal Revenue Code  (or the corresponding provision of any future United States Internal Revenue Laws) as the Board of Directors shall determine.  Any such assets not disposed of shall be disposed of by the Superior Court of the county in which the principal office of the corporation is then located, exclusively for such purpose or to such organization or organizations, as said Court shall determine, which are organized and operated exclusively for such purpose. \n \n6.  The power of indemnification under the Arizona Revised Statutes shall not be denied \nor limited by the bylaws. \n\n7. Board of Directors: The initial board of directors shall consist of 3 \ndirector(s).  The name(s) and address(es) of the person(s) who is(are) to serve \nas the director(s) until the first annual meeting of the members, if a member \ncorporation, or Board of Directors, if the corporation has no members, or until \nhis(her)(their) successor(s) is(are) elected and qualifies is(are):  \n\n... listed ...\n\nAll powers, duties and responsibilities of the incorporators shall cease at the time of delivery of these Articles of Incorporation to the Arizona Corporation Commission. \n \n11.  Check this box, if this provision will apply to your corporation. \n  \nDISCRIMINATION: The Corporation will not practice or permit discrimination on \nthe basis of sex, race, national origin, religion, physical handicap or disability.      \n                                       \n12. MEMBERS (Check One) \n \nThe corporation:\nwill have members \nwill not have members. \n\n\n=== Part II ===\n\n==== Attachment: Bylaws ====\n\nI.  NAME AND PURPOSE\n\n1. The name of this organization shall be known as HeatSync Labs.\n\n2. The purpose of HeatSync Labs (herein referred to as “HSL”) shall be to provide a physical environment for the discussion, planning, and construction of collaborative endeavors in the application of technology as well as technological expressions of artwork.\n\n...\n\nIII.  INTERESTED PERSONS\n\n1. Limitations on Interested Persons. At all times, not more than 49% of officers in the Board of Directors may be Interested Persons. An Interested Person is defined as:\n\nA. Any member currently being compensated by the organization for services rendered to it within the previous twelve months, whether as a full-time or part-time employee, independent contractor, or otherwise, excluding any reasonable compensation paid to a director in his or her capacity in the Board of Directors; Or\n\nB. Any brother, sister, ancestor, descendant, spouse, brother-in-law, sister-in-law, son-in-law, daughter-in-law, mother-in-law, or father-in-law of any such person.\n\n2. In the event that an election results in a majority of Interested Persons elected as officers in the Board of Directors, the current officers of the Board of Directors shall vote for the removal of a sufficient number of Interested Persons to meet the quota of non-Interested persons defined in this section. Following the removal of a sufficient number of Interested Persons, the remaining officers of the Board of Directors shall hold a special election to fill in any offices left vacant by the removal of Interested Persons, as described in Article II, Section 7. \n\n3. Where it is not reasonably practicable to obtain approval of the Board of Directors before entering into a self dealing transaction, the office of the Treasurer or Champion may approve such a transaction under the condition that, at the following meeting of the Board of Directors, a quorum of the Board of Directors determines that the transaction was in the unbiased and best interests of the HSL and that it was not reasonably practical to obtain advance approval by a full quorum of the Board of Directors.\n\nIV.  MEMBERSHIP\n\n1. Membership in HSL shall be open to anyone in the community with a genuine interest in the HSL's purpose, and shall not be discriminated against on the basis of color, race, gender, national origin, religion, creed, political affiliation/orientation, sexual preference/orientation, age, disability, software preference, or veteran status.\n\n...\n\n=== Part III. Required Provisions in Your Organizing Document ===\nThe following questions are designed to ensure that when you file this application, your organizing document contains the required provisions to meet the organizational test under section 501(c)(3). Unless you can check the boxes in both lines 1 and 2, your organizing document does not meet the organizational test. DO NOT file this application until you have amended your organizing document. Submit your original and amended organizing documents (showing state filing certification if you are a corporation or an LLC) with your application.\n\n1: Section 501(c)(3) requires that your organizing document state your exempt purpose(s), such as charitable,\nreligious, educational, and/or scientific purposes. Check the box to confirm that your organizing document\nmeets this requirement. Describe specifically where your organizing document meets this requirement, such as\na reference to a particular article or section in your organizing document. Refer to the instructions for exempt\npurpose language. Location of Purpose Clause (Page, Article, and Paragraph): '''Page 1, Article 2, Paragraph 1'''\n\n2a: Section 501(c)(3) requires that upon dissolution of your organization, your remaining assets must be used exclusively\nfor exempt purposes, such as charitable, religious, educational, and/or scientific purposes. Check the box on line 2a to\nconfirm that your organizing document meets this requirement by express provision for the distribution of assets upon\ndissolution. If you rely on state law for your dissolution provision, do not check the box on line 2a and go to line 2c.\n\n2b If you checked the box on line 2a, specify the location of your dissolution clause (Page, Article, and Paragraph). '''Page 1, Article 5, Paragraph 1'''\n\nDo not complete line 2c if you checked box 2a.\n\n2c See the instructions for information about the operation of state law in your particular state. Check this box if\nyou rely on operation of state law for your dissolution provision and indicate the state:\n\n=== Part IV. Narrative Description of Your Activities ===\n\nUsing an attachment, describe your past, present, and planned activities in a narrative. If you believe that you have already provided some of this information in response to other parts of this application, you may summarize that information here and refer to the specific parts of the application for supporting details. You may also attach representative copies of newsletters, brochures, or similar documents for supporting details to this narrative. Remember that if this application is approved, it will be open for public inspection. Therefore, your narrative description of activities should be thorough and accurate. Refer to the instructions for information that must be included in your description.\n\n==== Attachment: Narrative ====\n\nThe concept for HeatSync Labs came out of the desire for a group of Arizona locals to get together and continue working on projects after academic life.  We wanted a place to share tools, space, and ideas with fellow hackers and makers.  Heavy industrial and electrical equipment, as well as professional computer software can be so costly as to be out of reach for the average student, entrepreneur, or garage tinkerer. The traditional model has been to personally build hobby workshops in seclusion over a period of decades. We don't want to work in seclusion, nor do we want our equipment to sit fallow 90% of the time.\n\nThroughout 2009, we discovered, and in some cases, visited, other notable hacker spaces popping up across the North America (NoiseBridge, Pumping Station: One, NYC Resistor, Hacklab Toronto, and HacDC).  The main funding source of everyone we visited was some combination of personal investment, membership dues and classes. The wildly successful spaces were able to buy equipment but most relied on donations and grants for that.\n\nThis early research allowed us to understand the constraints and pitfalls associated with our dream. Our ultimate goal became a permanent space of our own. Tools and equipment would follow when our peers saw the work we were doing. To fund our space, utilities, etc. we would have to seek member dues from those who, like us, were committed to our mission. Grants and monetary and equipment donations would be the way we build capital towards specific equipment purchases.\n\nIt was important that this private nature not fence us off from our community, however. Outreach would be through our free public biweekly meetings, free workshops, and eventually paid classes. Finally, transparency to our membership, and the community at large would be key.\n\nOrganizational Meetings began in May of 2009 aided by national coverage via the Make: Blog. By September the group had elected its board of members and drafted its bylaws. It was during this time we began the 501c3 application process. Following in the footsteps of Pumping Station One and Noisebridge's successful 501c3 applications, we too wanted to seek non profit status as a commitment to our community and pledge for future transparency and openness.\n\nBy December we had outgrown our temporary location and took up a tantalizing offer to partner with a local collaborative workspace called Gangplank. Gangplank is building a community of collaboration by offering to individuals and business, for free, temporary workspace, conference space, internet access and more. This partnership brought us the space needed to begin our public outreach mainly through our now expanded bi-monthly public meetings and through a new monthly electronics workshop.\n\nCurrently, We are on track with our membership projections and are constantly surprised by the positivity and energy the community has shown for this project. We are using our new community partnerships to approach the local professional technical community and apply for other funding opportunities. Gangplank is only able to offer us temporary workspace. What we will eventual need to flourish will be workshop space where we can maintain professional quality heavy industrial equipment. Because of our space donations we have been cash flow positive since inception and are currently banking money for that eventual move. If no grant or major donations opportunities arise after 3 years we will still have banked enough money and grown our membership enough to be able to safely move under our own power.\n\nFrom here on out we aim to continue to collect brilliant people and provide the tools necessary to see them grow and prosper. We will provide resources available to our creative community outside of the constraints of an academic, corporate, or state controlled environment. We will nurture a mindset of collaboration and learning among our members and positively impact the community, and the world, at large.\n\n=== Part V. Compensation and Other Financial Arrangements ===\n\n4. In establishing the compensation for your officers, directors, trustees, highest compensated\nemployees, and highest compensated independent contractors listed on lines 1a, 1b, and 1c, the\nfollowing practices are recommended, although they are not required to obtain exemption. Answer\n“Yes” to all the practices you use.\n\na) Do you or will the individuals that approve compensation arrangements follow a conflict of interest policy? '''No'''\n\nb) Do you or will you approve compensation arrangements in advance of paying compensation? '''No'''\n\nc) Do you or will you document in writing the date and terms of approved compensation arrangements? '''No'''\n\nd) Do you or will you record in writing the decision made by each individual who decided or voted on compensation arrangements? '''No'''\n\ne) Do you or will you approve compensation arrangements based on information about compensation paid by similarly situated taxable or tax-exempt organizations for similar services, current compensation surveys compiled by independent firms, or actual written offers from similarly situated organizations? Refer to the instructions for Part V, lines 1a, 1b, and 1c, for information on what to include as compensation. '''No'''\n\nf) Do you or will you record in writing both the information on which you relied to base your decision \nand its source? '''No'''\n\ng) If you answered “No” to any item on lines 4a through 4f, describe how you set compensation that is reasonable for your officers, directors, trustees, highest compensated employees, and highest compensated independent contractors listed in Part V, lines 1a, 1b, and 1c. \n\n5a. Have you adopted a conflict of interest policy consistent with the sample conflict of interest policy in Appendix A to the instructions? If “Yes,” provide a copy of the policy and explain how the policy has been adopted, such as by resolution of your governing board. If “No,” answer lines 5b and 5c. '''Yes'''\n\nb) What procedures will you follow to assure that persons who have a conflict of interest will not have\ninfluence over you for setting their own compensation?\n\nc) What procedures will you follow to assure that persons who have a conflict of interest will not have\ninfluence over you regarding business deals with themselves?\n\nNote: A conflict of interest policy is recommended though it is not required to obtain exemption.\nHospitals, see Schedule C, Section I, line 14.\n\n6a. Do you or will you compensate any of your officers, directors, trustees, highest compensated employees, and highest compensated independent contractors listed in lines 1a, 1b, or 1c through non-fixed payments, such as discretionary bonuses or revenue-based payments? If “Yes,” describe all non-fixed compensation arrangements, including how the amounts are determined, who is eligible for such arrangements, whether you place a limitation on total compensation, and how you determine or will determine that you pay no more than reasonable compensation for services. Refer to the instructions for Part V, lines 1a, 1b, and 1c, for information on what to include as compensation. '''No'''\n\nb) Do you or will you compensate any of your employees, other than your officers, directors, trustees, or your five highest compensated employees who receive or will receive compensation of more than $50,000 per year, through non-fixed payments, such as discretionary bonuses or revenue-based payments? If “Yes,” describe all non-fixed compensation arrangements, including how the amounts are or will be determined, who is or will be eligible for such arrangements, whether you place or will place a limitation on total compensation, and how you determine or will determine that you pay no more than reasonable compensation for services. Refer to the instructions for Part V, lines 1a, 1b, and 1c, for information on what to include as compensation.  '''No'''\n\n7a. Do you or will you purchase any goods, services, or assets from any of your officers, directors, trustees, highest compensated employees, or highest compensated independent contractors listed in \nlines 1a, 1b, or 1c? If “Yes,” describe any such purchase that you made or intend to make, from whom you make or will make such purchases, how the terms are or will be negotiated at arm’s length, and explain how you determine or will determine that you pay no more than fair market value. Attach copies of any written contracts or other agreements relating to such purchases.  '''No'''\n\nb) Do you or will you sell any goods, services, or assets to any of your officers, directors, trustees, highest compensated employees, or highest compensated independent contractors listed in lines 1a, \n1b, or 1c? If “Yes,” describe any such sales that you made or intend to make, to whom you make or will make such sales, how the terms are or will be negotiated at arm’s length, and explain how you determine or will determine you are or will be paid at least fair market value. Attach copies of any written contracts or other agreements relating to such sales.  '''No'''\n\n8a. Do you or will you have any leases, contracts, loans, or other agreements with your officers, directors, trustees, highest compensated employees, or highest compensated independent contractors listed in lines 1a, 1b, or 1c? If “Yes,” provide the information requested in lines 8b through 8f. '''No''' \n\nb) Describe any written or oral arrangements that you made or intend to make.\n\nc) Identify with whom you have or will have such arrangements.\n\nd) Explain how the terms are or will be negotiated at arm’s length.\n\ne) Explain how you determine you pay no more than fair market value or you are paid at least fair market value.\n\nf) Attach copies of any signed leases, contracts, loans, or other agreements relating to such arrangements.\n\n9a. Do you or will you have any leases, contracts, loans, or other agreements with any organization in\nwhich any of your officers, directors, or trustees are also officers, directors, or trustees, or in which any individual officer, director, or trustee owns more than a 35% interest? If “Yes,” provide the\ninformation requested in lines 9b through 9f. '''No'''\n\n==== Attachment: Part V ====\n\n4g)\tNo officers, directors, trustees, or board members receive compensation from the organization. The organization does not have employees.  If we do have compensation in the future, our Board will implement policies to approve compensation in advance, document the compensation agreements in writing, follow a conflict of interest policy, record in writing the decision made by each individual who decided or voted on compensation arrangements, approve compensation arrangements based on information about compensation paid by similarly situated taxable or tax-exempt organizations for similar services, current compensation surveys compiled by independent firms, or actual written offers from similarly situated organizations, and record in writing both the information on which we relied to base our decision and its source.\n\n5a)\tPlease reference Part III of our Bylaws included in Part IV of our 1023 Supplemental material.\n\n\n=== Part VI. Your Members and Others That Receive Benefits From You ===\n\nThe following “Yes” or “No” questions relate to goods, services, and funds you provide to individuals and organizations as part of your activities. Your answers should pertain to past, present, and planned activities. (See instructions.)\n\n1a. In carrying out your exempt purposes, do you provide goods, services, or funds to individuals? If\n“Yes,” describe each program that provides goods, services, or funds to individuals. '''Yes'''\n\nb) In carrying out your exempt purposes, do you provide goods, services, or funds to organizations? If\n“Yes,” describe each program that provides goods, services, or funds to organizations. '''Yes'''\n\n2. Do any of your programs limit the provision of goods, services, or funds to a specific individual or group of specific individuals? For example, answer “Yes,” if goods, services, or funds are provided only for a particular individual, your members, individuals who work for a particular employer, or graduates of a particular school. If “Yes,” explain the limitation and how recipients are selected for each program.  '''Yes'''\n\n3. Do any individuals who receive goods, services, or funds through your programs have a family or business relationship with any officer, director, trustee, or with any of your highest compensated employees or highest compensated independent contractors listed in Part V, lines 1a, 1b, and 1c? If “Yes,” explain how these related individuals are eligible for goods, services, or funds.  '''Yes'''\n\n==== Attachment ====\n\n1\tBrief description of activities and services listed in the narrative that we offer to individuals (1a) and organizations (1b):\n\nPublic Meeting:\nThese are open meetings for the public to come in and take a look at our lab environment.  During these meetings people get to sit in on presentations, see current projects that HeatSync Labs and its members are working on, and check out the facilities and its equipment.\n\nWorkshops:\nCurrently we're offering a basic electronics workshop for Members and Non-members of all ages using the recently popular platform of an Arduino Microcontroller.  In the future we will be running workshops on tools that we are bringing into the lab.  Also, community members will be running workshops focusing on their own specialties.\n\n2\tPlease refer to the following “Part IV - Appendix A:  Membership Application Packet” for details on the limitation and how our members are selected for each program:\n\n3\tCurrently there are no additional family or business relationships between members and board members that has not already been disclosed in other parts of this application. In the future, members may have family or business relationship with other members, per our open membership application structure. \n\n==== Appendix A:  Membership Application Packet ====\nFrom YouTube™ to Etsy™ to Arduino™, the Internet has created an entire generation of users who choose to break free from the traditional consumer model and instead aspire to create and share. \t\n\n\tTraditional institutions have failed to provide adequate resources to meet these new demands. While the cost of digital production has fallen to nearly zero, access to low cost professional quality tools has not followed suit. Heavy industrial and electrical equipment, as well as professional computer software packages, can be so costly as to be out of reach for the student, entrepreneur, or garage tinkerer. We at HeatSync Labs seek to make these resources available to our creative community through cooperative collaboration. In addition, we believe that it's not enough to merely provide access to these resources, but that it's just as important to foster a community of sharing and educating among members. \n\nWe are artists, engineers, tinkerers, students, entrepreneurs; We are HeatSync Labs.\nWhy don’t you start [sewing, sawing,carving, welding, soldering, ...] that project you’ve been thinking about? \nwww.heatsynclabs.org\nMeetings held First and Third Thursday at our more digital half,\n\nGangplank | www.gangplankhq.com\n325 East Elliot Rd Suite 34\n\t\t\t\t\t        Chandler, AZ 85225\nWe aim to instill the mindset of learning by both dissecting existing technology and collaboratively constructing the products of our imaginations.\n\n\n\tHeatSync Labs Membership Application\n\nLegal Name (Last, First):      \nDesired Username:      \n\nAddress:      \n\nCity:       State:       Zip code:      \n\nPhone number:      \n\nEmail address:      \n\nIn case of emergency, HeatSync Labs, Inc. can contact: \n\nName:      \n\nPhone number:       Relationship:      \n\nCheck Applicable: \nI have attended three HeatSync Labs events or meetings, or \nI am requesting a waiver to become a member without meeting the three meeting requirement* (please attach explanation why)\n\n     \tI have read and agreed to abide by the HeatSync Labs bylaws. \n     \tI have signed the Member Agreement and Liability Waiver. \n\nBriefly state your main interest in joining HeatSync Labs:      \nI would like to teach a class. Explain below:      \n\nApplicant Signature:       \t\t\t\t\t\tDate: \n\nDO NOT WRITE BELOW – FOR BOARD USE ONLY\nBoard has approved applicant for membership. \nBoard has not approved applicant for membership. \nReason for not approving: ________________________________________________________________________________________________________________________________________________________________________________________________\n \nBoard Member Signature: __________________ Date: _________ \nBoard Member Name (Print): _________________________________________ \n\nAssigned Membership Number: ________ Access card/key given: Yes/No\t\t\t\t\n\n=== Part VIII. Your Specific Activities ===\n\nThe following “Yes” or “No” questions relate to specific activities that you may conduct. Check the appropriate box. Your answers should pertain to past, present, and planned activities. (See instructions.)\n\n1. Do you support or oppose candidates in political campaigns in any way? If “Yes,” explain. '''No'''\n\n2a. Do you attempt to influence legislation? If “Yes,” explain how you attempt to influence legislation\nand complete line 2b. If “No,” go to line 3a. '''No'''\n\nb) Have you made or are you making an election to have your legislative activities measured by Yes No\nexpenditures by filing Form 5768? If “Yes,” attach a copy of the Form 5768 that was already filed or  attach a completed Form 5768 that you are filing with this application. If “No,” describe whether your  attempts to influence legislation are a substantial part of your activities. Include the time and money spent on your attempts to influence legislation as compared to your total activities.  '''No'''\n\n3a. Do you or will you operate bingo or gaming activities? If “Yes,” describe who conducts them, and list all revenue received or expected to be received and expenses paid or expected to be paid in operating these activities. Revenue and expenses should be provided for the time periods specified in Part IX, Financial Data.  '''No'''\n\nb) Do you or will you enter into contracts or other agreements with individuals or organizations to\nconduct bingo or gaming for you? If “Yes,” describe any written or oral arrangements that you made or intend to make, identify with whom you have or will have such arrangements, explain how the terms are or will be negotiated at arm’s length, and explain how you determine or will determine you pay no more than fair market value or you will be paid at least fair market value. Attach copies or any written contracts or other agreements relating to such arrangements.  '''No'''\n\nc) List the states and local jurisdictions, including Indian Reservations, in which you conduct or will\nconduct gaming or bingo. '''No'''\n\n4a. Do you or will you undertake fundraising? If “Yes,” check all the fundraising programs you do or will\nconduct. (See instructions.) '''Yes'''\n\n'''Yes:''' mail solicitations, email solicitations, personal solicitations, foundation grant solicitations, accept donations on your website, receive donations from another organization’s website, government grant solicitations, Other\n\n'''No:''' vehicle, boat, plane, or similar donations, phone solicitations\n\nAttach a description of each fundraising program.\n\nb) Do you or will you have written or oral contracts with any individuals or organizations to raise funds for you? If “Yes,” describe these activities. Include all revenue and expenses from these activities  and state who conducts them. Revenue and expenses should be provided for the time periods specified in Part IX, Financial Data. Also, attach a copy of any contracts or agreements. '''No'''\n\nc) Do you or will you engage in fundraising activities for other organizations? If “Yes,” describe these arrangements. Include a description of the organizations for which you raise funds and attach copies of all contracts or agreements. '''Yes'''\n\nd) List all states and local jurisdictions in which you conduct fundraising. For each state or local\njurisdiction listed, specify whether you fundraise for your own organization, you fundraise for another\norganization, or another organization fundraises for you.\n\ne) Do you or will you maintain separate accounts for any contributor under which the contributor has\nthe right to advise on the use or distribution of funds? Answer “Yes” if the donor may provide advice\non the types of investments, distributions from the types of investments, or the distribution from the\ndonor’s contribution account. If “Yes,” describe this program, including the type of advice that may\nbe provided and submit copies of any written materials provided to donors.\n\n5. Are you affiliated with a governmental unit? If “Yes,” explain. '''No'''\n\n6a. Do you or will you engage in economic development? If “Yes,” describe your program. '''No'''\n\nb) Describe in full who benefits from your economic development activities and how the activities \npromote exempt purposes. \n\n7a. Do or will persons other than your employees or volunteers develop your facilities? If “Yes,” describe each facility, the role of the developer, and any business or family relationship(s) between the developer and your officers, directors, or trustees. '''Yes'''\n\nb) Do or will persons other than your employees or volunteers manage your activities or facilities? If\n“Yes,” describe each activity and facility, the role of the manager, and any business or family\nrelationship(s) between the manager and your officers, directors, or trustees. '''Yes'''\n\nc) If there is a business or family relationship between any manager or developer and your officers,\ndirectors, or trustees, identify the individuals, explain the relationship, describe how contracts are\nnegotiated at arm’s length so that you pay no more than fair market value, and submit a copy of any\ncontracts or other agreements.\n\n8. Do you or will you enter into joint ventures, including partnerships or limited liability companies \ntreated as partnerships, in which you share profits and losses with partners other than section \n501(c)(3) organizations? If “Yes,” describe the activities of these joint ventures in which you participate. '''No'''\n\n9. omitted irrelevant section on childcare\n\n10. Do you or will you publish, own, or have rights in music, literature, tapes, artworks, choreography, \nscientific discoveries, or other intellectual property? If “Yes,” explain. Describe who owns or will own any copyrights, patents, or trademarks, whether fees are or will be charged, how the fees are determined, and how any items are or will be produced, distributed, and marketed. '''No'''\n\n11. Do you or will you accept contributions of: real property; conservation easements; closely held\nsecurities; intellectual property such as patents, trademarks, and copyrights; works of music or art;\nlicenses; royalties; automobiles, boats, planes, or other vehicles; or collectibles of any type? If “Yes,” describe each type of contribution, any conditions imposed by the donor on the contribution, and\nany agreements with the donor regarding the contribution. '''Yes'''\n\n12a. Do you or will you operate in a foreign country or countries? If “Yes,” answer lines 12b through 12d. If “No,” go to line 13a. '''No'''\n\n13a. Do you or will you make grants, loans, or other distributions to organization(s)? If “Yes,” answer lines 13b through 13g. If “No,” go to line 14a. '''No'''\n\n14a. Do you or will you make grants, loans, or other distributions to foreign organizations? If “Yes,”\nanswer lines 14b through 14f. If “No,” go to line 15. '''No'''\n\n15. Do you have a close connection with any organizations? If “Yes,” explain. '''Yes'''\n\n16-18. omitted, irrelevant healthcare/educational(section 501f) items\n\n19. Do you or will you operate a school? If “Yes,” complete Schedule B. Answer “Yes,” whether you operate a school as your main function or as a secondary activity. '''No'''\n\n20-21. omitted, irrelevant hospital and low income items\n\n22. Do you or will you provide scholarships, fellowships, educational loans, or other educational grants to individuals, including grants for travel, study, or other similar purposes? If “Yes,” complete Schedule H. '''No'''\n\nNote: Private foundations may use Schedule H to request advance approval of individual grant procedures. \n\n==== Attachment: Part VIII ====\n4a\tmail - We may mail out requests to known businesses and individuals requesting donations of goods, services, and/or funds for a specific purpose. \n\temail - We may email out requests to known businesses and individuals requesting donations of goods, services, and/or funds for a specific purpose. \n\tperson - We may personally request known businesses and individuals for  donations of goods, services, and/or funds for a specific purpose. \n\tfoundation grants - We request grants from foundations based upon a specific project or foundation guidelines. For example, Arizona State University EAP Grant application was submitted. \n\taccept donations on your website - We may provide the means for persons or businesses to donate via our website. \n\taccept donations from another organization’s website - We may provide the means for persons or businesses to donate via another organization’s website.\n\tgovernment grant soliciations -- We request grants from governments based upon a specific project or government guidelines.\n\tother - We may solicit donations of good, services, and/or funds via other venues such as Facebook, Twitter, or online forums. \n\nPlease reference “Part VIII - Appendix A:  Fundraising Program Examples” for actual examples of letters, emails, and social media messages we have used for fundraising purposes.\n\n4c\tCurrently, no fundraising for other organizations is conducted. We may elect to fundraise in the future for mutually beneficial organizations or events, sister organizations, or national disasters or community outreach purposes (this list is non-inclusive). \n\n4d\tFor all of the following we fundraise for our own organization:  State of Arizona; City of Phoenix, Tempe, Mesa, Chandler, Gilbert, Glendale, Peoria, Apache Junction, Queen Creek; Maricopa County.  Per our website: We reach all 50 states.\n\n7a\tGangplank Collective in Chandler, Arizona. They provide shared resources to persons, businesses, and to the facility (such as physical space, internet connectivity, utilities, furnishings) at no cost.\n\n7b\tGangplank Collective in Chandler, Arizona. They provide our facilities at no cost and schedule exclusive usage of said facility.  \n\n7c\tThere are no business or family relationships between Gangplank Collective and HeatSync Labs. \n\n11\tWe currently have not accepted any donations which fall in these categories but it may be accepted in the future. \n\n15\tWe currently share facilities and resources with Gangplank Collective in Chandler, Arizona.\n\n==== Appendix A: Fundraising Program Examples ====\n\nTwitter/Facebook Example:\n\nPlease donate to @heatsynclabs for [insert project/need here].\n\nActual Fundraiser: Feeling charitable this holiday season? Help @heatsynclabs reach it's fundraising goal! http://www.heatsynclabs.org/?p=227\n\nLetter or Email Example:\n\n[Donor Contact]\n[Donor Company]\n[Donor Address]\n[Donor Address con’t]\n[Date]\nDear [insert potential donor name here]\n\tHeatSync Labs is the first and only hackerspace in Phoenix, Arizona. While the cost of digital production has fallen to nearly zero, access to low cost professional quality tools has not followed suit. Heavy industrial and electrical equipment, as well as professional computer software packages, can be so costly as to be out of reach for the student, entrepreneur, or garage tinkerer. We at HeatSync Labs seek to make these resources available to our creative community through cooperative collaboration. In addition, we believe that it's not enough to merely provide access to these resources, but that it's just as important to foster a community of sharing and educating among members. \n\t[Insert information regarding specific project/request here]\n\tWe are a 501-c-3 organization (application pending approval), and all corporate gifts will be tax deductible upon approval. We welcome your participation and truly appreciate your support. We will honor your donation by thanking your company [insert manner of acknowledging company here]. With your help, we can achieve our goals of making HeatSync Labs an important part of our community, and make a real impact in people’s lives. To attend the event or to make a donation, please contact. \n\nSincerely yours,\n[Your Name Here]\n[Your Title (if applicable)]\n[Your email]\n[Other contact means]\n\n=== Part X. Public Charity Status ===\n\n1a. Are you a private foundation? If “Yes,” go to line 1b. If “No,” go to line 5 and proceed as instructed. '''No'''\n\nIf you are unsure, see the instructions.\n\n5. If you answered “No” to line 1a, indicate the type of public charity status you are requesting by checking one of the choices below. You may check only one box.\n\ng) 509(a)(1) and 170(b)(1)(A)(vi)—an organization that receives a substantial part of its financial support in the form of contributions from publicly supported organizations, from a governmental unit, or from the general public. '''Checked'''",
    "bytes": 39316
  },
  "revision_count": 2,
  "first_revision_timestamp": "2013-12-10T00:25:13Z",
  "is_redirect": false
}