{
  "title": "Accessible Arduino 1page",
  "ns": 0,
  "id": 522,
  "slug": "Accessible_Arduino_1page",
  "latest_revision": {
    "id": 2868,
    "timestamp": "2011-09-22T01:26:25Z",
    "contributor": {
      "username": "Rrix",
      "ip": null,
      "id": 43
    },
    "comment": "/* Accessible STEM education and retention */ Formatting",
    "text": "=Accessible STEM education and retention=\n\nJacob Rosenthal  - HeatSync Labs\n\nRyan Rix - HeatSync Labs\n\nBlind people love technology because it allows them to be self sufficient -- there are devices out for the blind, costing hundreds if not thousands of dollars, to assist them in measuring water, identifying colors, and notify them of things around them. The blind are great consumers of this technology but when it comes to solving their own day to day problems with technology the way a sighted person might they’re left out.  For example, STEM degrees are still largely unapproachable to the blind student. \n\nThe tool used to learn and implement electronics projects by hobbyists outside and increasingly inside universities to teach computer engineering is called Ardiuno. Arduino was designed to make electronics design, programming and prototyping easy enough for kids, but deep enough for professionals.  Arduino is in use by students at CMU, Stanford, MIT and Arizona State University [1]. Even big business is looking at Arduino; in May, Google announced their new phone development kit would be based on Arduino [2].\n\nSadly, Arduino, like much of the rest of the Computer Engineering field, is not currently accessible.  The programming environment is not screen reader friendly. Further the board contains no tactile clues to explain the connectors and polarity that a sighted user would simply read off the board. Finally, schematics are visual and inherently unusable for the blind. \n\nThese things are fixable though!  Arduino is open source hardware and software which means all of hardware and software schematics and code for the platform are available online. Further, the Arduino team does its work in their public community, which means they accept contributions from anyone who is interested in improving the final product.\n\nIf an Arduino can be used as a prototyping platform to control robots, cameras, lights, speakers and other components for sighted users, why could it not do the same for the blind? By making the tools of creation accessible, we will allow the blind to participate in the conversation and empower them to solve their problems on their terms.\n\nJoin us.\n\nReferences\n#http://arduino.cc/blog/2011/09/16/arduino-confidential-open-hardware-summit/\n#http://www.google.com/events/io/2011/sessions/android-open-accessory-api-and-development-kit-adk.html",
    "bytes": 2392
  },
  "revision_count": 6,
  "first_revision_timestamp": "2011-09-22T00:59:54Z",
  "is_redirect": false
}