{
  "title": "Accessibility",
  "ns": 0,
  "id": 257,
  "slug": "Accessibility",
  "latest_revision": {
    "id": 1599,
    "timestamp": "2010-12-28T23:22:53Z",
    "contributor": {
      "username": "70.166.115.251",
      "ip": null,
      "id": 0
    },
    "comment": "/* Grants */",
    "text": "Bryan and Jacob have been looking into accessibility grants.  The following is our research which is being applied towards our current goal, the [[Verizon | Verizon Foundation Grant]]\n\n=Grants=\n*[http://grants.gov Grants.gov] as always, keyword search accessibility (these are a little big for our britches probably, until we nail a few small fish)\n**[http://www2.ed.gov/fund/grant/apply/nidrr/index.html National Institute on Disability and Rehabilitation Research (NIDDR)]\n**[http://www.nsf.gov/funding/pgm_summ.jsp?pims_id=501021 National Science Foundation (NSF) Research to Aid Persons with Disabilities (RAPD)] \"Emphasis is placed on significant advancement of fundamental engineering and scientific knowledge and not on incremental improvements.\" - might not fit our current research right now.\n*[http://www.verizonfoundation.org/grant/index.shtml Verizon Foundation] This will be our first target.  ~5-10k and they have an accessibility focus\n\n=Conferences=\n*[https://www.confmanager.com/main.cfm?cid=1559 FICCDAT]\n**recent submission deadline January 4, 2011\n*http://www.federalgrantswire.com/handicapped-federal-grants.html \n*http://www.neh.gov/grants/guidelines/researchdevelopment.html \n\n\n=Seminars=\n*[http://www.freedomscientific.com/seminars/index.asp Tucson Vision Awareness Day]\n\n=Accesibility Ideas=\n\n\n==Arduino==\n\n===Arduino Projects===\nProblems the arduino could solve in a blind  persons house. Think about products that are out there that cost thousands of dollars but that the 30 dollar arduino could do.\n*Arduino in the kitchen.Liquid Level Sensor\n*Color reader\n \n\n===Arduino issues===\nProblems with arduino that we could solve\n*Finding the pins to plug in components\n*There is no audible feedback when entering code in the Arduino IDE.\n*No access to bug report, menu options, buttons, on the Arduino IDE.\n*Method for connecting connectors, extending wire length, soldering wire together/connectors ect. \n *Arduino Language guide\n *Set up guide (setting up serial port, installing software, ect.)\n *No visual/tactile/audible feedback to know if the Arduino is on or working.\n *Method for labeling power vs. Ground wires of components such as ohm speaker, motors, ect.\n \n===Arduino Solutions===\n*Using small motors vs. LED’s would allow for equal access to the status of the Arduino.\n*Labels for each pin/component on the Arduino processor (should be done in braille and also print. The more universal we can make this the better suited it will be in a public setting i.e. Blind working with sighted!)\n*Accessible hardware guide on the Arduino board (pin order, what each does, all the components on the board that makes up the whole processor.)\n*Accessible language guide. (braille, text, ect)\n*Coming up with a good labeling system for labeling wire for power vs. Ground\n*Reconstructing the Arduino IDE for optimal speech feedback\n*Color coding code written in the IDE for easy to detect script errors \n*Making sure that the buttons are set up with hot keys for quick compile/run\n*Full access to bug report\n*Highlight any errors in the code starting from the top down to easily give the blind user exact feedback on where his/her problem is.\n*Status updates when code is being compiled OI.E. Some kind of feedback to notify the user that an action is taking place.\n*Full access to menu options, buttons, windows, and dialog boxes on the Arduino IDE\n*Access to a language guide or quick reference guide.\n \n==Random ideas==\nAn OCR program that allows the user of a computer with a web cam built in or external, to snap pictures of text for conversion into speech output. This would take care of all areas of access to printed material in the class room for the blind or low vision. RFB and D just put out a Daisy book reader for the Mac so now you can Download, Read, and store your text books right from the computer you are sitting in class with. Now the only piece that is missing is the access to printed material, ie handouts, or text books RFB and D does not have recorded. \n\n=Relevant Schools=\nSchools to ask questions. Would they want to teach programming/technology if it was accessible, would it be a program that is offered to blind students if training/coaching was available, what technology/programming/scripting classes are currently offered in your school, why? \n*Schools for the deaf and blind http://sdsbvi.northern.edu/wwwresources/list.htm \n*Counsel for the blind http://www.cosb1.org/ \n*This site has a bunch of schools that are perfect. Arizona, nebraska, texas, New York... http://www.lowvision.org/schools_for_the_blind_.htm \n*Colorado Center for the Blind http://www.cocenter.org/ \n*Foundation for Blind Children http://www.seeitourway.org/#mainContent \n*SAAVI http://saavi.us/ \n*NFB http://www.nfb.org/nfb/Default.asp \n*VA Hospital http://www1.va.gov/BLINDREHAB/index.asp \n \n=Accessibility Institutions=\n10 institutions we can go to for feedback, testing, input, help, suggestions. \n*FBC\n*CCB \n*NFB \n*SAAVI \n*Vocational Rehabilitation\n*ACBVI",
    "bytes": 4991
  },
  "revision_count": 4,
  "first_revision_timestamp": "2010-12-28T07:32:27Z",
  "is_redirect": false
}