{
  "title": "An Idea For Tempe Migration",
  "ns": 0,
  "id": 1272,
  "slug": "An_Idea_For_Tempe_Migration",
  "latest_revision": {
    "id": 4823,
    "timestamp": "2020-09-05T20:27:17Z",
    "contributor": {
      "username": "RobertBushman",
      "ip": null,
      "id": 713
    },
    "comment": "/* Proposal */",
    "text": "= Proposal =\n\nHSL wants a larger space, and is considering moving somewhere other than Mesa. I threw the following together as one concept of how that might work.\n\nI added a hypothetical [[Ten Thousand Foot Layout Concept]].\n\nSee Also: [[New Space Noodling 2020]]\n\n= Investors =\nAn investor group will be formed to purchase a warehouse in the industrial district immediately to the south of Tempe Marketplace. They will watch market prices on commercial property from now (Sep 2020) to Spring 2021, with the intent of purchasing a property in time for HSL to move in starting in May 2021. The continuing COVID-19 pandemic and end of stimulus from the federal government is likely to result in a pull-back in the commercial property market over the coming months. We should seek to time the market with the intent to purchase in late Q1 or early Q2.\n\nParticipation in the investor group will be offered first to members of HSL and persons with credible histories of support for hackerspaces. This will help to keep their interests aligned with the HSL charter.\n\n= Property Minimums =\n* 10,000 square feet for use by HSL.\n* Zoned light industrial.\n* Fully air conditioned. (or price low enough to cover cost of installation)\n* <TBK> amp 220 two phase and <TBK> amp three phase. (or priced low enough to cover cost of installation)\n\n= Expected Cost and Down =\nBuildings that match the description are about $130 per square foot, putting the ballpark estimate at $1.5m to $2.2m (assuming that finding a building of exactly 10,000 ft2 is unlikely). Commercial real estate loans are typically for no more than 75% of the lower of sale price or appraised value, putting downpayment at $375k to $550k. Hopefully it will be a bit lower if the expected pullback occurs.\n\n= Lease Rate =\nInvestor group will charge market rate to HSL, currently approximately $0.80 per square foot per month. \"Market Rate\" to be determined in cooperation between the Investors and HSL annually based on an average of comparables. Investor group charter would include a requirement to provide reasonable support for HSL's non-traditional use of the space. HSL would be treated as a preferred lessor (whatever that means - first right to refuse on vacated additional space? not getting tossed out as long as they are paying market rate - even if someone wants to pay more?)\n\n= HSL Financial Prospects =\nTo help mitigate the risk for the investor group, HSL will develop a plan for increasing cashflow earmarked for their property lease from $3,000 to $8,000 per month. This plan will be made available to potential investors to help set the hook.\n\n= Excess Square Footage =\nIt is unlikely that we will find a building that is exactly 10,000 square feet. That is not a problem, it is an opportunity.\n\n* One or more of the investors may be interested in holding some of the remaining space for their own business.\n* Investors may be interested in leasing the additional space to members, member-owned businesses, or unaffiliated third parties.\n* HSL may be interested in leasing additional space to sublease to members or member-owned businesses as a membership benefit, or to sublease to unaffiliated third parties to offset the cost of leasing their 10,000 square feet.\n\n= My Motives =\nI (Robert Bushman) am writing this because I want to be an investor (in the 25%+ range). I have been looking for creative ways to acquire a larger space for my metal shop, which will become my semi-retirement business within the next couple years. I am a lifelong hacker and a fan of hackerspaces since I was living in San Francisco, where I spent time at NoiseBridge and the first TechShop in Menlo Park (when it was the only TechShop). I've been a $25 member for 8 years or so, and have my industrial sewing machine on long-term loan, but work has kept me from being a proper contributing member of the do-ocracy.\n\nMy ideal situation is to have a couple thousand square feet for my metal shop, and to have HSL in the same building. I would work to earn a card membership and help with HSL's expansion program. I would be especially focused on supporting proposals and fundraising to build/acquire equipment that would be hard to justify for my shop alone, like a CNC plasma table.\n\nI think there is a good opportunity for HSL to expand to become an even more significant contributor to hands-on STEM education in the valley. Moving to Tempe opens opportunities to reach a new audience of potential members. A larger space that is more conducive to a broader range of hacking will help turn potential members into dedicated contributors to HSL's mission.\n\nI want to be a part of that.",
    "bytes": 4640
  },
  "revision_count": 5,
  "first_revision_timestamp": "2020-09-04T01:11:52Z",
  "is_redirect": false
}