{
  "title": "Bylaws",
  "ns": 0,
  "id": 69,
  "slug": "Bylaws",
  "latest_revision": {
    "id": 6793,
    "timestamp": "2025-12-13T22:10:01Z",
    "contributor": {
      "username": "Brettneese",
      "ip": null,
      "id": 732
    },
    "comment": "/* CARD ACCESS */",
    "text": "<ol style=\"list-style-type:upper-roman\">\n== <li>NAME AND PURPOSE</li> ==\n\n# The name of this organization shall be known as HeatSync Labs.\n# The purpose of HeatSync Labs (herein referred to as “HSL”) shall be to provide a physical space for members and the public to work on projects (especially projects involving physical creation) and to facilitate relevant education, discussion, collaboration, and planning.\n\n== <li>ORGANIZATION</li> ==\n\n<ol>\n<li>HSL shall be governed by a body of officers henceforth known as the Board of Directors.  The Board of Directors shall exercise authority to enact its decisions upon the membership.  Offices of the Board of Directors will be distinguished according to a particular operational task in a flat hierarchy.  Definitive authority shall be given to no office in particular, but to a majority vote of a quorum of voting officers. These offices established will include, but are not limited to, the following:\n<ol style=\"list-style-type:upper-alpha\">\n<li>'''Champion''': The office of Champion shall be responsible for coordinating tasks between each office of the Board of Directors, assisting HSL membership in membership-related tasks, and enforcing the bylaws.  This office may be occupied by multiple officers, the total of which may not exceed two.  Each officer will receive a full vote on the Board of Directors.</li>\n<li>'''Treasurer''': The office of Treasurer shall be responsible for managing financial assets and liabilities and collecting membership dues, donations, and other revenue. This office may be occupied by multiple officers, the total of which may not exceed two. Each officer will receive a full vote on the Board of Directors.</li>\n<li>'''Secretary''': The office of Secretary shall be responsible for recording the proceedings of HeatSync Lab functions, such as events, fundraiser, and other official activities.  Additionally, the office of the Secretary shall be responsible for the oversight of all records and papers produced in HSL's operations.</li>\n<li>'''Operations''': The Office of Operations shall be responsible for the oversight of HSL operations and delegation of operational tasks to HSL volunteers.</li>\n</ol></li>\n<li>Each officer in the Board of Directors must be elected into office by a majority election of voting HSL members for a term of one (1) year.  Interim-officers may be elected into office by the Board of Directors under the conditions described in Article II, Section 7.  An officer may serve an unlimited number of terms.</li>\n<li>Candidates for offices in the Board of Directors must be [[Rules#Good_Standing|members in good standing]] with these bylaws.</li>\n<li>Elections for the offices of the Board of Directors shall take place at the first membership meeting of the month of October of the Gregorian year.</li>\n<li>For elections pertaining to an office which allows the election of multiple officers in its office, an explicit “ABSTAIN” vote may be accounted as a vote of no confidence for any candidate, and shall be counted no differently than a vote for a candidate, which an election victory for abstain votes resulting in an office vacancy.</li>\n<li>An officer may resign from an office upon the receipt of physically or electronically written notice of said resignation to the remaining officers of the Board of Directors.</li>\n<li>In the event that an officer of the Board of Directors becomes incapacitated, deceased or resigns from office, a quorum of remaining officers in the Board of Directors shall elect a replacement interim-officer at the Board of Directors meeting following the resignation.  An interim-officer's term shall be effective from the day of election by the Board of Directors to the remainder of the outgoing officer's elected term.</li>\n<li>An officer of the Board of Directors may be removed from office by the unanimous vote of the remaining officers in a Board of Directors meeting, or by a majority vote of all dues-paid members. A special election must be held within 60 days to elect a replacement according to normal election procedures.</li>\n<li>The Board of Directors shall convene once a year on the first member meeting in April to conduct business and enact decisions regarding the operations and administration of HSL.</li>\n<li>Ad-hoc committees of members may be established by an office of the Board of Directors for any purpose relevant to the responsibilities of that office.  Members of that committee may be appointed or removed at the discretion of the office that created it.</li>\n<li>All monetary expenditures provisioned by HSL's treasury will require the written signature of a minimum of two officers of the Board of Directors for approval.</li>\n<li>A quorum of the Board of Directors shall be established at two-thirds of the total number of elected officers, and will be required for voting on issues regarding membership approval, termination of membership, and election of interim-officers in the event of a departing officer as described in Article II, Section 7.</li>\n<li>Each officer of the Board of Directors must be present at regular meetings of the Board of Directors, or must provide a reasonable explanation for an absence at least 24 hours prior to a scheduled meeting of the Board of Directors.  Failure to provide a reasonable explanation for an absence for two absences in a year will qualify in a breach in these bylaws and may result in the removal from office of the offending officer as described in Article II, Section 8.</li>\n<li>The Board of Directors, in a majority vote, must approve any purchase made by HSL if the purchase total exceeds the sum of $50.</li>\n</ol>\n\n== <li>INTERESTED PERSONS</li> ==\n<ol>\n<li>Limitations on Interested Persons. At all times, not more than 49% of officers in the Board of Directors may be Interested Persons. An Interested Person is defined as:\n<ol style=\"list-style-type:upper-alpha\">\n<li>Any member currently being compensated by the organization for services rendered to it within the previous twelve months, whether as a full-time or part-time employee, independent contractor, or otherwise, excluding any reasonable compensation paid to a director in his or her capacity in the Board of Directors; Or</li>\n<li>Any brother, sister, ancestor, descendant, spouse, brother-in-law, sister-in-law, son-in-law, daughter-in-law, mother-in-law, or father-in-law of any such person.</li>\n</ol>\nIn the event that an election results in a majority of Interested Persons elected as officers in the Board of Directors, the current officers of the Board of Directors shall vote for the removal of a sufficient number of Interested Persons to meet the quota of non-Interested persons defined in this section.  Following the removal of a sufficient number of Interested Persons, the remaining officers of the Board of Directors shall hold a special election to fill in any offices left vacant by the removal of Interested Persons, as described in Article II, Section 7.\n</li>\n<li>\nWhere it is not reasonably practicable to obtain approval of the Board of Directors before entering into a self dealing transaction, the office of the Treasurer or Champion may approve such a transaction under the condition that, at the following meeting of the Board of Directors, a quorum of the Board of Directors determines that the transaction was in the unbiased and best interests of the HSL and that it was not reasonably practical to obtain advance approval by a full quorum of the Board of Directors.\n</li>\n</ol>\n\n== <li>MEMBERSHIP</li> ==\n\n# Membership in HSL shall be open to anyone in the community with a genuine interest in the HSL's purpose, and shall not be discriminated against on the basis of color, race, gender, national origin, religion, creed, political affiliation/orientation, sexual preference/orientation, age, disability, software preference, or veteran status.\n# Members have the right to a single vote for each office in the Board of Directors in the annual election of the Board of Directors and  any rights inherited in membership for an Arizona Nonprofit Organization.\n# Membership may be terminated by a majority vote of the Board of Directors in the event that the Board of Directors has found the member in question to be in violation of these bylaws, or place HSL members or assets at risk.\n# Members may terminate their membership at any time for any particular reason by submitting written notice to the Board of Directors and will be required to pay the full sum of their dues for the month that they terminated their membership.\n# Members may bring guests to HSL and guests may use HSL tools, however all parties involved must have completed a liability waiver and all guests must be adequately supervised by the member who brought them.\n# Basic membership may be granted for a period of three months to persons of the community that the Board of Directors declare recognize as having made a significant contribution to the assets of HSL.  This program shall be entitled the \"Quarterly Scholarship.\"  The Quarterly Scholarship may only be issued to the same person once in a 3-month period and must be awarded by a majority vote of the Board of Directors.\n\n== <li>CARD ACCESS</li> ==\n\nHaving card access to the lab is both a privilege and a responsibility.  Card access is a privilege based on trust, not a \"right\" of membership.  Having card access means that the individual understands and respects the rules of the lab and is willing to conform to said rules.\n\nFor example, introduce yourself during open hours, help out during HYH, make friends, make things, ask for proposals that benefit the lab, provide constructive feedback on other's proposals. If you can't come in during open hours, make friends online and ask for favors. It's tough but we're a community not a business.\n\n=== Eligibility ===\nMust be a paying member at the $50 or higher level, in good standing, for a minimum of two (2) months\nMust attend HYH, or during public hours, so the community can be introduced to the individual\n\n=== Nomination / Proposal ===\nAny current card member can nominate a non-card member once the non-card member meets the eligibility criteria.\nProposal for card access is posted publicly via Google Groups (subject prefix \"Proposal: Card Access for xxx\") at least 2 weeks prior to the HYH meeting.\nThe member making the proposal *must* be present at the HYH to introduce the non-card member (if necessary) and to answer any additional questions that might come up.\nThe member making the proposal will be a mentor/responsible for the non-card member for a 6-month probationary period.\nMembers may only make “one” card access nomination per year. Example: If Member A nominates someone, whether it passes or not, Member A may not nominate another person for 12 months.\n\n=== Approval ===\nCard access can only be voted on by card members.\nThere must be at least 5 card members present to vote.\nMembers can receive cards when approved by a majority vote of card members at an operations meeting (\"Hack your Hackerspace\" night).\n\n=== Revocation===\nCard access may be removed at any time by the Board of Directors.\nCard access is immediately terminated if the member cancels their membership or lowers their membership to a non-eligible level.\nCard access may be removed due to code of conduct violation.\n\n== PROPOSAL PROCESS ==\n\nBased on Current Practices and Robert’s Rules of Order\n\nHeatSync Labs has a proposal process so that changes to the space are made thoughtfully and with input from the community. It gives members a way to suggest ideas, discuss them openly, and make sure they are practical before being put to a vote. This helps avoid rushed decisions, keeps things fair, and ensures that proposals are realistic and beneficial. It’s a simple way to make sure everyone has a say in how HeatSync Labs evolves.\n\n=== Proposal Submission === \n\n*The individual submitting the proposal must be its owner and responsible party. Proposals may not be submitted on behalf of another person unless they explicitly agree to take ownership of the proposal and its implementation.\n*Any active, paying/scholarship member may submit a proposal.\n*Proposals must be posted to HeatSync Labs’ Google Groups instance for open discussion and feedback.\n*Proposals must be submitted at least 9 days before an HYH meeting to be eligible for voting.\n*The proposal must include:\n**The specific change or project being proposed.\n**The reason for the proposal and expected benefits.\n**Estimated costs and resource requirements (if applicable).\n**The timeline for implementation.\n\n===Proposal Discussion and Refinement (9-Day Discussion Period, Lock-In Rule)===\n\n* Members provide public feedback in the Google Group before the HYH meeting.\n* Proposals should be discussed in depth, and members are encouraged to provide substantive feedback rather than just “+1” or “I agree.”\n* The proposer may adjust the proposal based on discussion, but:\n* No further changes may be made within one week of the HYH meeting.\n* The final version of the proposal must be clearly posted and locked in the Google Group at least one week before the meeting.\n* If members feel a proposal is too broad or outside the scope of an operational decision, they may request it be dismissed or handled by the Board.\n\n===Proposal Consideration at HYH Meeting===\n\n* Proposals are automatically considered at the HYH meeting if they have been discussed for 9 days.\n* The proposer actively bumps the proposal in Google Groups so members are reminded that the proposal is up for a vote.\n* The proposer (or a designated representative) must add it to the agenda, and verbally introduce the proposal during the meeting.\n* If a proposer fails to mention or remind the group about the proposal, it will not be eligible for a vote and must be deferred to the next HYH meeting.\n* The proposer must provide a brief summary before the vote.\n* If a quorum is not present (minimum 8 paying/scholarship members), the vote may be skipped or delayed until later in the meeting or deferred to the next HYH meeting.\n\n===Voting Process===\n\n* Only paying/scholarship members in good standing are eligible to vote on proposals.\n* A proposal passes with a majority vote of those voting (abstentions do not count toward the total).\n**Example: If 2 vote yes, 1 votes no, and 5 abstain, the vote passes (2-1).\n* A quorum requires at least 8 paying/scholarship members present, but only votes cast count toward the outcome.\n* Ties result in no action, and the proposal does not pass, and may be resubmitted following the resubmission restrictions.\n* Votes are conducted via show of hands or another predetermined method at the meeting.\n* Voting results must be posted to HeatSync Labs’ Google Group within seven (7) days of the meeting to ensure transparency.\n\n===Resubmission Restrictions (Preventing Stacking of Votes)===\n\nIf a proposal fails, it cannot be resubmitted for six (6) months, unless:\n* The proposer makes substantial changes, and the members present at an HYH meeting vote to allow early reconsideration.\n* To be eligible for early reconsideration, the proposer must clearly outline the new information or significant changes before members vote on whether it should return to the agenda.\n* Vote for reconsideration can be made 4 weeks after reconsideration request is made.\n* Substantial Change Examples:\n** ✅ A significant reduction or expansion in scope, addressing major concerns.\n** ✅ Securing external funding that eliminates previous financial concerns.\n** ❌ Minor wording tweaks or slight budget reallocations do not qualify.\n* The discussion on whether a proposal qualifies for reconsideration should take place as part of an HYH meeting agenda item.\n* A similar proposal that only modifies minor details will be treated as a duplicate and will not be placed on the agenda until the six-month restriction expires.\n\n===Implementation and Follow-Up===\n\n* The proposer is responsible for overseeing the implementation of an approved proposal.\n* The proposer must provide regular updates to the HeatSync Labs community via Google Groups or during HYH meetings.\n* If additional resources, approvals, or Board oversight are required during implementation, the proposer must work with the appropriate parties.\n* If the proposer fails to begin implementation within three (3) months, of the stated date in the proposal, or is unable to follow through, the proposal may be reassigned, modified, or canceled by member consensus at an HYH meeting.\n\n===Quick Proposal Self-Check Before Submitting===\n\n* Have I considered how this affects HeatSync Labs’ space, electrical, ventilation, or utilities?\n* Have I accounted for ongoing costs like maintenance and consumables?\n* Does this project require training, cleaning, or member responsibility?\n* Have I confirmed it’s allowed under zoning, insurance, and safety rules?\n* Does this align with HeatSync Labs’ mission and values?\n* Am I prepared to oversee the implementation if this gets approved?\n\n===Addendum: Considerations for Proposal Submissions===\n\nWhen submitting a proposal, it’s important to think beyond the initial idea and consider its long-term impact on HeatSync Labs. Below are key factors that can help refine your proposal and ensure a smoother approval process.\n\n====Building Impact====\n\n* Electrical – Will this require new wiring, outlets, or increased power usage?\n* Ventilation – Does the project produce fumes, dust, or heat that require special ventilation?\n* Floor Space – How much space is needed? Is it a temporary or permanent installation?\n* Water – Will plumbing be required? How will water usage be managed?\n\n====Ongoing Costs====\n\n* Maintenance – Who will maintain the equipment, and what’s the expected cost?\n* Repairs – What happens if something breaks? Is there a repair plan?\n* Consumables – Does the project require materials that need to be replenished (e.g., filament, chemicals, filters, etc.)?\n\n====Usage Considerations====\n\n* Cleaning – Does this introduce new cleaning responsibilities? Who is responsible?\n* Training – Will members need special training to use the equipment safely?\n* Classes & Workshops – Could this be integrated into educational offerings for the community?\n* Lifetime – Is this a long-term addition, or does it have a defined end-of-use period?\n\n====Other Impacts====\n\n* Financial – Does the project require additional funding beyond what’s outlined?\n* Utilities – Will it significantly increase electricity, water, or internet usage?\n* Regulatory Compliance – Is it allowed under local zoning laws, safety codes, or lease agreements?\n* HeatSync Labs’ Public Image (“Goodwill”) – Does this align with our reputation and community values?\n* Alignment with Mission & Vision – Does this support HeatSync Labs’ core mission and enhance its role as a creative and educational space?\n\n== CODE OF CONDUCT ==\nSummary- I shall (i) use HeatSync Labs with the purpose to provide a physical space for members and the public to work on projects (especially projects involving physical creation) and to facilitate relevant education, discussion, collaboration, and planning; (ii) take good care of the premises and keep it clean and orderly; (iii) not waste electricity or other resources; (iv) agree and warrant that if at any time I believe conditions to be unsafe, I will immediately discontinue further participation in the activity whether by myself or others; (v) be excellent to each other; and (v) I will report misconduct to the board of directors at [mailto:conduct@heatsynclabs.org conduct@heatsynclabs.org].\n\n=== Purpose ===\nThe purpose of this document is aspirational in nature.  The big idea is to treat others and all tools in the space the same way that you treat someone you care about.\n\nA big part of HeatSync Labs mission of making tools accessible is to be inclusive to the largest number of contributors, with the most varied and diverse backgrounds possible. As such, we are committed to providing a friendly, safe and welcoming environment for all, regardless of age, gender, gender identity and expression, sexual orientation, disability, race, national origin or ancestry, socioeconomic status, and religion (or lack thereof).\nThis code of conduct outlines our expectations for all those who participate in our community, as well as the consequences for unacceptable behavior.\nWe expect all those who participate in HeatSync Labs to help us create safe and positive experiences for everyone.\n\n=== Open [Source/Culture/Tech] Citizenship ===\nA supplemental goal of this Code of Conduct is to increase open [Source/Culture/Tech] citizenship by encouraging participants to recognize and strengthen the relationships between our actions and their effects on our community.\nCommunities mirror the societies in which they exist and positive action is essential to counteract the many forms of inequality and abuses of power that exist in society.\nIf you see someone who is making an extra effort to ensure our community is welcoming, friendly, and encourages all participants to contribute to the fullest extent, we want to know.\n\n=== Acceptable Behavior ===\nThe following behaviors are expected and requested of all community members.  Examples are not comprehensive, but give an idea of the expectations.\n\n'''Expectation''':\nParticipate in an positive and active way. In doing so, you contribute to the health and longevity of this community.\n\nExamples:\n*Attend classes, workshops, and meetups\n*Hold classes, workshops, or meetups\n*Ask about and/or compliment someone’s project\nNon examples:\n*Sitting for extended amounts of time without working on a project\n*Accusing others of not working on anything\n\n'''Expectation''':\nExercise consideration and respect in your speech and actions, remember that community event venues may be shared with members of the public.\n\nExamples:\n*Be aware of the audience around you in the space (young makers, open house, etc.)\nNon examples:\n*Excessive or constant profanity\n*Not closing the shop door during a meeting or class up front\n\n'''Expectation''':\nAttempt collaboration before conflict.\n\nExamples:\n*Tell someone if something offended you or made you uncomfortable\nNon examples:\n*Assume everyone thinks and feels the same way as you.\n\n'''Expectation''':\nRefrain from demeaning, discriminatory, or harassing behavior and speech.\n\nExamples:\n*If you can’t say something nice, don’t say anything at all\n*be aware of people around you in the space at all times\n\n'''Expectation''':\nBe mindful of your surroundings and of your fellow participants. Alert the event host if you notice a dangerous situation, someone in distress, or violations of this Code of Conduct, even if they seem inconsequential.  For minor situations, like forgetting safety glasses, remind the patron of expectations of the community.\n\nExamples:\n*Use tools appropriately\n*Clean up after yourself\n*if given a reminder to be safe, follow the expectation\nNon examples:\n*not wearing safety glasses in the woodshop or machine shop\n*leaving drawers open or things on the floor or in walkways\n*taking up multiple places at the tables when a class is scheduled\n\n'''Expectation''':\nFollow safety rules.  If you are not sure if something is ok, assume it is not.\n\nNon examples:\n*using a tool when you aren’t certified.\n\n=== Unacceptable Behavior ===\nThe following behaviors are considered unacceptable within our community:\n*Violence, threats of violence or violent language directed against another person.\n*Sexist, racist, homophobic, transphobic, ableist or otherwise discriminatory jokes or language and personal insults.\n*Posting or displaying sexually explicit material.\n*Posting or threatening to post other people’s personally identifying information (\"doxing\").\n*Inappropriate photography or recording.\n*Inappropriate physical contact. You should have someone’s consent before touching them.\n*Unwelcome sexual attention. This includes but is not limited to sexualized comments or jokes; inappropriate touching, groping, and unwelcome sexual advances.\n*Deliberate intimidation, stalking or following (online or in person).\n*Advocating for or encouraging any unacceptable behavior.\n*Sustained disruption of community events, including talks and presentations.\n*Theft, removal, or use of any property, including property of HeatSync or members, without approval of the owner.  \n*Horseplay and excessive or dangerous pranks.\n*Unsafe use of tools\n\n=== Weapons Policy ===\nWeapons will be allowed at HeatSync Labs events, community spaces, or in other spaces covered by the scope of this Code of Conduct. Community members are further expected to comply with all state and local laws on this matter. Weapons shall be handled carefully, only by those trained to handle them to minimize risk to guests, members, and themselves. \n\n=== Consequences of Unacceptable Behavior ===\nUnacceptable behavior from any community member, including board members and those with decision-making authority, will not be tolerated.\nAnyone asked to stop unacceptable behavior is expected to comply immediately.\n\nIf a community member is reported to engage in unacceptable behavior, the board will investigate and may take any action they deem appropriate.  Action will be chosen based on the offense and may include cleaning duty, volunteer service time, being prohibited from working in a specific station, up to and including a temporary ban or permanent expulsion from the community without warning (and without refund).  The board reserves the right not to pursue consequences until three similar complaints are made.\n\nIf you hinder the board’s ability to conduct these procedures and actions, you will be found in violation of the Code of Conduct and also subject to disciplinary action.\nThe board may render consequences publicly or privately.  If anyone makes the consequences public when the board has chosen for them to be private, they shall be in violation of this code of conduct and also be subject to disciplinary action.\nAll reports, records, and actions resulting from this code of conduct shall be recorded and retained by emailing them to [mailto:conduct@heatsynclabs.org conduct@heatsynclabs.org].\n\n=== Reporting Guidelines ===\nIf you are subject to or witness unacceptable behavior, or have any other concerns, please notify a board member as soon as possible. Email [mailto:conduct@heatsynclabs.org conduct@heatsynclabs.org] or place a written complaint in the physical box (LOCATION TBD).\nAdditionally, board members are available to help community members engage with local law enforcement or to otherwise help those experiencing unacceptable behavior feel safe. In the context of in-person events, organizers will also provide escorts as desired by the person experiencing distress.\n\n=== Addressing Grievances ===\nIf you feel you have been falsely accused or unfairly punished for violating this Code of Conduct, you should notify the HeatSync Labs Board with a concise description of your grievance. Grievances will be handled by the board as follows:\n\nThe board will not review grievances. A committee consisting of one board member, three members randomly drawn from the members present at the next Hack Your Hackerspace (Hereafter referred to as HYH) public membership meeting.  If there are conflicts with those members-as decided by the quorum at HYH, they shall be excused and replaced with another random member.  The request to membership at HYH shall be generic, with no names or description of the situation.  The 4 person committee shall review the evidence provided to the board and the punishment allotted by the board.  The committee shall either uphold, revoke, or modify the punishment allotted by the board.   \nIf you feel that you have still been falsely accused or unfairly punished you may propose the review of your case at HYH by the general membership.  The proposal for HYH review of a grievance shall be general with no specific information including name or type of situation.  All records will be presented to the Membership at the HYH for review and a vote (records may be redacted to protect victims).\n\n=== Scope ===\nWe expect all community participants (contributors, paid or otherwise; sponsors; and other guests) to abide by this Code of Conduct in all community venues–online and in-person–as well as in all one-on-one communications pertaining to community business.\nThis code of conduct and its related procedures also applies to unacceptable behavior occurring outside the scope of community activities when such behavior has the potential to adversely affect the safety and well-being of community members.\n\n=== Contact ===\nTo report violations of this Code of Conduct, email [mailto:conduct@heatsynclabs.org conduct@heatsynclabs.org] or place a written complaint in the physical drop box (LOCATION TBD).\n\nFor comments, questions, or concerns regarding this document, email [mailto:board@heatsynclabs.org board@heatsynclabs.org].\n\n=== License and attribution ===\nThis Code of Conduct is distributed under a Creative Commons Attribution-ShareAlike (CC BY-SA 3.0) license. It is based on the Geek Feminism Community Anti-harassment Policy.\n\n== <li>COMMUNITY RELATIONS</li> ==\n\n#HSL may engage in joint ventures and partnership with other organizations in the general community where it is in the interest of all parties involved to promote the purpose of HSL as partnering organizations.\n#HSL assets shall remain under the complete and undivided ownership of HSL.  Assets, such as equipment, may be temporarily loaned for the use of other partnering organizations.  A majority vote of the Board of Directors shall be required to allow partnering organizations to utilize HSL assets.\n\n== <li>AMENDMENTS</li> ==\n\n#Proposed amendments to these bylaws shall be submitted in electronic writing to the membership through the proposal process outlined in section 6 and subject to the same rules and procedures including, but not limited to, a non-binding vote by members at a membership meeting. This procedure applies to all proposed amendments or changes to these bylaws, including those initiated by the Board of Directors. Following membership review, the proposed amendment shall be submitted in physical or electronic writing to the Board of Directors. At a meeting of the Board of Directors, a majority vote of the full quorum of officers of the Board of Directors will be required for the amendment to become enacted and effective upon completing the vote.\n\n</ol>\n\n== Keywords ==\n\ncharter constitution",
    "bytes": 30634
  },
  "revision_count": 63,
  "first_revision_timestamp": "2009-12-28T02:03:04Z",
  "is_redirect": false
}