{
  "title": "CNC Mill Notes",
  "ns": 0,
  "id": 1089,
  "slug": "CNC_Mill_Notes",
  "latest_revision": {
    "id": 4956,
    "timestamp": "2020-10-10T19:54:06Z",
    "contributor": {
      "username": "Gamebofh",
      "ip": null,
      "id": 710
    },
    "comment": "+category",
    "text": "== Minutes ==\n=== Oct 3, 2013 ===\n<pre>\nchampion: oliver\ncnc experts: greg, aaron\nthis machine's experts: austin k, tim m, nate c, bought from joe\nother: jeff, alex, larry, will\n\ntodo:\nbuy mach3 wizard license? ($75)\nbuy new wrench for big clamping kit bolts (7/8\")\nmod emergency switch to stop spindle (austin - weekends, after thu - deadline nov 3)\n - 24v relay, contactor, etc\nbuild lid for power supply\nrun separate circuit for spindle?\nget ups for cnc computer\nfigure out toolchange procedure (possibly run them as separate programs? common reference point issues. reference off the vice?)\nfigure out how do display file inside mach3\n\nwarnings:\nmake sure head is above everything on bed\nif reset is flashing, undo e-stop?\nspindle motor takes awhile to stop!\nif the microcontroller board freezes, the kill switch may not work\nonce the z axis is homed, don't adjust the manual knob\n\ninfo:\ncnc table and computer table can be redone (smaller)\nlimit switches redone\n (mach3 doesn't know which switch has been hit! total stop)\n \"soft limits\" button on mach3\ngecko stepper motor controllers - custom controller board\nspindle speed controlled manually, via pulleys (run aluminum/wood/etc mainly instead of steel for simplicity?)\nlower link belt has reduced chatter (possibly due to bump in regular belt)\nreturn spindle to top in order to access drawbar\n</pre>\n\n== Info about the Mill Itself ==\n* The stepper PSU draws about:\n** 0.3 amp idle\n** ~0.6 amps per stepper (unloaded, just jogging)\n** about 1.7 amps total (multiply by 2 to estimate max load, so budget for 3.4 amps?)\n\n== Notes for Future CNC Mill Class ==\n\n=== Maintenance Responsibilities ===\n* create a checklist for posting at the tool before usage\n\n=== Class Ideas ===\n* regular meetups might be a good idea to establish a CNC community, reach critical mass, and get community participation instead of offering a “class” per se\n* prerequisite: mill and 3d printer?\n* demonstrate skill? make a gauge block?\n* do we teach g-code to manually verify validity, or identify problems?\n* find good workflows – solidworks -> hsm express? cad -> cambam? Mach3 vs other CNC programs?\n* possibly distribute materials to study – written – and then only do one-on-one instruction afterwards.\n* class sizes should be small, 1-3 people, and somewhat customized to student skill levels.\n\n=== Class Prerequisites ===\n* Experience with CNC (laser or 3D printer)\n\n=== Not covered in this class ===\n* Design/layout (planning your piece)\n* CAD (creating the drawing of your piece)\n* CAM (converting the drawing to G-code / machine instructions) \n** g-code/m-code (study simulator?)\n** make a standardized part within spec – demo corners, radiuses, directions, up/down/drill/mill\n** create g-code in cambam\n*** save your cad files and g-code in inches for mach3\n\n=== Class Outline ===\n* How to read calipers, dial indicators.\n* Feeds/speeds/flutes/materials (checking for uniformity)\n* Changing belts\n* Changing tools, setting up tools\n* Clamping/vice/mounting\n** Spacer?\n** Squaring\n* Safety issues incl. Earplugs, e-stops, spindle stops, vices\n* X, Y, Z axes and directions\n* Operations to mill a part in layers / steps\n* Standard mill operations (drill, pocket, profile)\n* Mach3 operating controls\n** Reset\n** Wizards\n** Viewing operations on computer (may not move as shown)\n* Turning Mill on\n* Tab / arrow keys to jog\n** Changing jog speed\n* Touching off part & zeroing mach3\n** Where to set zero at on the machine\n** Checking correct height\n** Tool offset at appropriate value (quick change height issues)\n* Going to coordinates\n** Don't change machine coordinates!\n* Changing feed rate for cut\n* Go over each tool / end mill for various jobs\n* Cut in the air first\n** Check for the part hitting the machine or obstructions\n** Check for clamp/table clearances\n* Cut a sample from an easy material (wood/plastic/aluminum)\n* Check soft limits (on/off?)\n* Tool changes\n* Lubrication/coolant\n* Sounds and smells of good cuts\n* Check clamps to make sure they're still tight\n* Run part, giving everyone hands-on time\n** Teach in three stages: explain/watch, instruct/do, do/verify\n** How to diagnose surface quality issues, diagnosing diagonal x/y issues\n* Clean, and inspect mill for defects\n* How to leave machine (set up? squared?)\n\n=== Machine maintenance ===\n* Lubrication of machine\n* ???\n\n=== Mill Notes (source material for class) ===\nMill needs:\n* tool selection\n* speeds and feeds\n* mounting, locks, clamping, pulleys\n\nDesign notes:\n* It's possible to change parameters in your CAD/CAM software to fine-tune the algorithm, i.e. to avoid using inefficient z-axis moves or routines.\n\nCNC special notes:\n* raising and lowering the head in the back with a lug wrench (23mm, written on the bolt)\n* the bolts are poor quality and tend to stretch; we need to get decent replacement bolts\n*** Corey's had to hacksaw the bolt out in the past\n* inside the top lid door is the chart that shows the pulley speeds (look at 60hz column, change the belts to the speeds you need)\n** you must loosen the wingnut on the back right and adjust the back-left bolts to loosen the motor so you can adjust pulleys.\n** you must also loosen the bolts up top to loosen the middle pulley (and re-tighten!)\n* some belts are junk, causing poor surface finish and vibration. the B-33 belts from Grangier had visible imperfections in it. the shorter-length link belts (a-link-5) seem to induce higher-frequency vibrations which affect performance less.\n\n* There are normally bolts for locking down the axes, but that can strip out due to the CNC operation so the locks have been removed.\n* All axes have limit switches, which improve safety; if the software is running right (which it usually does) then the mill will stop before running off the edge (and breaking things). For example Mach3 might freeze, which might cause the limit switches to be ignored (because they are implemented in software**- Joe's CNC logic circuit board has separate grounds, which prevents the limit switches from stopping the motors both logically and physically.) \n* Additionally, the red E-Stop button is software-only, it does not stop the spindle from spinning due to how our power is situated. It's a good idea to stop the X-Y motion with the E-stop first, and then shut down the spindle, to prevent breaking a bit. The spindle motor is stopped with the Fwd/Rev/Stop switch on the front-left of the machine. If in doubt, hit the E-Stop first so you don't throw something across the room.\n*** Ideally we'd built a box which stops all these things, or even better we'd use a VFD to control all items centrally.\n*** Maybe in the short term we can build a kill switch in a more accessible location than the two existing switches.\n* Finally, we need to cover the A/C power supply because it's currently open-air (with a warning sign.)\n\n* Use a vacuum or a chip brush to clean the chips as they come off.\n\n* Draw bar is 17mm. To tighten, hold the pulley while wrenching draw bar.\n** Recommend getting a torque wrench to gauge and avoid overtightening.\n\n* Make sure you only turn on the CNC after computer is already booted. Random parallel line noise may cause bad behavior.\n\n* Spindle motor is connected via red extension cord off to the left.\n\nVice:\n* Screwless; it's got lugs underneath. Watch out that you're actually tightened against the material instead of tightened to the vice itself. Even things that appear tight can fly loose during milling.\n\nCNC controller:\n* Blinking light on turn-on waits 10 seconds to charge capacitors, to potentially avoid blowing a circuit breaker. Steppers are run via ~60 volts.\n\nMach3:\n* It's possible to customize the menu, however we should keep it as generic as possible so it's easy to follow along with online guides.\n\n* This version has one setting file for the single machine. There's only one profile. You must run the \"Mach3Mill\" profile on the desktop because the main program profile doesn't have the correct settings for our machine.\n* Normally you don't need to see debugging menu, but you can access it to easily see the various switch status.\n* Each of the switches are wired together; any switch will stop motion. The machine knows which direction it's moving, if it hits while moving a certain direction \n* Offsets menu is where you adjust tool offset. Read the manual for how to do the correct procedure. It stores the height at touch-off point, and it'll calculate the difference between touch-offs, and thus know how long the tools are. Make sure you touch off at the same tool/part. Make sure you don't adjust the tools, because you'll lose your calibration information.\n\n* MDI menu: you can manual data input and type g-code directly in; not recommended.\n** EXPERTS can quickly re-zero by inputting here, etc.\n* If limit switches or E-Stop have been activated, the red RESET button blinks. Click that to enable steppers again. (The E-Stop button must be pulled back out.)\n\n* Jog mode is always on.\n* To jog, use arrow keys. A pendant, controller, or USB keypad might be nice.\n* To set tool height, an electronic probe at the spindle might be nice to automatically zero.\n* Press tab to cycle to jog mode.\n* Jog mode is currently set to 0.0010**- be aware of this before jogging.\n* Hold shift to jog at max, hold ctrl to jog at minimum speed.\n* Soft limits are on; as you attempt to jog towards a limit switch, it'll slow down within 0.5 inch to avoid hitting a limit switch.\n** WARNING. IF YOU HIT RESET AT A STOP, IT IS POSSIBLE TO CONTINUE IN THE WRONG DIRECTION. PROCEED GINGERLY WHEN HITTING 'RESET.'\n\n* Click REF ALL HOME to re-zero all axes. Hold hand near E-Stop to quickly address any failures.\n* Limit switches are accurate to about 3 thousandths when re-zeroing.\n* You usually only need relative coordinates; Machine coordinates are mostly used for debugging.\n* 5 inches Z, 5 inches Y, ~19 inches X.\n\n\n\nWhen loading files:\n* HSM express is pretty good about putting the tools needed at the top of the g-code.\n* Wait until it selects the first tool, and then touch off the first tool. Then Mach3 will know the relative heights of the other pre-set tools.\n* We could load up a macro where, when a tool change is encountered in the g-code, it'll run a routine so you can safely do a tool-change off to the side and then go back to the part once you're ready.\n\n\nBefore beginning:\n** Lay out the tools in the order you'll need them, and re-set all your tool height offsets in Mach3. NEVER ASSUME THEY ARE CORRECT! You don't want to go halfway through a part and realize the offset is wrong and part is ruined.\n*** Touch off with any technique you like; gauge block, paper, di-chem, sharpie, etc**- just be consistent between your tools.\n*** Tools are not interchangeable! Just because Tool 5 and Tool 6 are both \"the same\", their z-height might not be the same!!!\n*** Consider using nail polish to verify a bit hasn't been moved.\n*** Some basic tools are $30, be careful!\n* Lubricate all lubrication points at the start of each job, and make sure you clean up everything when done. Double-check any chips on the backside.\n* Spindle speed is not currently supported by our CNC. You have to set it by hand, the Mach3 setting isn't operable.\n\n\nWhen beginning:\n* There may be a softlimit warning; this is OK.\n* Press the yellow FEED HOLD button to pause.\n\n* Tool changes are indicated by yellow flashing in the center of the screen. You can then use the arrow keys to change the tool and touch off the z-height. Whatever the height is, it'll then set the relative offsets of all other tools in memory.\n* HSM express puts a nice comment saying exactly what tool to use (0.375 in 4-flute flat endmill)\n\n* G53 work offset may cause work to begin off to one side (see red line on table display at top-right of mach3 window)**- proceed with caution.\n* You may have to move the spindle and table to within the bounds of your program to avoid hitting limit switches. Hold hand over e-stop when beginning a file.\n\n* Watch g-code as it scrolls by to see what is happening (comments are good!)\n* You can adjust the speed on the fly; 30% of what's specified, 130%, etc. HSM Express may make overly aggressive suggestions for our machine. See the FEED RATE pane.\n* The table display at top right traces the path with the purple lines (notice the way the end of the line traces a lighter path.)\n\nWhile running:\n* Brush away chips\n* Apply lubrication\n\nTool change:\n* M1, T2 M6, tool description. \n* You can simply touch off a tool and run with it for a simple operation. However with multiple tools, you don't want to touch off every time. In fact, you'll typically lose your reference point during running.\n* See configuration, tool table. Each number, with name, and diameter. Height is the offset. (Part of Mach3 is in inches, part may be mm!)\n* To create a tool height offset, go to offsets menu and enter the number in Tool Info. If using gauge block, set the height of it. Manually move the mill, and then click Set Tool Offset. Move on to new tools by typing in a new tool number. Make sure you click Save Tool at the end!\n* Good idea to number each tool physically.\n\n\n\n[[Category:Machine Shop]]\n[[Category:Mill]]",
    "bytes": 13176
  },
  "revision_count": 10,
  "first_revision_timestamp": "2013-05-16T04:18:56Z",
  "is_redirect": false
}