{
  "title": "Color Printer",
  "ns": 0,
  "id": 1179,
  "slug": "Color_Printer",
  "latest_revision": {
    "id": 4437,
    "timestamp": "2017-05-21T03:03:27Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "",
    "text": "We recently had a color printer fixed up for the lab to use. Cpro made some notes on the group and for simplicity in starting this documentation it is posted in full below.\n\nThe main thing is that the printer driver is on the shared drive; \\\\SHARED\\FILES\\Z:\\HPColorLaserjetCP5525\n\nI've hacked together a couple of the printers we got in to make a working one, and by hacked, I mean hacked. I forgot it was a tear-apart night and I sort of went rogue and had a put-together night.\n\nThere's a hard drive that was bouncing around in my bag for heaven knows how long powering the whole thing.\nThis specific printer was never configured with a hard drive, but rather a small form factor SSD which we have none of, but it's big brother had the option of running an internal spinning disk. As such we do not have the power/data combination cable, nor the plastic caddy to make this work, so I improvised. Why does this matter you might ask? Well the firmware of the printer sort of runs off ssd/hard drive, and is essentially dead to the world without it!\n\nIf you should need to get this beast running again from dead like I did, you will need:\n\n1. a copy of the firmware\n(this is the one I used)-> https://drive.google.com/file/d/0B3SEuN8YFVgwQ2h2Tk9DUnRRZzg/view?usp=sharing\n2. a 2.5\" sata hard drive, or the SSD that goes into this thing\n3. a usb thumb drive\n4. The printer's service code/pin which is set to 11552010 (Also useful for supply resets for the transfer belt and the fusor should the printer complain and not want to print some day)\n\nYou will need the usb thumb drive formatted fat32, and you can put that firmware file on the root of the thumbdrive. You can then use the usb ports on the formatter (there are 2 usb's actually on the formatter card itself (meaning inside the machine)\nSo obviously, power down the machine, unplug it, remove the formatter card entirely, stick the usb thumbdrive into one of the ports on the formatter card, put it all back together, plug it in, power it back up\n\nThen you can choose Download->USB thumb drive->the firmware image, and it will load the firmware off of that thumbdrive onto the hard disk! DO NOT CHOOSE THE USB OPTION! it will not work!\nI suppose there is a usb port on the front panel of the printer hidden by a piece of plastic, but I did not try using that, it probably works but I don't care, because this worked too and there is no reason to attempt it when I know this method works! If you get bored and want to risk wasting some of your time with that method though be my guest.\n\nThe sata data cable is standard, but the power connection for it is a bit custom, and since we don't have the tray that goes with the drive it never came with, I took liberties with it and just jammed the hard drive in wherever it would fit as far as the placement goes. I provided an external power supply which is actually providing juice to the hard drive. Should that become unplugged the printer will become very unhappy, so please try to avoid that. If you must move the printer: Turn off the printer from the power button first(1), unplug the printer power second(2), unplug the hard drive's power brick third(3).\n\nAttached is a picture of what the entire assembly that we don't have looks like.\n \nI figure we can remake that power cable no problem, and just check to see if the voltages match what they should. We only need the 5v rail and the grounds to power this drive, I am unsure if the orange one will read 12v or 3.3v, but if they followed the standard it should be 3.3v.  The size of the connector can be verified if you go upstairs, go to the left of the server rack on the shelf, and on the bottom of that shelf in a marked box with the spare laserjet parts, in the antistatic bag there is a spare formatter board. Attached is a picture of the formatter board with the power connector we need to plug into circled in red and notated.\n\nThe easiest way to make the cable would be to get a sata power connector from a dead computer power supply, and a IDC connector that fit the formatter's power header, make it long enough to poke out the side of the printer, in order to verify the red one is reading 5v with the power on, the orange one 3.3v, and both grounds not measuring any voltage relative to the case of the printer I guess.\n\nCompare the connector to the one that's already attached to the drive to make sure the colors and voltages/grounds match up, and that will be one less hassle for running and maintaining that printer.\n\nSPEAKING of maintenance,\nDo not feed it anything other than copier/laser plain paper so that the transfer belt and fusors last as long as we need them to!\nWe do have a spare fusor in case ours burns out. Also a spare formatter board mentioned earlier.\n\nThe black toner that is upstairs is likely new and mostly unused, so when we run out of black, use that first.\nThe color toners (CMY), that are up there are all low, but still have toner in them, so use them up if you need to.\nThey are prime for rebuilding once they are empty.\n\nYou will need to get into the service menu if the printer refuses to print due to transfer belt life or fusor life, but you can just reset those I think. again you'll need the code/password thing of 11552010\n\nPart numbers for the toners are as follows:\nHP Color LaserJet Black Print Cartridge (~13,500 pages yield) CE270A\nHP Color LaserJet Cyan Print Cartridge (~15,000 pages yield) CE271A\nHP Color LaserJet Yellow Print Cartridge (~15,000 pages yield) CE272A\nHP Color LaserJet Magenta Print Cartridge (~15,000 pages yield) CE273A\n\nThere is a waste toner container(called a TCU) on the back of the unit behind a flap, if it gets full it will throw an error on the printer, and my experience has been even if you try to empty it, it will continue to error, so just get another one if that happens. Part # is CE980A\n\nAnd the most expensive thing we don't have a replacement handy for is the transfer belt.\nHP LaserJet CE516A Transfer Kit(CE516A)\n\n\nIf you want to print to this printer, hook up to the heatsynclabs network, add a printer, and install your printer driver of choice!\n\nhttps://support.hp.com/sg-en/drivers/selfservice/hp-color-laserjet-enterprise-cp5525-printer-series/4073016\n\n\nI personally used the small universal print driver on my windows box, but this is a postscript printer, and pcl5/6, so linux guys should have no problem printing to it either.\n\nIt's setup at 172.22.110.245 for those of you who want to manually configure it, probably port 9100, but I don't remeber/care. (OK I do care, just not enough to drive over to HSL right now and double check)\n\n\nIt will print duplex (2 sided), so do use that feature!\n\n\nKeep it as far away from the laser cutter as possible, as the dust from around that area seems to be good at killing color lasers (hence why the initial install point was near where HSLMAC is)\n\nIt is set up to sleep after 5 minutes or so and is also on the highest power savings it can obtain, so it will take a bit longer than it's rated 10 seconds to spin up, but it'll still print pretty quick.\n\n\nIt's got 2 trays currently, and if they stop working for whatever reason, the feeder rollers are easily replaceable and cheap enough. DO NOT try to recondition the feed rollers, as residue from the process will destroy the fusor, the transfer belt, and potentially even the drum assemblies on each cartridge (guess who found that out the hard way once?).\n\n\nThe maximum paper size it will print is supposedly 12.6in x 18.5in, whatever that ends up being, so you can buy Tabloid paper and print it with this printer!!!\n\nI hope that frankenprinter, which now falls somewhere between a cp5525dn and a cp5525xpi, lasts us a long time.",
    "bytes": 7689
  },
  "revision_count": 2,
  "first_revision_timestamp": "2017-05-20T19:29:59Z",
  "is_redirect": false
}