{
  "title": "Donations",
  "ns": 0,
  "id": 27,
  "slug": "Donations",
  "latest_revision": {
    "id": 5668,
    "timestamp": "2023-10-10T05:01:58Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "",
    "text": "==Donating Stuff==\n\nDonations of stuff should generally be posted on the discussion group before being donated. A Station Champion or someone else willing to do-ocracy cool projects with the stuff should respond before things get left in the lab. Anything that would take up more than 2 square feet would require a proposal.\n\n===Documentation===\n\nHeatSync Labs is now required to record all donations valued at over $50 for tax purposes. After someone accepts a donation be sure to fill out a [[Donation_Receipt]] if applicable.\n\n==Financial Donations==\n\nInterested people/companies may choose to make financial contributions to Heatsync Labs that extend beyond typical membership/automatic donations. See a list of ways to donate below.\n\nPeople who have useful tools or supplies may wish to donate\n\n\n===Check===\n\nChecks can be made payable to Heatsync Labs, and given to any active member.  Active members will then place the check into the drop safe sitting on the east wall of the lab (in the shelves).  The drop safe will be emptied, and checks deposited twice a month.\n\n===Cash===\n\nCash can be given to any active member, who will then place the cash into an envelope (envelopes are available on the top of the safe), make a note on the envelope, and place the envelope into the drop safe located on the east wall of the lab.\n\n===Paypal===\n\nOur paypal address is hslfinances@gmail.com (do not send emails to this address, it is not monitored actively) -- paypal donations may be sent to this address.\n\n===Donation Letter===\nThe following is a Board drafted donation letter that can be used for soliciting donations for HeatSync Lab events or activities.\n*[[Media:Donation_Request_Letter.doc|Donation Letter]]",
    "bytes": 1713
  },
  "revision_count": 19,
  "first_revision_timestamp": "2009-09-09T18:18:42Z",
  "is_redirect": false
}