{
  "title": "Editor Howto",
  "ns": 0,
  "id": 254,
  "slug": "Editor_Howto",
  "latest_revision": {
    "id": 2216,
    "timestamp": "2011-04-10T06:27:33Z",
    "contributor": {
      "username": "70.166.116.7",
      "ip": null,
      "id": 0
    },
    "comment": "/* Writing This Week in Pics Because it Happened */",
    "text": "Running the office of the Editor requires a certain attention to detail and knack for creativity.  The position exists for people that might suck at soldering but want to contribute their right brain for the cause, since a lot of engineers suck at writing.  Here's some tasks the Editor does with some instructions on how to be pro at them:\n\n== Writing Event & Meeting Posts ==\n\n=== Titles ===\n\nBlog posts about events should always, always, and '''always''' include the date they will be happening '''in the title'''.  If you fail to include it, people '''will''' get the date wrong, no matter how many times its mentioned in bold anywhere else in the post.  I guarantee you this.  Titles should be short and sweet, and preferably include just a dash of relevant humor.\n\n=== Photos ===\n\nNot all blog posts require photos, but photos make the post more visually appealing, attention-getting, and share-friendly*.  \n\nBecause the PIrate Party does not dominate American/Arizonan politics, we can't just use any random photos we find in cybersauce in our own content.  Preferably, any photos used in blog posts should be Creative Commons licensed.  Fully copyrighted images should only be used with the explicit permission of the proprietor.  Most CC licenses require attribution, so please include the author's name and a link to their photo's original home in cybersauce if one exists.  A lot of excellent CC-licensed photos can be found on Flickr, and their advanced search lets you filter by license.  Since we're a non-profit, we can use photos allowed for noncommercial use.  This can go in a small caption reading something like:\n\n\"Photo by Matt Mets. Distributed under a Creative Commons Attribution-ShareAlike 2.0 Generic License.\"\n\nAlt text should be included for the visual impaired and/or bored.  Something like \"IMMA CHARIN MAH LAZAH\" for a blog about laser cutters, for example.\n\n=== Written Content ===\n\nNormally, each event should be separately announced.  However, if both events are back-to-back, its best to have a combined blog post for the week to prevent RSS-tl;dr or force the user to scroll down the most recent blog post on the main page to see one about an event happening earlier.  Not everyone checks the website every single day or scrolls pages just for the sake of getting as much use as they can out of their expensive Apple Magic Mouse.\n\nEach event description should include a bold heading with the day of the week, date, time, time zone (for out-of-state visitors who don't understand Arizona's ragequitting of daylight savings time), event name and location name.\n\nThe event of the description should not be boring and ideally be less than a few sentences long to prevent tl;dr.  An example description:\n\n\"Our very own Co-Champion, Jeremy has been dabbling in the world of electro-luminescent (EL) wire, which is sort of like spaghetti, but with a higher voltage and not as tasty.  If you're interested in making things glow with (literally) more flexibility than using LEDs, stop on by!\"\n\n=== Misc ===\n\nThe blog post should always mention that the meeting does not require an admission fee; The mention of membership fees has made some people assume that all non-members would need to pay an entrance fee, which is not the case.  Even if this is explained in other parts of the site, people aren't going to want to leave their RSS reader to check the website for meeting-related information.\n\nThe blog post should always include the event location address with a link to a map of the location.  Since most of the Phoenix valley area is a grid, intersecting street names should also be included.\n\n* Share-friendly, in this case means that when someone shared the blag post link on Facebook/Reddit/Stumbleupon/etc, the photo will show up in the link summary, which makes it more attention-getting than just a plain link with a summary that most people aren't actually going to bother reading until a cool photo catches their attention.\n\n== Writing This Week in Pics Because it Happened ==\n\nActivity is a huge part of the draw that gets people into the lab, so promoting the stuff that happens every day in the lab helps keep bringing new people through the door.  Will-san added the NextGEN gallery to Werdpress to help accomplish this on a weekly basis, preferrably Sunday since Monday is generally a good day for people to waste time at work going through their RSS feeds.\n\n=== How do I blagged photos? ===\n\n# From the Wordpress admin console, find the gallery button on the left column and click Add Gallery/Images.\n# Each week will constitute a new gallery.  The naming convention for each is \"picsbecauseithappened-YYYY-MM-DD\".\n# The display order of the photos depend on the order each photo was uploaded, so the one you upload first will be the first to display in a left-to-right order.\n# Once you've completed uploaded photos to the gallery, you can use a code snippet from a previous photo post and just replace the unique gallery ID with the one you just made; e.g. \"[nggallery id=2]\".\n# Create a short description in a bulleted list that describes the photo.  Make it sound exciting, but keep it short and sweet and aim for the size of a tweet.\n# In each description, include a link to the photo and credits to the person who shot the photo.\n# Publish!\n\n== Shooting and Sharing Pretty Pictures ==\nOur Flickr stream is full of awesome photos that let the world know how active we are and what sort of cool stuff we do.\n\n=== how do i shot photo? ===\nPhotos in general should be in focus and have a proper amount of exposure, either from good lighting or adjusting a camera's ISO levels in low lighting.  \n\nPhotos taken at HSL meetings should be of things that are interesting to the photographer, interesting to the people that missed the event, and possibly interesting to cybersauce in general.\n\nPhotos of people or crowds of people should have them more or less centered or semi-symmetrically positioned with another subject of interest (for example, a crowd of people on one side of the photo with a giant tesla coil on the other).  Photos should mostly be composed of the subject and devote as little space as possible to things that aren't being shot, like empty walls or partial shots of people, furniture, and other things in the way.\n\nWith the amount of activity in HSL that happens every week, it would be difficult to prevent redundant photos of the same things or people being from filling up the HSL Flickr group, which possibly contains half the photos of a Mendel RepRap in existence at this point.  In any case, new photos should be of newer things, but always show off our high volume of activity and participation.\n\n=== Sharing is Caring ===\nWhen uploading to Flickr, please be sure to specify the following for each photo:\n\n*Title: Preferably something unique, but never DSC_1701.\n*License: Preferably a Creative Commons Attribution 2.0 Generic license so that a wider group of people can use it and have to give us credit.  The more people can use or share it == the more people can hear about HSL.\n*Tags: Tags should be included for each photo.  Only include tags relevant to the specific photo, but some tags you could use on most HSL photos might include \"heatsynclabs\", \"hackerspace\", \"arizona\", and \"gangplankphx\" (for shots which include a lot of Gangplank in the background).\n*Location: This isn't used as a discovery tool much, but as the web becomes more localized and mapped-out, it might get use a lot more and let people know there's cool stuff in AZ.\n*People: Allowing people to be tagged in photos is handy, because if someone is looking at pics of the photographer, HSL pics will show.  Don't tag people that don't want to announce their face in cybersauce though.  Privacy == Serious Business.\n*Groups: Cool photos about HSL events should be added to the HSL Flickr group, as well as other groups that the photo might be appropriate for if invited, such as Hackerspace Whiteboards.  More eyeballs, etc.\n\nA lot of things like tags, license, or geolocation will identical across sets of photos, so I recommend using Flickr's batch edit utility to set those things.\n\n== HSL Photo Sync ==\nThe Office of Editor got itself an Eye-fi to totally copy Crashspace's CRASH cam and let random people take photos in the lab and have them automatically upload.  Once they're uploaded, the photos should go through the same process described in \"Sharing is Caring,\" except in this case, only the best of the bunch should be added to the HSL Flickr group.  Attribution for photos taken with hslphotosync should be attributed to HeatSync Labs in general.\n\n== Making Arizona Makers Internet-Famous ==\nThere's a lot of cool things being built by hobbyist makers across Arizona.  We should tell the internet about this, because it's not yet convinced that this sort of thing happens here.  There are, however, some things that should be and shouldn't be covered.  Here's some examples:\n\n'''Cover:'''\n* Finished working projects\n* Projects that took skillz to make\n* Visits to other hackerspaces and places where cool things are made\n* HSL Working group projects that involve several people or just happen to be really cool (SyncFleet nearspace balloon, HelioSync power station, etc)\n* Local (AZ) initiatives to promote engineering or the intersections of engineering and art\n\n'''Don't Cover:'''\n* Unfinished projects, napkin drawings, and pipe dreams\n* Stuff that's already been built over 9000 times\n* Someone's kit they made from some other person's instructions (like a Makerbot)\n* Sales pitches\n\nBlag posts should include photos and/or video, but should not have an explosion of photos or video that would take centuries to load and watch.  Video is cool with the kids these days, and HD is what the cool kids prefer.  The even cooler kids use Vimeo, which is like Whole Foods to YouTube's Wal-Mart.  Videos should ideally be kept under 8 minutes to prevent tl;dr and cat video distraction.\n\nLocal Maker Blog posts should be shared with people at other blogs, such as Make and various popular HSL member blogs that may find it relevant to their interests.\n\n== Evangelizing HeatSync Labs ==\n\nOne of the things this position shares with marketing is bringing a personality to the presentation of HeatSync Labs to the public.  To create a welcoming atmosphere, its ideal that the Board in general practice their communication skills by speaking on and writing about HeatSync Labs.  There's different places to do this:\n\n* Hacker/Maker conferences: In-person events with hackers and makers from different spaces helps forge personal connections between hackerspace, which may eventually lead to something really cool.\n\n* Guest blogging: Local blags such as Gangplank's Blog, Nerdvana, Electric Octopus, blag.dh, MeowMeowBot and other occasionally allow people to write guest posts.  The more buzz is generated online, the more weight it has in decided whether it should be covered by traditional media and larger blogs.  Sometimes, larger blogs and traditional media will also allow guest posts or op-eds.",
    "bytes": 11063
  },
  "revision_count": 20,
  "first_revision_timestamp": "2010-12-19T05:29:18Z",
  "is_redirect": false
}