{
  "title": "Event Notifications",
  "ns": 0,
  "id": 1424,
  "slug": "Event_Notifications",
  "latest_revision": {
    "id": 5962,
    "timestamp": "2024-02-07T01:44:07Z",
    "contributor": {
      "username": "Robert Andrews",
      "ip": null,
      "id": 724
    },
    "comment": "/* Overview */",
    "text": "==Overview==\nThe idea is easy. Have people fill out [https://www.heatsynclabs.org/register/ this form] and notify them when new events get scheduled that they are interested in.\n\nThe implementation is a work in progress. Currently we are using an Airtable form and then I email when a new event is posted. Not recurring events like Sewing Night, or 3d Printer Day. Since those are already on the calendar.\n\n==History==\nIt used to be there was a paper sign up sheet to get emailed when a new laser certification was going to be scheduled. There also still may be a Twitter event triggered 24 hours before an event (not a lot of notice).\n\nSometimes people would ask how they would know when a certain certification class would happen and the answer was you really won't unless you check the calendar.\n\nI'm not clear on when I got it up and running. I began experimenting in August 2018 and for sure it was live by January 2020.\nThe goal was to use Airtable for the form and Zapier to automate emails to people. I never figured out a way to automate the emails. I'm still copying the list into an email.\n\nOriginally it had specific classes that people could select. \n\nIn August of 2022 I added categories to alleviate the problem of having gaps in the options. People couldn't select coding/programming until this change. Not a single class on programming happened in that time. we have a lot of events that are about programming, but not classes specifically. This change was important. \n\nRight now we have 27 tags to choose from. This is both too many and too few. It's too big a list to easily fill out, yet also may exclude some unusual event that we may have someone host.\n\nCurrent Tags: 3d printing, Art, Bicycle Station, BioScience, Chemistry, CNC, Coding/Programming, Cosplay, Crafting, Electronics, Hacking (computer security), Halloween, Jewelry Making, Kids/Young Makers, Laser Cutting, LEGO, Lock Picking, Machine Shop, Music, Photography, Robots/Robotics, Sewing, Silkscreen Station, Vinyl Cutter, Welding, Wood Shop, Yarncraft, \n\n\nI'm thinking about removing sewing and making \"fiber arts (sewing, yarcraft etc)\" into a single tag, but would that mean I have to make \"Metal (welding, machining etc)\"\n\n==Future==\nThere may a way to switch to Mailchimp or similar platform with more complete automation. Exploration has begun, but the know how to complete this isn't part of my repertoire yet.\n\n[[Category:Project]] [[Category:Events]]",
    "bytes": 2444
  },
  "revision_count": 3,
  "first_revision_timestamp": "2023-11-11T16:27:54Z",
  "is_redirect": false
}