{
  "title": "Faq",
  "ns": 0,
  "id": 598,
  "slug": "Faq",
  "latest_revision": {
    "id": 6717,
    "timestamp": "2025-06-01T05:25:09Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "/* Q: Who is in charge? */",
    "text": "=Q: What is HeatSync?=\nHeatSync is a 501c3 community workshop, a hackerspace, where engineers, artists, students and hobbyists come to create their prototypes, their art, and their projects. It is a workshop for mad scientists and mad artists! We're bringing the tools of creation back to the people.\n\n=Q: What do you consider creation?=\nWe believe in a pretty broad sense of creation. We do not segregate based on 'gendered' tasks, noise levels, mess levels, or even safety. We have knitters next to web developers, next to embedded electronics designers, nearby people using lathes, laser cutters and welders.\n\n=Q: How do you pay for all this?=\nHeatSync is primarily supported by donations of time and money, and member dues. HeatSync Labs is also a 501c3 eligible for grants and you can be part of helping us apply for grants. Make a post on the Slack channel #Committee-Grants if you have found a grant that you'd like to help apply for.\n\n=Q: What do I need to bring with me to HeatSync?=\nBring your curiosity, passion, and your project. Bring your respect for and interest in the community. Bring your friends. HeatSync is the valleys best place to mingle with people of like and disparate interests. You will benefit the most if you bring an open mind and a willingness to involve yourself in the many and different kinds of people and projects here.\n\n=Q: So is it free, or do I have to be a member?=\nHeatSync is very soft sell. We are open to the public during our business hours (currently 7p-10p Mon - Wed and Sat noon - 5pm) for the public to join us ENTIRELY FREE OF CHARGE. We invite you to come and bring your curiosity, passion and your project. In some sense it is more important that you come and do awesome things with us, than that we get your money. However, we do need to pay rent and most people who join us for any amount of time end up approaching us asking if they can support us. That is where membership and donations come in. Please support us any way you can whether it be money, time or some other way.\n\n=Q: Can I take a tool home?=\nIn almost all cases the answer is no. HeatSync is a place where we come and create. If tools are removed from the lab we have no guarantee of seeing them again, or of even knowing they are missing until they are needed.  At that point stores may be closed and members may not be able to complete their project. Also in some rare cases, some tools may not owned by HeatSync.\n\n=Q: How can I help improve HeatSync or start an event?=\nStart doing your idea in public! Announce your intentions to a wide audience, set dates/times, and show up to work on it even if it's just you. Send reminders beforehand and/or summaries afterward to keep it on people's minds, and encourage people one-on-one to RSVP yes/no publicly to show activity. Eventually like-minded people will show up, and when they see you making progress they'll be much more likely to join in. This \"snowball effect\" method is a great way of starting stuff in a [http://www.communitywiki.org/DoOcracy do-ocratic community].\n\n=Q: Why doesn't HeatSync do/have X? Why aren't things as good as they could be?=\nGenerally its because you haven't done it yet! HeatSync is entirely member-supported, run, and maintained. Think of HeatSync as your garage. If you need a staple gun and staples you'll have to go out and buy it. If you want a bigger garage, you'll have to find money and build or buy a bigger one. If you want to hold cool events or change the space around, you'll have to organize that. The main difference is that at HeatSync, we've pooled our efforts, so you don't have to start from scratch or do '''every single thing''' yourself :)  For bigger purchases or plans, talk to the other HeatSync members on the discussion board and in person and work to pool the money/effort/skills needed. For some requests, the membership may vote the board to pay for the item via the Hack Your Hackerspace meetings.\n\nOne major principle of HeatSync is \"never tell someone not to make.\" You have nearly-unlimited freedom here! Nobody is stopping you from doing that thing you want to do (but we're not your slaves either, to get something big done you'll likely need to put in some effort, schedule meetings, and convince people to help out!)\n\n=Q: When is the next X class/workshop/certification?=\nWe don't know! First check the [http://www.heatsynclabs.org/events/ calendar] and to see if something might be planned. Then fill out [https://www.heatsynclabs.org/register this online form] to get notified of new classes or events. There are classes/certifications and workshop because you make them happen! Contact a station head about holding a class or another member who might be able to teach you. Post to the group, or if need be research an outside instructor to come in and hold the workshop you're looking for.\n\n=Q: Can HeatSync make my widget for me?=\nNo. HeatSync has no staff and contracts to create no goods. HeatSync is rather a community of creators who utilize the workshop to create their art, prototypes, and projects. However, you very well might find a member of the HeatSync community in person, or more likely on the discussion board, to help you for free or, if the item is more complex, at their contract price. HeatSync does not promote or guarantee any member's work.\n\n=Q: Who is in charge?=\nPractically speaking, nobody and everybody. HeatSync has no paid staff. Members do volunteer to help out with certain tasks and are empowered by the community to do so. There are station managers, ie in charge of the laser cutter, 3d printing, and metal workshop and they are empowered to make decisions about safety and training within those areas.  Every 2nd Thursday night at 7pm and 4th Saturday 9am the group meets for Hack Your Hackerspace where they vote on any existing proposals, arbitrate any issues, and most importantly work to make the space better.  Finally HeatSync is a 501c3 nonprofit which means it is legally compelled to have a Board of Directors. The board meets at least once a year to deal with bigger issues on vision and direction and generally the Board take it upon themselves to sign for contracts on behalf of HeatSync and occasionally on behalf of themselves when for instance HeatSync's credit is insufficient.  If a question or concern cannot be resolved by a member, [[Hosting | host]] or station head, then please do not hesitate to reach out to the board of directors to solve the issue. Other problems, such as misconduct defined by our code of conduct, may be reported directly via email to conduct (at) heatsynclabs _dot_org. No complaint is too small, as things may accumulate and better to be safe than sorry.\n\n=Q: What is Hack Your Hackerspace?=\nEvery 2nd and 4th thursday night at 7pm the group meets for Hack Your Hackerspace where they vote on any existing proposals, arbitrate any issues, and most importantly work to make the space better.  Discussion is encouraged on the discussion boards where all members can participate and hash things out all week. HYH should be less a meeting and more a forum for action.\n\n=Q: What projects can I work on?=\n\nAnything you want! For more ideas, check out the main page of our website, and the [[Projects]] page on the wiki for a (possibly outdated) list of the projects various members are working on. Members are encouraged to document their work on the wiki and link back to that main page, but it's not a definite requirement. Other than that, watch on the Google Group for people who are looking for help.\n\n=Q: What does HeatSync need?=\nYOU to do awesome things. No really. Come to HeatSync. Even when you're tired. Even if you're not a paying member. And not only when you need something. Come share your projects and your knowledge. Help others. Make awesome things. Run that workshop you can't understand why we aren't running. Fix all those things you post vehemently about online. No one is going to do it but you. See you @heatsync tonight!\n\n=Q: I lost something, do you know where it might be?=\nThere is a collect your stuff shelf by the member box storage behind the gray Tech Tear Apart bins. If it's not there, ask on the Google Groups to see if anyone has found what you are looking for.\n\n=Q: I broke a tool, what do I do?=\nNo big deal! If its a small hand tool or bit, place it in the broken tools bin. It is as of this writing a plastic bin placed near the first aid kit at the entry to the shop. Also notify the [[Operations_team | station champions]] and/or post it to the relevant Slack Channel or on the discussion group.\n\n=Q: Where do I park?=\nThere is a good amount of parking around the lab.  In recent months (2023), Mesa has gotten more aggressive about ticketing, so be aware.\n\n* The best place to park is the \"General Parking\" lots.  They have 1-hour and 3-hour slots.\n* The street parking is 2 hour parking and more rigorously enforced because the business there want to make sure it's available for their customers.\n* The MacDonald parking lot is probably the best if you're going to be at the lab for long hours during business hours.\n* A few other notes:\n** Mesa's ordinances on parking are located in 10-3-20 of their [https://library.municode.com/az/mesa/codes/code_of_ordinances?nodeId=COOR_TIT10TR_CH3TR_10-3-20MEPA Code of Ordinance].\n** Here are a few things you can be ticketed for:\n*** Backing into parking spaces (10-3-20(f))\n*** Re-parking within 300ft (10-3-20(g)).  The green lot is about 200ft long, so you have to change lots if you're going to re-park.\n\n[[File:HSL_Parking.png|500px]]\n\n=Q: How do I adjust my membership or donation level?=\nYou have to edit your paypal to cancel a recurring payment\n*Go to Settings.\n*Click Payments.\n*Select Automatic payments.\n*Select the merchant.",
    "bytes": 9747
  },
  "revision_count": 46,
  "first_revision_timestamp": "2011-10-29T10:49:47Z",
  "is_redirect": false
}