{
  "title": "Hack Your Hackerspace",
  "ns": 0,
  "id": 603,
  "slug": "Hack_Your_Hackerspace",
  "latest_revision": {
    "id": 6715,
    "timestamp": "2025-06-01T05:19:27Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "date changes",
    "text": "2nd Thursdays each month at 7pm and 4th Saturday Each Month at the hackerspace. Check the [http://www.heatsynclabs.org/ Event Calendar] to confirm.\n\nAlso see [[:Category:HYH|Past/Upcoming HYH Agendas]]\n\nHYH is the members' night to get stuff done around the space.  It is not a discussion time, but a time when we gather to get things done and and make our space better. That includes voting on proposals, helping out at the lab, helping with community projects, and planning projects.\n\n= Before the meeting: =\n*Proposals for voting are posted on the email list board immediately following HYH for the next HYH period\n*An [https://groups.google.com/forum/?fromgroups=#!searchin/heatsynclabs/proposal$20brooks/heatsynclabs/Is9dKu2nL10/bpruN_vqsWUJ example of a card access proposal] may be found in the archives, but in general should stress how the person fits in the community, what projects they work on, what service they've done, and how they hold our values.\n*Proposals locked one week before HYH\n*Proposals should be small in scope, operational, and actionable. (i.e. \"I've made and tested this xxx system\", and I'd make it official, not \"I propose we need an xxx system\")\n*Members have the ability to dismiss a proposal because they feel it's too broad or should be handled by the board\n*Proposals should be discussed in depth on the forums prior to HYH. Please try to say something of more substance than \"+1\" or \"I agree.\"\n\n= At the meeting: =\n*Any member can begin the meeting promptly at 7, with or without a quorum of 8 members.\n*The first part is the vote; voting happens quickly, generally without discussion. \n** Member moderating the meeting picks a note taker before the meeting who pulls up the latest meeting's [[:Category:HYH]] page and displays it on the projector.\n**If there's no quorum, the vote may be skipped or delayed until later in the meeting. \n**A majority vote wins (abstains are not counted toward a vote, so if two vote yea, one votes nay and five abstain, the vote passes.)\n* Voting results will be sent to the mailing list Friday morning.\n*The second part is getting stuff done: \n**Clean/fix/replace/action everything.\n**New members can get their boxes, and do a [[Walk_Through_Orientation | self guided orientation]] if no volunteers give an orientation.\n**Review the collect your stuff shelf (aka lost and found), and the free stuff shelf. Removing old items from the lab into trash or elsewhere.\n**Check stations and broken tools bin for broken equipment. \n**Check if stock of cups/toilet paper/cleaning products is sufficient, and notify operations if not.\n**Review upstairs storage\n**Process donations\n***Organize, repair, or mark for tear-apart/recycle/throw away.\n\n= Principles of conduct =\n\n# Discussion\n#*Within discussion, we make proposals. A proposal, is just something to consider, like a hypothesis. Proposals should be concise and clear before they are stated. We justify and criticize proposals with arguments. Arguments, like proposals, are just things to consider. We say them, and then we let them stand on their own. There is an extremely finite amount of content that needs to be stated for any given topic, so we should be extremely conservative about the number of statements we make.\n#*It is typical of statements that don't need to be stated, that they need to be re-enforced by more statements.\n# Democracy\n#* The role of voting, is only so that each member can signal their sentiment on mature proposals. It is NOT a means of getting what we want, nor can it be considered ‘doing’ anything at all. A ‘yes vote’ should be considered the equivalent of saying “after all discussion, and contemplation, I feel that this proposal is good.”\n#* We all have our own interests and sentiments. The purpose of democracy is so that the community too can have its own interests and sentiments, independently of its members. The community’s interests cannot simply be the sum of the interests of the community members, because many of our interests conflict, and a community cannot be coherent or clearly directed with a contradiction.\n# Do-ocracy\n#* After a proposal has been voted on, and has been passed, it is up to individuals (not the community) to abide by it. A good proposal, is one that has the fewest and least-demanding physical requirements. For example, a proposal that requires the existence of a physical object is worse than one that doesn't. A proposal that dictates that someone now has a duty is worse than one that doesn't. Remember that the content of a proposal does not need to correspond to reality. Therefore it is possible for a proposal to clash with reality, and when it does so, it becomes nonsense. Don't make proposals that are nonsense.\n\n[[Category:HYH]]",
    "bytes": 4750
  },
  "revision_count": 21,
  "first_revision_timestamp": "2011-11-06T07:19:48Z",
  "is_redirect": false
}