{
  "title": "Hewlett Packard CP5525DN(BobRoss)",
  "ns": 0,
  "id": 1208,
  "slug": "Hewlett_Packard_CP5525DN(BobRoss)",
  "latest_revision": {
    "id": 4626,
    "timestamp": "2020-06-20T23:38:11Z",
    "contributor": {
      "username": "Cprossu",
      "ip": null,
      "id": 698
    },
    "comment": "Created page with \"BobRoss is a cobbled together Hewlett Packard Color LaserJet Enterprise CP5525DN color laser printer.  == Reasons for existing == *Cobbled together from two non-functional pri...\"",
    "text": "BobRoss is a cobbled together Hewlett Packard Color LaserJet Enterprise CP5525DN color laser printer.\n\n== Reasons for existing ==\n*Cobbled together from two non-functional printers on a tearapart night\n*To provide the lab with a robust (and cheap initially) printing solution.\n*First operational 05/19/2017\n\n== How can I use it? ==\nThis printer is connected via Ethernet to the HeatSync Labs network and should be accessible using any computer if the drivers are installed. The IP address is set to 172.22.110.245 port 9100\n\n== Drivers ==\nDrivers can be found on HP's website if the link below does not work, however Windows should be able to detect the printer and download the correct drivers. Not saying it will, just saying it should be able to!\n\nhttps://support.hp.com/us-en/product/HP-Color-LaserJet-Enterprise-CP5525-Printer-series/4073016/model/4073021\n\nIf you are using Linux, the drivers you will want to specify are for use with the HP Color LaserJet Enterprise CP5520.\n\n== Documentation ==\nThe google groups post concerning the printer is here:\n\nhttps://groups.google.com/d/msg/heatsynclabs/NGmqq6VI3Ho/9XTAmaLqBAAJ\n\nIt was using a really messed up hack of an externally powered laptop hard drive, but has since been converted to running on a similar Solid State drive to which it was shipped with, and no external power supply needed. This service was done on 01/24/2019\n\nThe printer has firmware stored on the solid state drive (or hard drive if installed), and should it ever be corupted, the following will have to take place to get it back online again:\n\n1. a copy of the firmware\n\nhttps://drive.google.com/file/d/0B3SEuN8YFVgwQ2h2Tk9DUnRRZzg/view?usp=sharing\n\n2. a 2.5\" sata hard drive, or the SSD that goes into this thing\n\n3. a usb thumb drive\n\n4. The printer's service code/pin which is set to 11552010 (Also useful for supply resets for the transfer belt and the fusor should the printer complain and not want to print some day)\n\nYou will need the usb thumb drive formatted fat32, and you can put that firmware file on the root of the thumbdrive. You can then use the usb ports on the formatter (there are 2 usb's actually on the formatter card itself (meaning inside the machine)\nSo obviously, power down the machine, unplug it, remove the formatter card entirely, stick the usb thumbdrive into one of the ports on the formatter card, put it all back together, plug it in, power it back up\n\nThen you can choose Download->USB thumb drive->the firmware image, and it will load the firmware off of that thumbdrive onto the hard disk! DO NOT CHOOSE THE USB OPTION! it will not work!\n\nAlso a reference with the original post was added previously to this Wiki as:\n\nhttps://wiki.heatsynclabs.org/wiki/Color_Printer\n\n\nManual (Until they move it or delete it)\n\nhttp://h10032.www1.hp.com/ctg/Manual/c02239653\n\n\n== Supplies, care, feeding, etc ==\nToners from both printers used for the cobbling together were recovered, and it is still I think on the first set of toners for the most part. We've been printing on it for years so far on the same cartridges and transfer belt. There is a box labeled \"Color LaserJet Parts\" which I believe is upstairs which has handy things like a spare transfer belt, a spare fusor, spare toner cartridges, and even a spare formatter board in case ours should fail.\n\nPart numbers for the toners are as follows:\n\nHP Color LaserJet Black Print Cartridge (~13,500 pages yield) CE270A\n\nHP Color LaserJet Cyan Print Cartridge (~15,000 pages yield) CE271A\n\nHP Color LaserJet Yellow Print Cartridge (~15,000 pages yield) CE272A\n\nHP Color LaserJet Magenta Print Cartridge (~15,000 pages yield) CE273A\n\n\nThere is a waste toner container(called a TCU) on the back of the unit behind a flap, if it gets full it will throw an error on the printer, and my experience has been even if you try to empty it, it will continue to error, so just get another one if that happens. Part # is \n\nCE980A\n\nAnd the most expensive thing we don't have a replacement handy for is the transfer belt.\n\nHP LaserJet CE516A Transfer Kit(CE516A)\n\nThe printer will work on anything up to Tabloid (11\" x 17\") sized paper. It is fitted with a duplexor and supports two sided printing.",
    "bytes": 4189
  },
  "revision_count": 1,
  "first_revision_timestamp": "2020-06-20T23:38:11Z",
  "is_redirect": false
}