{
  "title": "Hosting Signup Solution",
  "ns": 0,
  "id": 1423,
  "slug": "Hosting_Signup_Solution",
  "latest_revision": {
    "id": 5723,
    "timestamp": "2023-11-11T15:54:57Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "initial project overview",
    "text": "==Project Overview==\nThe goal is to have an easy way to see what days need a host / co-host so people can easily sign up to help cover open hours. Thus making it easier to ask people to help out and relieve some of the stress on those hosting so much.\n\nThe current hosting signup and tracking solution is the [https://docs.google.com/spreadsheets/d/1bLZDXjietZ5bwugvkfY1EBzEb9s1_a7ibxHBx9kQB6E/edit hosting spreadsheet].\n\n==History==\nIn 2014 Ryan McDermott had set up http://www.volunteerspot.com/. It didn't seem to last long.\n\nIn 2022 or so David Flores was making a list of dates and names of hosts with any missing spots. Posting that list in the Hosting Slack Channel. At first I was merely trying to make that process easier. \n\nThen I realized nobody would need to manually post it if we switched back to something like Volunteerspot or other online signup solution.\n\nI tried a similar thing with Sign Up Genius in 2022. The additional steps of signing in and the challenge of adding spots to fill created too much work with no easy way to add recurring events.\n\n==Current Solution==\nAfter reviewing different options and even trying to create a custom solution using Airtable it looks like the best solution is a spreadsheet that anyone can edit. There are other online spreadsheets, but google was able to display the dates with day of the week (more readable). As well as filter to show just the current and future dates. Not easily enough, but still pretty easily. \n\nThere was some confusion as I repeatedly tried to use \"filter views\", but those are temporary. Setting an actual filter for days after yesterday seems best. Sadly the filter isn't updating when you load the page it still thinks \"today\" is the day you applied the filter. I occasionally have to click that filter so it's not looking too far back. I just today set it to highlight the current day. Hopefully that works and doesn't think today is when I set that.\n\nThe one thing not available with the spreadsheet solution is getting reminders when you are scheduled to host.\n\n\n[[Category:Project]]",
    "bytes": 2072
  },
  "revision_count": 1,
  "first_revision_timestamp": "2023-11-11T15:54:57Z",
  "is_redirect": false
}