{
  "title": "Hosting",
  "ns": 0,
  "id": 1380,
  "slug": "Hosting",
  "latest_revision": {
    "id": 5471,
    "timestamp": "2023-02-14T16:21:29Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "Initial page",
    "text": "=Hosting Overview=\n\nThese are just some ideas about hosting and co-hosting. This is the [https://docs.google.com/spreadsheets/d/1bLZDXjietZ5bwugvkfY1EBzEb9s1_a7ibxHBx9kQB6E/edit hosting and co-hosting sign up sheet]. You do need to have 24 hour access / key card access to be able to host, but co-hosting can be anyone that volunteers trust.\n\nWe need volunteers to host the open hours and be able to guide people to tools and be of some help if there are questions. Nobody needs to know everything and it's OK if you can't help with some tools. New people should be encouraged to read the wiki page for a station they are interested in and reach out via Slack if there are tools they need to get an overview or training on how to use.\n\n== Opening Up ==\nOpen early or on time.\n\nUnlock the doors to make sure the website says we are open.\n\nCheck on the space heater if needed\n\nIf there is mail it can be put in the safe.\n\nSet out the A-Frame sign\n\nTurn on enough lights that people don't think we are closed.\n\n== During ==\n\nBe near enough to the front doors that you will notice if new people come into the lab.\n\nAs people come in welcome them and if you don't know them ask if they have been here before.\n\nGive tours as needed to familiarize people to the space and share what we are about.\n\nFamiliarize yourself with where things are and help people when they have questions about where things are.\n\nWhen in doubt ask if people have filled out the waiver or been certified specific tools.\n\nIf people aren't wearing safety equipment when necessary remind them.\n\nKeep floors clear of trip hazards especially when using any extension cords.\n\nHelp people with questions if you can and direct them to the discussion group or Slack if you don't have answers.\n\nTake pictures of people's projects and send them with brief details about them to photos at heatsynclabs.org. \n\nEncourage people to clean up as things go including clearing tables of food or drink, and taking out the trash if 3/4 full.\n\nPut stuff away (retrace your steps)\n\nGuide people as needed to basic things in the lab, [https://forms.gle/zss1bJSN7ocKQudz6 liability waiver], safety glasses, ear protection, WiFi Password (above front door), restrooms, First Aid (next to bathroom).\n\nRemind people as it gets closer to closing that people need to clean up.\n\n== Closing Up ==\n\nCheck space heater\n\nBring in the A-Frame sign\n\nLook for any equipment that was left on especially hot things like glue guns, heat gun, soldering irons\n\nCheck the 3d printers for failing prints\n\nDoors should automatically lock at 10pm but make sure or turn them off manually\n\nCheck the doors do in fact lock (front, back, and where welding stuff is)\n\nTurn out lights \n\nCheck the facilities lockers are locked\n\n=Co-Hosting=\n\nIf you are interested in volunteering co-hosting is a great way to help. Anyone, even non-members, can co-host and this can free up our seasoned volunteers to  focus on other tasks needed for the space or the community.\n\nThere are a lot of things listed for hosts to do that you can do, or help with. Familiarize yourself with the above list. Also it helps to review the calendar and just where tools are in the space by looking around.\n\nWhen someone comes in you can usually tell if they look confused or are looking around taking in a new environment. Just ask if they have been here before and introduce yourself.\n\nA host isn't necessarily going to trust someone they don't know to watch the front doors. As different volunteers get to know you they will be more able to get tasks done around the lab without \"loitering\" in by the doors. They'll become more comfortable that you will direct anything you're unfamiliar with to them.",
    "bytes": 3692
  },
  "revision_count": 1,
  "first_revision_timestamp": "2023-02-14T16:21:29Z",
  "is_redirect": false
}