{
  "title": "How to Run HeatSync Labs",
  "ns": 0,
  "id": 317,
  "slug": "How_to_Run_HeatSync_Labs",
  "latest_revision": {
    "id": 6803,
    "timestamp": "2026-01-13T15:46:29Z",
    "contributor": {
      "username": "Jaymcgavren",
      "ip": null,
      "id": 731
    },
    "comment": "/* Operations */",
    "text": "The role of the Board of HeatSync Labs has three parts:\n* To Guide the Community in the fulfillment of our mission and goals.\n* To Represent the Will of the Community where an official representation is necessary to interface with other organizations and to fulfill the Law of the land.\n* To Empower the Individuals that make up the Community of HeatSync Labs to take Action towards the ends of fulfilling our goals and mission.\n\n* Current [[Board Members]]\n* Elections: October, with November transition.\n\n== Everyone ==\n\n* Try to be physically at the lab as often as possible\n* Specifically be at the lab for [[Hack Your Hackerspace]] night\n* Convert strangers into members\n* Serve on committees\n* Fund raise\n* Promote HeatSync\n* Ensure that the charitable purpose of our 501(c)3 is upheld. (See our [[501(c)3 Filings]])\n\n== Champion ==\n\n* Physical face of HeatSync, primary contact point\n* Checks/Balances (treasurer, etc)\n* Vision, on track and clearly conveyed, the \"why\"\n* Find holes in responsibility and plug them personally if need be\n* Lead or make sure initiatives important to HSL are lead, for instance (and entirely for example):\n*build out of individual stations (3d printing, microcontrollers)\n* Communication (to/from board, to new people \"no wallflowers!\", connect people, to partners, getting and keeping contacts)\n*Be:\n** Present for most events\n** [[Hosting |Host]]/life of the party\n** a Leader\n** able to understand/track all aspects of HeatSync\n** in charge of Accountability, Follow-up\n** Empowering/motivating\n** Delegating\n** Mediating\n** Deciding\n\n== Treasurer ==\n\n* Manage bank accounts (with accountant's help)\n* Collect dues and monetary donations\n* Timely updates to the board\n* Taxes, IRS communication\n* Collecting receipts for sales\n* Delivering receipts to donors, with tax exempt notification (as easy as possible)\n* Improving sales process to make it easy for customers (with IT/Marketing help)\n* Set up accounts with vendors\n* Purchasing (processing orders)\n* Capital value (asset tracking with resource manager's help) \n* Budgets\n* Expenses (monthly/yearly)\n* Building and debt management\n* Accounts payable\n* 501c3 status (account switchovers)\n* Record when a donation worth more than $500 is sold or disposed of, we [http://www.irs.gov/Charities-&-Non-Profits/Charitable-Organizations/Charitable-Organizations-Substantiating-Noncash-Contributions must document that sale for the IRS.]\n\n=== Notes Captured From Eric Wood 2022-08-23 ===\n\n* HSL has an accounting firm, which charges about $300 per month.\n* Most bills are auto-paid, but there are some manual outliers that need to be handled.\n* Payments to instructors:\n** Money transfer from PayPal to Instructor done by Treasurer.\n** Recorded in QuickBooks by Treasurer.\n** Customer payments are collected in PayPal by Website.\n** Instructor provides info to Treasurer about financial breakdown.\n** Treasurer *does not* do 1099 - Accountant does that.\n*** Treasurer does categorize instructor payments in docs provided to accountant.\n* Reimbursements are paid by Treasurer.\n** Receipts are stored primarily as images in DropBox.\n** Some noteworthy receipts are also kept as paper.\n* Books are done in QuickBooks.\n* Member Database integration would be nice. (has been on the wish list for a long time)\n* Keep about $nn in checking account. (number known but not disclosed here, ask Eric)\n** When checking goes below $nn, transfer money from savings.\n** Consider pinging Jim Tolar from Bike Saviours regarding using a CD ladder for improved interest.\n* Currently we do not have a purchaser of paper towels and toilet paper, which should be expenses sent to Treasurer.\n* Rent is our highest expense at about $1/foot/month.\n* Electricity is our #2 expense.\n* Sprinklers are the big thing we don't want to do that makes us consider leaving our otherwise pleasant location. Estimate was $50k, but that included $25k to extend the City of Mesa water main, which may have been partially extended already. $50k is probably more like an upper bound right now.\n\n== Secretary ==\n*send thank yous, etc\n**post presentations on wiki and maybe a private list of emails so we can reschedule speakers http://wiki.heatsynclabs.org/w/index.php?title=Presentations\n*post agenda to lab and discussion board 1 week prior to board meeting\n*take minutes during board\n*post draft minutes directly after board meeting finishes to discussion board\n*take minutes staff meetings--email minutes to attendees immediately after staff meetings\n* Reminders (reporting, taxes, due dates)\n* Operations/Events accountability\n*Organize organization documents and maintain document compliance for 501c3 status\n\n== Operations ==\n\nThe Operations manager should be good at inspiring volunteers, delegating, following up, and taking tasks on themselves as necessary. In order to be effective and to keep HeatSync a community-oriented endeavor, they should not attempt to do everything themselves or dictate policy. Rather, they should help community members reach a productive consensus and achieve common goals together, only rarely stepping in to make decisions when the community is deeply divided.\n\nThe operations manager delegates and coordinates ongoing tasks including:\n\n* Membership (welcoming, tracking, training, card access, suspension/revocation)\n* Propose adjustments to the space or behavior to help newcomers feel welcomed and transition to a user of the space/tools, possibly a member, or possibly a volunteer.\n* Update and refine the Walk Through Orientation on a regular basis\n* Community Governance (community voting, mailing list moderation, mediation)\n* IT:\n** Website\n** Wiki\n** Internet\n** Door Access\n** WiFi\n* Marketing \n** Websites\n** Social media\n** print\n** signage\n** t-shirts\n* Facility Maintenance\n* Safety\n* At least yearly, audit the MSDS binder and update it to reflect chemicals and materials in the lab\n* Facilitate communication between the community, volunteers, operations team, and board as necessary",
    "bytes": 5988
  },
  "revision_count": 42,
  "first_revision_timestamp": "2011-01-28T02:28:59Z",
  "is_redirect": false
}