{
  "title": "HYH Meeting 2012-11-08",
  "ns": 0,
  "id": 1043,
  "slug": "HYH_Meeting_2012-11-08",
  "latest_revision": {
    "id": 3874,
    "timestamp": "2012-11-09T02:55:59Z",
    "contributor": {
      "username": "Rrix",
      "ip": null,
      "id": 43
    },
    "comment": "Undo formatting changes",
    "text": "This page was automatically copied from [[HYH Meeting Template]] by [[User:Phong]]. If you would like to change the structure of how future meetings perform, please make any modifications to [[HYH Meeting Template]]. If you would like to propose something at the next meeting, bring it up on the mailing list with \"PROPOSAL:\" in the subject line and Phong will add it to the next meeting's agenda.\n\n= Agenda =\n\n== Financial Report ==\n* Funds in bank:  (Can be seen at [[Financial Report]].)\n** checking: \n* '''Note Taker:''' Nate P\n* '''Moderator:''' Chad S\n* '''Number of Members Present:''' 11\n\n== Announcements ==\n\n== Discussion ==\n* Fastener bench area needs to be cleaned.\n* Wood shop is messy.\n* Austin: reduce parking ticket length from 14 days to 7.\n** Will: 14 was in template; easy to change.\n* Tim: 3d printer museum area should be useful or showable.\n* Jeremy: need help reducing/removing tear-apart pile upstairs. Tear-apart night 11/30?\n\n== Proposals ==\n\n=== Badge access for Alisa Ex ===\n\n* Proposal by '''Gadget'''\n* Proposed on '''Mon, 22 Oct 2012 18:04:48 -0700'''\n\n<pre>\nAlisa is an awesome person. She is a great help around the space, helping with\ntours and having her knowledge with costume design is a great bonus!  She\nbrought in the piano upstairs and her current emulator t-shirt is her current\nwork in progress. Her Van Gogh box turned out to be amazing. She is currently\nworking in code academy learning java script. And she is working on building a\nlight-able companion cube\n\nhttp://www.flickr.com/photos/hslphotosync/8111297967/in/photostream - cube\nhttp://www.flickr.com/photos/hslphotosync/8092937473/in/photostream - Van Gogh\nhttp://www.flickr.com/photos/hslphotosync/8092943312/in/photostream - Van Gogh\n\nShe has been coming into the space for about the last 3 months.\n\nDue to her crazy work schedule, I think both the space and Alisa would benefit\nfrom having badge access.\n\n-- \n</pre>\n\n==== Discussion ====\n* \"I'd be here more if I didn't have to rely on someone else to be here.\" (paraphrased)\n* Interested in cosplay, learning to solder. Want to make circuit board jewelry.\n* Breadth of skill, desire to learn.\n* Helps keep lab clean.\n\n* '''RESULT: 10 for, 0 against - PASS'''\n\n\n=== HYH Put food in vending machine ===\n\n* Proposal by '''Mike Wolfson'''\n* Proposed on '''Fri, 19 Oct 2012 13:40:16 -0700 (PDT)'''\n\n<pre>\nSo I think we have the all clear from Jacob to use the vending machine in the\nfront of the lab for real food. There are is a caveat: - The machine is on\nCraiglist, so if it sells, our food would be homeless. I think the bill\nchanger is actually all that is for sale, so the food might not be homeless,\nbut not sell-able. The whole machine might go. (I think it has been for sale\nfor a while, and not exactly selling like hotcakes)\n\nMy thoughts:\n- we sell general snacks, both healthy and not (based on ideas from another\n  thread).\n- this is a fundraising mechanism - the items have a high markup - profits go\n  to the lab and the operation of the machine \n\nI am willing to do the work to stock and keep track of the machine (hopefully\nChad and Marita could help me with any accounting, but I will do that too if\nnecessary)\n\n---------------------------\nThe formal proposal:\n\nI propose that we allocate $150 to a budget to seed the vending machine.  This\nwould be around $50 in change for the machine, and $150 for food.\n\nThe intention with this endeavor is that it would be self-sufficient. This\nwould be a one time allocation. The funding for re-stocking would come from\nfunds in the machine.\n--------------------------\n\nSo what do you think?....\n\n-- \n</pre>\n\n==== Discussion ====\n* How often is Mike here?\n* Is honor system not working?\n* Machine is more organized and maintained, not in wood/metal shop.\n* It's taking up space up front.\n* Jacob would rather it be full of bizarre/interesting things, not snacks. Has not fulfilled his goal.\n** Starts tours with consumption.\n\n\n* '''RESULT: 6 for, 3 against - PASS'''\n\n[[Category:HYH]] [[Category:Meetings]]",
    "bytes": 4014
  },
  "revision_count": 4,
  "first_revision_timestamp": "2012-11-03T11:33:04Z",
  "is_redirect": false
}