{
  "title": "HYH Meeting 2012-12-27",
  "ns": 0,
  "id": 1069,
  "slug": "HYH_Meeting_2012-12-27",
  "latest_revision": {
    "id": 3973,
    "timestamp": "2012-12-28T02:33:04Z",
    "contributor": {
      "username": "Rrix",
      "ip": null,
      "id": 43
    },
    "comment": "Remove endspace",
    "text": "This page was automatically copied from [[HYH Meeting Template]] by [[User:Phong]]. If you would like to change the structure of how future meetings perform, please make any modifications to [[HYH Meeting Template]]. If you would like to propose something at the next meeting, bring it up on the mailing list with \"PROPOSAL:\" in the subject line and Phong will add it to the next meeting's agenda.\n\n= Agenda =\n\n* '''Note Taker:''' [[User:rrix]]\n* '''Moderator:''' Austin Kipp\n* '''Number of Members Present:''' 12\n\n== Announcements ==\n\n* Any cool new projects? Something you want everyone to know?\n* Any happenings that people should be aware of?\n\n== Financial Report ==\n* Funds in bank: ##FIXME## (Can be seen at [[Financial Report]].)\n\n== Proposals ==\n\n=== Replace RAS with BOSCH Table Saw ===\n\n* Proposed by Ben Humphreys\n* Proposed on 10/12/22 18:32\n\n<pre>\nI propose that HeatSync Labs remove the Radial Arm Saw and purchase a BOSCH \n4100-09<http://www.boschtools.com/Products/Tools/Pages/BoschProductDetail.aspx?pid=4100-09>  \nTable saw to replace it. The BOSCH 4100-09 is $550 at Lowes.<http://www.lowes.com/pd_36_0__?productId=1208633>\n<https://lh5.googleusercontent.com/-_QtKBJmJOOM/UMaA2z_TRLI/AAAAAAAACO4/zQ-gRx0kcQw/s1600/IMG_20121207_165822.jpg>\n*\nThe Big Picture *\n*What equipment is it you want to see added to the lab? \n*A table saw!\n\n* What capabilities does this equipment give us?\n*Table saws are the single most versatile woodworking tools there are. This \nwould allow us to make very precise cuts at a variety of angles. It would \nallow us to rip very large pieces of wood. It can even be used to square \noff edges in place of a jointer. The cuts are also easily repeatable on \nmultiple planks of wood. Adding this to our band saw, jig saw, router, and \nother handheld tools opens up a very broad range of woodworking \npossibilities.\n\n* How does this equipment further the goals of HeatSync lab? \n*Wood is a very versatile medium, and quite cheap too. Woodworking has been \nthe most common way of making things since the dawn of time. The ability to \ncraft wooden objects large and small complements our other capabilities, \nand would allow people more ways to create and build things.\n\n* *\n\n<https://lh4.googleusercontent.com/-hZfsVLglVGk/UMZ-XV9E52I/AAAAAAAACOY/a7K2DbsCYfM/s1600/IMG_20121210_164003.jpg>\n<https://lh5.googleusercontent.com/-iIF6vvrfzY0/UMZ9bJCq2YI/AAAAAAAACNo/Mp0tBlHN_fY/s1600/IMG_20121210_165119.jpg><https://lh6.googleusercontent.com/-jTdkhBam2xw/UMZ9ikiF-JI/AAAAAAAACNw/O3FVsuyhFQw/s1600/IMG_20121210_165104.jpg>\n* Available Lab Resources *\n* What safety risks does the machine pose? \n*This machine will maim and dismember any human parts that get in the way \nof the blade. The 4 horsepower motor will shred flesh easier than the wood \nit is designed to cut. To reduce the odds of this, the machine has a \nclearly marked red zone around the blade, and comes with a detachable blade \nguard. It also includes a push-stick, to allow you to move the wood \nforwards while keeping your hands at a safe distance. The blade height is \nadjustable, to be sure it is no higher than necessary. When not in use, it \ncan be retracted into the table entirely.\n\n* What space is there within the lab available to store and operate it? \n*The saw will take the position the RAS currently occupies. The RAS \nmeasures 33\"x39\", or 8.9 sq. ft. This saw measures 46\"x28\" when fully \nsetup, also 8.9 sq ft. The table saw is 11\" shallower, and 13\" wider than \nthe RAS. The cart the saw is on allows the saw to be stored more compactly, \nby folding up. When folded up, the saw occupies 28\"x29\", or 5.6 sq ft. \nRemoving the RAS will free up enough space to store the table saw. And \nbecause it is on a portable cart, it can be moved outside if more workspace \nis necessary.\n* \nWhat sort of power is available to run the machine? \n*The same 20 amp circuit that the rest of the shop runs on. The motor has a \npeak current draw of 15 amps, so while the machine is operating, it is best \nnot to be using other power tools on the same circuit, for risk of \noverloading it. This same risk is true of the majority of the larger power \ntools we have.\n\n* What space is available to store additional accessories and materials? \n*The machine itself has space and compartments to store a couple extra \nblades and its own accessories. The space that is currently occupied by \nwood can accommodate more of it. \n* Machine Specifics *\n* What machine (make, model, etc) do you propose we get? \n*The BOSCH 4100-09\n\n* What other alternative models are available? \n*This table saw is the nicest portable table saw available. The only \nupgrade would be to a large stationary table saw. Dewalt, Porter Cable, and \nSkil all offer table saws that are less expensive. \n\n* What makes the chosen machine the best option for the lab? \n*The table saw is the most used and most versatile wood working tool. It is \nworth investing enough to be sure you have a good quality one because it is \nbound to get used a lot. This table saw, of all the portable saws I have \ncompared in person, feels the most durable and solid. The Porter Cable that \nwas suggested by the self-declared \"wood shop champions\" has the additional \nfeature of an outboard feed support. But the rail is much less sturdy, and \nthe measurement indicator is not magnified and is less precise. A nicer \nmodel by Dewalt that retails for $450 lacks a very good measurement system \nas well. \n\n* What specific safety risks apply to that specific machine? \n*None that do not also apply to most table saws in general.\n\n* How much space does the machine occupy? \n*Fully upright with table extended, it occupies $46\"x28\". This is 11\" \nshallower than the RAS it will replace, and 13\" wider than the RAS.\n\n* How much space must there be around the machine to operate it safely? \n*Enough space must be around the machine to load the wood and push it \nthrough. It varies depending on what is being cut. Plywood sheets will need \nmuch more space to be cut than lengths of 2x4. \n\n* Can the lab provide the necessary power to run that machine? \n*Provided few to no other power tools operate on the same circuit, yes.\n\n* What accessories, additional equipment, and consumable materials will be \nnecessary to use the machine effectively and efficiently? \n*Extra saw-blades should be kept on hand for replacement when they get \ndull. And different saw-blades can be used for different things. Blades \nwith fewer teeth cut faster and more aggressively, but leave a rough \nfinish. Blades with a lot of teeth cut slowly but leave a much nicer \nfinish. Finer toothed blades can be used to cut plastic and acrylic as well.\n*\nWhat sort of training might members need to use the machine correctly? \n*A quick run-down and demonstration of the different features unique to \nthis saw, such as the folding stand and blade guard, should be demonstrated \nto anyone before they use it. This would not have to be part of a formal \nclass necessarily. \n\n* What safety rules may be necessary in using the machine? \n*Keep all fingers and flesh outside of the red zone. Use the blade guard as \nmuch as possible. Retract the blade when you are not using it. Make use of \nthe push stick where necessary.\n\n* Who would provide any necessary training on the machine? *\nMost of the people in the lab should familiarize themselves with it enough \nto be able to help someone else with it. It would also be good to include \nin any general shop safety classes.\n\n*Affordability\n* *Can We Afford It? \n*Yes. Marita generously donated $500 of her own money, and is in the \nprocess of getting an additional $1000 from her workplace, all for \nwoodworking tools. Brian and Paul have each pledged to donate $200 towards \nwoodworking equipment. \n\n* How much does the machine cost? \n*Lowes sells this for $550.\n\n* How much do additional accessories, tools, and raw materials cost? \n*The saw-blades range from $12 to as much as $60. All the ones necessary \nfor our purposes can be had for less than $20 each. 4'x8' plywood sheets \nstart at $15. 2\"x4\"x8' planks are $2.53 each. We have a small assortment of \nscrap and lumber already. Additional boards are inexpensive. \n\n* What is the total cost of the machine with all necessary accessories, \ntools, and raw materials for members to begin using the machine? \n*$550 includes the machine and one blade, enough to begin use immediately. \nWe already have a small stockpile of lumber and scraps of wood. It is worth \nconsidering purchasing additional blades and wood in the near future with \nthe woodworking funds.\n\n* What funds are currently available for use towards purchasing this \nmachine? \n*Marita has deposited $500 already for woodworking tools. An additional \n$1200 has been pledged between Brian, Paul, and Marita.\n\n* Are there other large purchases on the horizon that may require some of \nthe available funds? \n*Many other woodworking tools are under intense debate. But I feel that a \ntable saw is the best place to start, and the most important single tool to \nacquire. \n*\nWhere might this machine purchase fit into the long-term financial goals of \nHeatSync Labs?\n*In the near future, we have the possibility of moving to a new location, \nand/or extensive electrical renovations. These would be extremely \nexpensive, and it is best to save up for those. This tool will be paid for \nwith funds donated specifically for this purpose, leaving the general funds \navailable for those future purchases.\n\n**********\nSawdust\nAnother thing worth noting is the question of the amount of sawdust this \nwill create. The sawdust outlet points horizontally out from behind the \nmachine. This is a fantastic way to send sawdust everywhere. I suggest \nmaking a right-angle pipe from PVC to redirect the dust onto the floor. \nClearing up the floor with a shop vacuum or broom is much easier than \ngetting the dust out of all the nooks and crannies it has flown into. It \nappears to be about the right size to possibly connect the shop vacuum \ndirectly to that port. An adapter could possibly be fashioned, allowing the \nshop vacuum to act as a dust collection system.\n\n**********\n\nMost Lowes locations seem to stock this table saw, as well as Home Depot. I \nsuggest going in person to view one, and compare for yourself against the \nother available options. \n</pre>\n\n==== Discussion ====\nMuch group cornhole regarding the state of various things online, Brian\nanswered blhack's questions about the machines, basically everything is\nstoraable in a small space and it shouldn't be an issue\n\n* '''RESULT: 5 for, 3 against. PASS'''\n\n== Purchase Miter Saw and stand/Table Saw/Dust Collector ==\n\n* Proposed by: Brian Aday\n* Proposed on: 20/12/12 23:33\n\n<pre>\nA significant number of people have expressed interest in adding a \nwoodworking capability to Heatsync labs. The tools detailed below form the \nfoundation of that capability.\n\n*I propose we purchase: *\n\n*Table Saw $299 + tax - No Shipping:*\nhttp://www.lowes.com/pd_89913-46069-PCB220TS_0__?productId=3163783&Ntt=mobile+table+saw&pl=1&currentURL=%3FNtt%3Dmobile%2Btable%2Bsaw&facetInfo= \n\n*Dust Collection $199 + tax - No Shipping: *\nhttp://www.harborfreight.com/2-hp-industrial-5-micron-dust-collector-97869.html \n\n\n*Miter Saw $499 + tax - No Shipping:*\nhttp://www.homedepot.com/h_d1/N-5yc1v/R-202220984/h_d2/ProductDisplay?catalogId=10053&langId=-1&keyword=sliding+compound+miter&storeId=10051#.UKwNbKqa98E\n\n*Portable Miter Saw Stand $199 + tax - No Shipping:* \nhttp://www.homedepot.com/h_d1/N-5yc1v/R-202935041/h_d2/ProductDisplay?catalogId=10053&langId=-1&keyword=rolling+miter+saw+stand&storeId=10051#.UNPfT29QV8E\n**\n**\n\nI have had a few requests to set up an in-person meeting to answer \nquestions on this purchase. The meeting will be held Wednesday 26 December \nfrom 5-7 pm at Heatsync.  This gives us time to work out any details and \ncreate amendments before the 7 PM deadline. Amendments contingent on the \npassage of Jacobs amendment reform. \n\nThank you to everyone who has expressed their support and worked on this \ninitiative! Your enthusiasm has been invaluable. I am looking forward to \nseeing all the amazing projects these wood shop tools will help you create. \n</pre>\n\n=== Discussion === \nThe table saw purchased above will supersed the table saw in this proposal.\n\n* '''RESULT: 5 for, 4 against. PASS'''\n\n\n== Discussion Items ==\n\nIf an item of discussion drags on too long, further discussion may be postponed until after the meeting ends.\n\nDuring discussion, it is not necessary to write down exactly what each person says. Record the topics of discussion, and any items of consensus or controversy here. Detailed descriptions of the conversation should go on the discuss page for this meeting.\n\n[[Category:HYH]] [[Category:Meetings]]",
    "bytes": 12743
  },
  "revision_count": 6,
  "first_revision_timestamp": "2012-12-28T01:34:29Z",
  "is_redirect": false
}