{
  "title": "HYH Meeting 2013-04-11",
  "ns": 0,
  "id": 1086,
  "slug": "HYH_Meeting_2013-04-11",
  "latest_revision": {
    "id": 4061,
    "timestamp": "2013-04-12T04:18:55Z",
    "contributor": {
      "username": "Will",
      "ip": null,
      "id": 22
    },
    "comment": "",
    "text": "= Agenda =\n\n* '''Note Taker:''' Will Bradley\n* '''Moderator:''' Alisa Ex\n* '''Number of Members Present:''' 13\n\n== Announcements/Tasks ==\n\n* Alisa will call Kalil and Austin will remove some soda. \n* Austin needs help with the welding booth - new shelves, bench\n* Jacob wants help making raspberry pi stations and improving the microcontroller wall.\n* Nate wants to encourage everyone in the machine shop, wood shop, and drill press to clean up their messes. Alisa proposes making signs.\n* Brian says that dust collection is on hold because waiting on new tools; also waiting for Marita's company's donation to arrive.\n* Jeremy says we need to get rid of chairs. Jacob says max people we seem to be able to have in the space is 30 when using tools, 40-50 when seated.\n* Jeremy says we need to get rid of plotters. One of the plotters is Jacob's and can be thrown away or scrapped. Brian decided to turn one of the plotters into a vinyl cutter.\n* Chad says he'll clean up BeatSync.\n* Alisa needs help on the front windows. Will will take out old computer from front window. Marita will help Alisa paint and create tetris shelves. Austin will help mount the whiteboard.\n* Marita will get more bottled water.\n\n=== Toxic Waste dropoff ===\n* Need help taking toxic waste to Mesa collection event on April 20 before noon. http://www.mesaaz.gov/waste/hhw.aspx\n\n== Financial Report ==\n* Was provided during the board meeting, showing overall growth in our balance sheet over the last year.\n\n== Proposals ==\n\n* Replacing Kalil fridge by Will - withdrawn as it seems we are currently using Kalil's services.\n\n[[Category:HYH]] [[Category:Meetings]]",
    "bytes": 1637
  },
  "revision_count": 3,
  "first_revision_timestamp": "2013-04-12T04:10:43Z",
  "is_redirect": false
}