{
  "title": "Inkscape",
  "ns": 0,
  "id": 1202,
  "slug": "Inkscape",
  "latest_revision": {
    "id": 5820,
    "timestamp": "2024-01-19T02:37:55Z",
    "contributor": {
      "username": "Robert Andrews",
      "ip": null,
      "id": 724
    },
    "comment": "/* corrected page links */",
    "text": "Inkscape is a free, opensource, vector graphics software.  Having been less than version 1 for slightly less time than OpenSSL was, it is has now achieved \"production\" status with version 1.  It can be downloaded for your system from [http://inkscape.org Inkscape.org].\n\n\n== to add ==\nset the document space to the size for the large laser (ctrl-shift-r)\n\n= Uses =\nIt is useful for a lot of different things, but the initial focus of this article is going to be for creating designs to laser cut.\n\n= Getting started =\n\n* Install software.  I'll leave that to you.  I'm running on a Mac, so screenshots will be from there, but you can translate.\n\n= Caveats =\nI'm largely self taught on Inkscape.  So there might be things in this documentation that are a terrible way to do something.  That's the joy of a wiki, update it with a better way if you know of one.  Otherwise, this is what works for me.\n\n== Fix some defaults ==\n\n=== Units of measure ===\nListen, I get it, we live in America.  But \"freedom units\" have little place in precision and even less place in the software designed a decade ago by a Chinese software development company.  So, you'll want to change your defaults to metric, or specifically, mm.\n\n* Change the Document Properties to mm\n[[File:inkscape-document-properties.png|250px]]\n\n* Change the grid units to mm\n[[File:inkscape-grid-units.png|250px]]\n\n= Really getting started =\n\n==Create a new file==\nStandard stuff.  File -> New.  Now, you're going to see this big box on it.  This is just your canvas, it is not something that is part of your drawing.\n\n[[File:inkscape-canvas.png|250px]]\n\n==Basic controls==\nNow, if you're expecting \n\n* Zoom out:  -  (i.e. hyphen, minus)\n* Zoom in: + (i.e. plus sign)\n* Other basic controls:\n\n[[File:inkscape-basic-controls.png|250px]]\n\n==Let's make a key chain tag ==\nOne of the most basic laser items, so good to start.  Our key chain tag is going to have 3 simple elements:\n\n# Be a small rectangle, 3 cm x 10 cm\n# Have a hole for the key ring to go through\n# Have a name on it\n\n=== Draw rectangle ===\nFirst, we're going to draw the outline of the tag.  It's not important to get the size precisely right because we'll change that in the next section.  You can actually size it by doing it initially, but want to show the process for how you can do it for any element.\n\nSelect the rectangle tool.\n\n[[File:select-rectangle-icon.png|250px]]\n\nThen just click and drag to create the rectangle.\n\n[[File:click-and-drag-rectangle.png|250px]]\n\n=== Resize rectangle ===\nThe rectangle isn't the size we wanted, so let's fix that.  First, click or click and drag to select the rectangle.\n\n[[File:select-arrow-then-rectangle.png |250px]]\n\nYou can see where the Height and Width dimensions.\n\n[[File:beginning-rectangle-size.png|250px]]\n\nJust click into those and change them to the desired dimensions.  You'll recall we said 3 cm and 10 cm, which is 30mm and 100mm.\n\n[[File:resize-rectangle-to-30x100.png|250px]]\n\n=== Draw hole ===\nNow we need the key ring hole.  So, we'll just make a circle.  We want it close to the area we want, and we'll center it in the enxt step.\n\n[[File:draw-circle.png |250px]]\n\n=== Align everything horizontal ===\nThere are all sorts of way to try to get this exact, but the best way is to just let the software do it for you.  You'll see there are all sorts of options for alignment and distribution, we're going to have them centered.\n\n[[File:align-circle.png |250px]]\n\nHere is what it looks like afterwards.\n\n[[File:align-circle-result.png |250px]]\n\n=== Add text ===\nSelect the text tool and type in your information.\n\n[[File:add-text.png |250px]]\n\n=== Resize text ===\nEasiest way to resize is to just grab a corner and expand it.  If you want to make sure it expands proportionally (so it doesn't just stretch width or height) it will do that if you just hold the Control key while you do it.\n\n[[File:text-created-and-resized.png |250px]]\n\n=== Align horizontal again ===\nJust do the same thing we did for the circle above.\n\n=== Create layers ===\nLayers are an easy way to separate the actions you might want on your design.  So, in our case we know we want to Cut and Engrave.  This way we can ensure we are organized on the export.\n\n[[File:create-new-engrave-layer.png |250px]]\n\n==== Move things to easy to remember layers ====\nNow, when I took this screenshot I was on my laptop, so I did it through the menus.  You can also do this by selecting the object and using your right mouse button to move it to a layer.\n\n[[File:move-text-to-engrave-layer.png |250px]]\n\n==== How to view layers ====\nMake the layers either visible or not by clicking on the eye with the unnaturally large eyelashes.  Here you can see how these look.\n\n[[File:only-cut-visible.png |250px]]\n\n[[File:only-engrave-visible.png |250px]]\n\n=== Save your file ===\nMake sure to save your file as an Inkscape svg.\n\n[[File:save-your-file-as-svg.png |250px]]\n\n=== Object To Path ===\nNow you want to turn your text in the file from being strokes (i.e. connected lines) to paths (i.e. long lines with different directions).  This is done via the Path -> Object to Path command.\n\n[[File:stroke-to-path.png |250px]]\n\nYou might want to save your file again as a different Inkscape SVG after this step, because now that everything is a path, doing things like editing text becomes annoying.\n\nYou can be done here if you're planning on working on the [[Mini 60W Laser]], but if you want to work on the [[Large 80W Laser]] you'll need to save it as a different format.\n\n==== Do NOT Object to Path Everything ====\nUnless you have a very good reason.  When you do that, you risk turning lines you had, into pairs of strokes.  If you select everything and then do \"Object to Path\" on the whole object, this is what it will look like when you bring it into [[LaserCut]] on the [[Large 80W Laser]].\n\n[[File:lasercut-all-s2p.jpg |250px]]\n\nNow, maybe it's not obvious what is wrong with this, after all, they're all vectors, right?\n\n[[File:lasercut-bad-s2p.jpg |250px]]\n\nNotice how our cut lines, which used to be lines are now two lines.  You then get into the position of attempting to delete one and figuring out which size you needed, etc.  So, try to avoid that.\n\n=== Save your file as DXF 14 too ===\nSimply \"Save As\" and choose DX 14 as your format type.\n\n[[File:save-your-file-as-dxf.png |250px]]\n\nHere are the options to select on the resulting popup.\n\n[[File:dxf-popup.png |250px]]\n\n== Making Your Job Easier ==\nYou can actually make your job in LaserCut easier if you set some things up in Inkscape.  In particular, if you have a palette file configured in InkScape you can assign the colors there, and they will survive the transition to LaserCut.  You might be tempted to try to do it with Layers as well, but that doesn't work.\n\n=== Colors ===\nThere is a good [http://wiki.tinkermill.org/index.php/Preparing_Files_With_Inkscape tutorial on TinkerMill] how how to setup Inkscape with a custom palette.  I won't go into all of the details of that, but TinkerMill does want you to login to download their file.  I didn't want to do that, so I created one by hand and loaded it up per the instructions.  And Inkscape got into a crash loop that required me to burn it to the ground to get it running again.  So, I got a different file and got it to work.  [https://wiki.heatsynclabs.org/wiki/File:lasercut.gpl Here it is].  Follow the directions from TinkerCad.\n\nOn the Inkscape side you can color code your items by using the \"Fill & Stroke\" colors.  In this case I have made \"cut\" red and \"engrave\" black.\n\n[[File:inkscape-colors.png |250px]]\n\nAnd this is the resulting DXF when imported into LaserCut or LighBurn\n\n[[File:lasercut-colors.jpg |250px]]\n\nNote that you'll still need to change the settings (upper right) on speed/power/etc, but now it's already grouped. So, a little work in Inkscape can save you some frustration on the laser side\n\n= Get your file to the laser =\nThe lasers behave differently, so the specifics for processing the files will be on the individual laser pages.  Regardless though, you're going to be \"Sneakernet\"ing your file via a USB drive, so make sure you have one handy.\n\n* [[Mini 60W Laser]]\n* [[Large 80W Laser]]\n\n= External links =\n* [https://www.ponoko.com/blog/how-to-make/inkscape-vector-tutorials/ Ponoko Inkscape Tutorial]\n* [http://wiki.tinkermill.org/index.php/Preparing_Files_With_Inkscape TinkerMill tutorial]\n[[Category:Laser]]",
    "bytes": 8408
  },
  "revision_count": 20,
  "first_revision_timestamp": "2020-06-19T02:06:37Z",
  "is_redirect": false
}