{
  "title": "Joining In",
  "ns": 0,
  "id": 1342,
  "slug": "Joining_In",
  "latest_revision": {
    "id": 5472,
    "timestamp": "2023-02-14T16:37:31Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "/* added co-hosting */",
    "text": "In Summer of 2022, as HSL emerges from our COVID downturn, one of the key issues we are focusing on is making it easier and more fun for our visitors, members, and volunteers to join in. We want to create a place where it's fun to come and work together on building a community space for hackers. These are the ideas we have so far, until we hear better ones.\n\n=Take Classes=\nThis is the easiest way to get started being a part of HeatSync Labs. Our classes have good materials, tools, and instructors, but for many, the best part is learning to make something with other people. Come join in the fun and help make it a friendly community center for other hackers.\n\nYou can find upcoming classes on the [https://www.heatsynclabs.org/ calendar on our web page].\n\n=Volunteer=\nFrom simple tasks like taking out the trash, being a teacher's assistant, teaching your own class, [[Hosting#Co-Hosting | Co-Hosting]] the lab, there is a lot of work that keeps HeatSync Labs running. You'll get to enjoy the company of other hackers and have the ego boost of knowing you've done something good. And it doesn't just feel good - it has lasting health benefits as well, according to [https://greatergood.berkeley.edu/article/item/how_volunteering_can_help_your_mental_health Berkeley] and [https://www.health.harvard.edu/blog/volunteering-may-be-good-for-body-and-mind-201306266428 Harvard].\n\nTo learn more about volunteering, come to a [[Hack Your Hackerspace]] meeting and stick around afterwards to chat with some of our volunteer leaders. If you can't be here on a Thursday evening, talk to us through our [https://groups.google.com/forum/?fromgroups#!forum/heatsynclabs Google group] or [http://bit.ly/hslslack on Slack].\n\n=Be a Member=\nWhen you [http://members.heatsynclabs.org/ become a member], you get to vote on our direction forward. You have some extra benefits available to you at the shop. But most importantly, your membership fee is a significant part of our funding. You're helping to pay our rent and to keep the lights on.\n\nFind out more by visiting our [http://members.heatsynclabs.org/ membership site].\n\n=Donate=\nIf you aren't interested in being a member but still want to contribute financially, donations are another major source of our funding. Your donation helps ensure that others in the community will have access to tools and instruction that would otherwise be financially unrealistic for many people.\n\nThere is a [https://www.heatsynclabs.org/ donation link] on the front page of our website, and we have donation boxes set up at most of the workstations in the lab.\n\n=Choose Your Own Adventure=\nDo you know another good way to help the lab that isn't listed here? Tell us about it! Even our engagement drive itself is community driven. Talk to us on our [https://groups.google.com/forum/?fromgroups#!forum/heatsynclabs Google group], [http://bit.ly/hslslack on Slack], or at [[Hack Your Hackerspace]]. Help us find new ways for people to join in!",
    "bytes": 2968
  },
  "revision_count": 3,
  "first_revision_timestamp": "2022-07-31T18:53:43Z",
  "is_redirect": false
}