{
  "title": "Lab Furnishings",
  "ns": 0,
  "id": 371,
  "slug": "Lab_Furnishings",
  "latest_revision": {
    "id": 2490,
    "timestamp": "2011-07-08T03:13:01Z",
    "contributor": {
      "username": "Huertanix",
      "ip": null,
      "id": 20
    },
    "comment": "/* Total Cost */",
    "text": "==Overview==\n\nHeatSync Labs's headquarters is located in downtown Mesa, which looks overly Leave-it-to-Beaver.  HeatSync Labs is full of futurists who fantasize about living on the Enterprise, so our look and feel inside the lab will be different.  Most hackerspaces, unfortunately, end up with a \"garage sale\" look in contrast with the modern Ikea look that most co-working spaces have, including the one we've hosted events in for over a year.  We should aim for a uniform base of wall colors/layout and basic furniture and leave whatever items rest on it in aesthetic freedom.\n\nOur colors are a base of graphite gray and cloud gray with industrial orange and sunshine yellow for complementary colors.  Walls should be combinations of the grays, with the possibility of some orange accenting.  Furniture can be any combination of the aforementioned colors, and black.  We have a hardwood floor and wood furnishings of the same beech wood color.  Wooden furnishings should ideally be somewhat close to this.  No mahogany nonsense.  We're not a lawyer's office.  Metallic elements will likely be shown off in machinery, so having shiny metal in furniture is great, but non-grey metals (brass, etc) should be avoided.\n\n==Proposed furniture==\n\n===Commons tables (4 total)===\n<s>[http://www.ikea.com/us/en/catalog/products/50106773 Ikea Vika Byske table top (beech wood)] + [http://www.ikea.com/us/en/catalog/products/10118971 Vika Lilleby Trestle legs (black)] (rated to 110 lbs, sturdier than single legs).\n\n'''NOTE''': Ikea Tempe is fresh out of the Byske table tops, but the next size down is only two inches shorter, so its not a bad second choice.\n\nCost: '''$440'''</s>\n\n'''NOTE''': Beech wood doesn't actually match the sickly yellow color of the hardwood floor; Pine is the closest match.\n\n[http://www.ikea.com/us/en/catalog/products/60136557 Ikea Vika Furuskog table top (pine)] + [http://www.ikea.com/us/en/catalog/products/80130776 Vika Lerberg Trestle legs (charcoal gray)]\n\nCost: '''$320'''\n\n===Private work desk (3 total)===\n[http://www.ikea.com/us/en/catalog/products/S49861168 Galant combination desk with drawer (beech wood)].  Chair not included.\n\nCost: '''$585'''\n\n===Commons Chairs (6 total)===\n\n<s>For hackers spending several hours hacking on code: [http://www.ikea.com/us/en/catalog/products/10142693 RICKARD swivel chair (gray/black)] or [http://www.ikea.com/us/en/catalog/products/S79877709 SNILLE (black)]\n\nCost: '''$108'''</s>\n\n'''UPDATE''': Goodmans is donating six matching chairs for this, for free!  We just need to coordinate a pickup once they give us a location.\n\nCost: '''$0'''\n\n===Event chairs (18 total)===\n[http://www.bizchair.com/dad-ycd-50-gg.html Flash Furniture DAD-YCD-50-GG].  These can be stored on a [http://www.bizchair.com/hf-700-dolly-gg.html Flash Folding Chair Dolly]\n\n'''NOTE''': Stock Ikea casters are designed for soft Swedish floors and not hard Arizona dead tree floors.  Use [http://www.ikea.com/us/en/catalog/products/35093200 PARAGRAF] casters to prevent floor damage and ensure fast chair racing.\n\n'''NOTE''': The casters built into RICKARD chairs work well on hard surfaces as-is, so if we choose those, we won't need to buy different casters.  Also, the SNILLE chairs aren't ideal for butts larger than David's, maybe. '''Update''': SNILLE chairs are used at Cartel Coffee Lab.  They're the red plastic ones.\n\nCost: '''$442'''\n\n===HSL Library Bookshelf (1 total)===\n<s>[http://www.ikea.com/us/en/catalog/products/20102130 BESTÅ shelf unit (beech wood)] (stronger construction than the Billy shelves everyone has)\n\nCost: '''$150'''</s>\n\n'''UPDATE''': Beech wood does not match the floors, but black looks nicely atop it.\n\nAlternate Options:\n[http://www.biglots.com/browseItem/bookcases-towers-1/1824# Big Lots bookcase (black, 2 total)]\n\nCost: '''$60'''\n\n===Obligatory Sofa (1 total)===\n[http://www.target.com/Sofa-Bed-Orange/dp/B003515UP6/ref=sc_qi_detailbutton Target Orange Sofa] or Julia T's sofa that she wants to get rid of.  If the outer cover is standardized it might be possible to find an orange or black one.\n\nCost: '''$180'''\n\nAlternate Option: Julia.T's friend has a soda she can give us.  Its not orange, but we may be able to change the upholstery or just use it until money comes in for an orange soda.\n\nCost: '''$0'''\n\n== Vendors ==\n\n* http://www.marketswest.com/store/pc/Folding-Tables-Chairs-c52.htm\n* http://www.abiaz.com/#/Pre_Owned_Seating-8-161.html\n* http://swofficefurniture.com/index.php?pr=Furniture\n* http://www.cort.com/furniture-clearance\n* http://www.buyusedcubes.com/used.htm\n* http://www.azoffice.com/uf_usedchairs.html\n* http://www.cornerofficeaz.com/preownedproducts.html\n* http://www.ikea.com/us/en/\n*https://webapp3.asu.edu/spms/public.aspx\n\n\n== Total Cost ==\n\n'''$1587'''\n\n== Optional Goodies ==\n\n===Antique phone booth===\nMade of solid, sturdy Oak wood.  [http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=110695803190&ssPageName=STRK:MEWAX:IT#ht_500wt_1156 Found on eBay].\n\nCost: '''$1100'''\n\n===PS BRUSE Coffee Table===\n[http://www.ikea.com/us/en/catalog/products/80141505 IKEA PS BRUSE Coffee table]. A fancier table that would substitute a $10 black LACK table and match the beech wood main tables.\n\nCost: '''$149'''\n\n===Spare Projector===\n[http://www.officemax.com/catalog/sku.jsp?skuId=22383118&csId=2-69-3289-56-3-79699-63980-56-3289-184-56-3289-734-0-2 Epson EX7200 Projector]\n\nCost: '''$749.99'''\n\n== Sponsors ==\nHeatSync Labs is a 501c3 organization with a history of doing things that not only benefit Mesa and Arizona, but the world from Japan to Kenya as well.  Many companies like that about us because it gives them a tax break and makes them look cool.  We should approach companies to give us things.  Here's a list of companies to contact.  For privacy reasons, contacts are not listed on this page:\n\n* '''Home Depot''' - Paint, white-board-transforming-magic-paint, metallic spray paint, metallic tape, any tools they'd be willing to part with.  Located at Baseline/Rural.\n** Sam contacted the various Home Depots in the valley and they said they didn't have vouchers in for this quarter.\n* '''IKEA''' - BYSKE tables, private desks, cushioned chairs, coffee presses. Located on Warner/I-10.\n** Sam called them; Waiting for a day when the person we need to talk to is there.\n* '''Thinkgeek.com''' - Binary clock, books, anything cool they'd be willing to donate.\n** ThinkGeek has a program in place to donate imperfect goods to hackerspaces.  I applied for it on behalf of HSL. ~ huertanix\n* '''Target''' - Orange couch, coffee table, all-in-one printer, projector.\n* '''Target Commercial Interiors''' LED lamps, stacking chairs if we can't afford the discount ones, fancy electronic room scheduler\n** Email'd on 6/17, asked for 12 LED lamps, 18 stackable chairs, and the electronic room scheduler.  No response. :( ~ huertanix\n* '''Herman Miller''' - 3 Aeron chairs for private desks would be epic.  A set of 6 high-end chairs would also be great to substitute the \"hardcore hackers\" cushioned chairs with too.\n** Got a reply, they have SIX chairs for us from Goodman's.  Not Herman Miller chairs, but something of high quality.  They are in different warehouses and should be ready for pickup sometime in the 4th week of June. ~ huertanix\n* '''Tropo''' - Might have to put Tropo stickers on donated furniture.  huertanix has contact info for Tropo co-founder Johnny Diggz, a pretty cool dude who supports Random Hacks of Kindness and School Factory.\n** Email'd, awaiting response.\n* '''K-Zell''' - giant metal slate that could be mounted on a wall to become a whiteboard, eventually.  Also, aluminum slate for custom A-frame.\n** Contacted, will need a DXF file for A-frame design.\n* '''OfficeMax''' - giant whiteboards (backup plan in case the metal one doesn't work), dry ease markers, all-in-one printer, projector.  Located on Broadway/Rural.\n* '''Sparkfun.com''' - Cash donations, gift certs, or maybe some Lilypad TechStyles Kits so that our wearable computing workshops are less ghetto.\n** Contacted, waiting to hear back. ~ huertanix\n* '''Michael's''' - Post frames for orange propaganda posters.",
    "bytes": 8122
  },
  "revision_count": 51,
  "first_revision_timestamp": "2011-05-30T20:31:11Z",
  "is_redirect": false
}