{
  "title": "Laser storage proposal",
  "ns": 0,
  "id": 1303,
  "slug": "Laser_storage_proposal",
  "latest_revision": {
    "id": 5001,
    "timestamp": "2021-04-09T01:20:20Z",
    "contributor": {
      "username": "Gamebofh",
      "ip": null,
      "id": 710
    },
    "comment": "",
    "text": "=Background=\nThe storage area for the materials used at the laser is a disaster.  With little organization we end up with an ever increasing amount of material that is being stored on-site.  It's HeatSync Labs, not HeatSync storage.  This proposal is to build a series of storage shelves with a system to allow for on-going organization and maintenance.\n\n[[File:PXL_20201228_175920778.jpg|250px]]\n\n=Overview=\nThe storage is divided up into three spaces.  The idea is that these spaces act together to maintain storage and organization over the long term by creating a system where materials are automatically cycled through.\n\nThis is sized to fit into the current space for the storage and \"Bike Repair Station\".  The station is a single horizontal cabinet with some tools in one drawer.  It receives no use but the tools would be stored elsewhere (upstairs?).\n\n==Estimated materials==\n* 14 sheets of 1/2\" plywood\n* 3 sheets of 1/4\" plywood\n* Misc screws/nails/glue\n* Paint (green, yellow, orange, red)\n\n==Estimated cost==\nCovid has really wreaked havoc on lumber prices. Roughly speaking costs for materials are:\n* 4x8 sheet of 1/2 plywood: ~$50\n* 4x8 sheet of 1/3 plywood: ~$30\n\nThis puts us at $800 just in basic materials.\n\n==Space 1: Scrap & Equipment==\n\n'''Note:'''  Ok, I did put the colors in the render, but not the back wall, but would be painted.\n\nThis section has 5 bays.  1 of the bays is reserved for equipment (primarily the honeycomb screens and cleaning materials).\nThe other 4 bays are for scrap.  The bays will be painted with the following color coding:\n\n* Green: Newest scrap\n* Yellow: Scrap 1 cycle old\n* Orange: Scrap that is 2 cycles old\n* Red:  Scrap that will be trash on the next cycle.\n\n[[File:laser-storage-color.png|250px]]\n\n==Space 2: Limited member storage ==\nThis section has (planned) 8 bays that can be rented by members to hold their materials.  The idea is that this is not a profit center, but requires a certain amount of commitment to maintain.  Suggestion is that this is a random draw if demand exceeds number of bays, with a monthly cost of $1/month for using the bay.  Draw could happen quarterly or bi-annually at a convenient HYH.  Failing to pay the dues would put the material in that user bay into the green bay of storage.\n\n[[File:laser_storage_bay2.png|250px]]\n\n==Space 3: General storage ==\nThis is a four bay system setup identical to space 1, but without the equipment space.  The four bays are:\n\n* Green:  Most recent storage\n* Yellow: Storage that has been there one cycle\n* Orange: Storage that has been there two cycles\n* Red: Storage that has been there three cycles.  The next destination for this bay is the Green bay of scrap.\n\n[[File:laser_storage_bay3.png|250px]]\n\n=Process=\nOn a periodic basis (not more frequent than weekly) all materials will be cycled through the bays in the following manner:\n\n* Anything in the red bay of scrap will be thrown out\n* All bays (except red of storage) will be moved up one bay\n* Red of storage gets cycled to green of scrap\n\n=Discussion=\nThis system allows for members to store material on-site in designated bays for up to a month (1 week x 4) if they don't have a member storage bin.  From there, it has an additional month of life as scrap available for general use before it would be thrown out.\n\n=Design=\nThis is a preliminary design for the storage.\n\n==Considerations==\n* The bottom section should be at least 155cm tall to allow for the common sheets to be stacked without requiring that they be angled, to allow for maximum storage\n* The overall height should fit within the space currently between the floor and the top overhang (roughly 192 cm)\n** The above two constrain the maximum size of the top smaller section\n* Depth should be enough to allow for materials to not fall out.  This specific depth was chosen to allow for two side panels out of a single 4x8 sheet of plywood\n* Maximum width of all 3 bays must be less than 3m to fit into existing space.  These designs currently total up to 2.85m\n\n==Material==\n* Current thought is 1/2\" plywood for the entire portion, except for the back panel which can be 1/4\" since it is not structural, but necessary for square\n\n==Semi-random Decisions==\nThese are design decisions that seemed reasonable but I don't have strong constraints on except for overall width available in the space.  Putting them here for transparency.\n\n* Community bins are 20 cm wide\n* Individual bins are 10 cm wide\n* There are 8 individual bins\n\n\n[[Category:Proposals]]",
    "bytes": 4502
  },
  "revision_count": 21,
  "first_revision_timestamp": "2021-02-13T02:15:19Z",
  "is_redirect": false
}