{
  "title": "Laser Mustache Party",
  "ns": 0,
  "id": 214,
  "slug": "Laser_Mustache_Party",
  "latest_revision": {
    "id": 1411,
    "timestamp": "2010-10-14T16:05:55Z",
    "contributor": {
      "username": "70.190.148.95",
      "ip": null,
      "id": 0
    },
    "comment": "/* Local Press */",
    "text": "=Introduction=\n\nHeatSync Labs in one year old and we want to celebrate big.  Mustaches, lasers, robots, mad scientists/engineers, music, food and so much more. Jump through our laser trip wire, 3D-printed plastic mustaches, robots of various sorts, and experimental electronica by none other than local legend, Thru the Wires! This event will be representative of our accomplishments over the last year as well as our community as a whole.  Costumes and shenanigans are expected.  Robots dancing?  Yes! It will be a sampler platter of Rave + Cosplay + Maker Faire + Science Center flavors all rolled into a night of calamity unlike anything Chandler has ever seen!\n\n=Date=\n\nThe main worry with later dates is bumping up against Halloween weekend.  Research has found another big experimental electronica show being held the week of the 16th so it would be good to both avoid that weekend and advertise there.  \n\nThru The Wires have requested Sat Oct 23rd, over other dates or a Friday.\n\nDATE BOOKED AT GANGPLANK -- EVENT SET FOR 23RD 8PM\n\n=Needs!=\nBoy this thing is big.  We need your help!  \n*First if you can supply anything from our budget we can avoid spending that money.  \n*Second we need cool projects to display! We want to celebrate our year together!\n*Can you supply club style furniture?  Bean bags? Wed like some chill seating for the night\n*Can you help with our ground campaign?  \n**The current idea is to be taking pictures of local celebs and advertisements with mustaches applied.  Twitter them to @MustacheParty for a retweet!\n**Can you hand out flyers on your campus/hip coffee shop location/etc?\n\n=Budget=\n*Bottled Water -5 cases? -$25 for all\n*Sheet metal for throwies - $25\n*Quote from dieborg, and tuna's designer for flyers?\n*Flyers printed $100\n*Someone to put flyers everywhere? ?\n*Fabric to split Gangplank in half $2/yard  15ft high fabric  25 yards? $200  60 yards\n*Disposables (plates, signs, napkins, etc) $20\n*UV laser drawing - covered by Jeremy\n*Throwies - covered by Jacob\n\n~$370 budget.  would need 70 people at this budget to make our $400 in profit\n\n=Marketing=\n\nThis event needs to be marketed correctly.  The graphic design legwork has been done and we need everyone to pass out flyers, [http://twitter.com/MustacheParty| tweet]/update [http://www.facebook.com/event.php?eid=109314745794645&ref=ts|  Facebook] status details about the event, help find/refer local press or sponsors, and drive traffic towards our marketing material.\n\n'''Total Budget:''' $100\n\n'''Target Attendance:''' 200 attendees\n\n== Local Press ==\n* [http://www.phoenixnewtimes.com/| New Times ]\n** Contacted, still waiting to hear back\n* AZ Central\n** Contacted, submitted to the [http://www.azcentral.com/thingstodo/| Events Calendar]\n* The Chandler Times\n* Arizona Republic\n* [http://eastvalleytribune.com/| East Valley Tribune]\n** [http://ea-www2.eastvalleytribune.com/calendar/details/?eventid=1078| Event was posted to the Get Out Calendar, October 6th]\n* MENSA\n** Contacted, thanks Justin!\n* Gangplank Press\n** Contacted, went out first week of October\n* Thru the Wires Press\n** [http://www.dontstayin.com/usa/AZ/phoenix/gangplank-hq/2010/oct/23/event-245977/| Don't Stay In]\n** [http://phoenix.going.com/event-808742;Thruthewires_Gangplank_Term11Shane_Silkeyetc/| Going.com]\n** [http://www.residentadvisor.net/event.aspx?200323/| Resident Advisor]\n** AZEDM, Drumcore, Napkin Nights, The Shizz, Silver Platter, Drex Rekker Myspace, ThrutheWires Myspace\n*** Posts submitted by Adam 10/14, should go out third week of October\n* [http://www.lightningoctopus.com/| Lightning Octopus ]\n** [http://www.lightningoctopus.com/2010/10/mustaches-music-mad-science/| Article went out, October 5th ]\n* [http://makezine.com/events/| MAKE Online]\n** [http://makezine.com/pub/event/2305| Event was posted to the Make Calendar of Events, October 6th]\n\n== Street Team  ==\n'''''Interested in helping out? Let a member of the Board or MustacheParty crew know!'''''\n* 2nd round of Flyers\n** Andrea volunteered to print 9.29.2010 at or before Hacknight\n** Dispersal date set for the first weekend of October\n** Coffee houses, Gangplank, Bookmans, School campuses, anywhere someone is likely to pick up a flyer \n* Mustache Stickers and Spray Templates around town \n** Once the stencils are cut, we will hand them over to the Street Team with Spray Chalk.\n* Word of Mouth \n** Spread the word, make sure that your friends and family don't miss out on our incredible event. \n** Encourage those interested to RSVP on [http://www.facebook.com/event.php?eid=109314745794645&ref=ts|  Facebook] and follow the [http://twitter.com/MustacheParty| Twitterstream]\n** Enthusiasm will generate more enthusiasm.\n* Mustache Flash Mobs\n** As the date draws near, we will throw mini mustache flash mobs to generate excitement. These will be announced on all Mustache Party avenues.\n\n== Flyer Distribution ==\nBookman's\nStarbucks\nXtreme Bean\nCartel\nSilvermine Subs\nEcho Coffee\nGoldbar Coffee\nHooligan's Records\nZia Records\nBuffalo Exchange\nlocal gyms\nlocal bars\n\n== Social Networking ==\n* [http://www.facebook.com/event.php?eid=109314745794645&ref=ts|  Facebook]\n** Invite friends you think will be interested, skip ones you think won't RSVP. \n** Include our sponsors\n* [http://twitter.com/MustacheParty| Twitter]\n** HeatSyncLabs will retweet major MustacheParty tweets\n** Our tactic here is guerrilla marketing. Without blatantly overpromoting, we want to stick to about a Tweet a day featuring a quirky tagline and a devastatingly good looking picture of a familiar faces in a 'stache.\n** Tweet about Mustache Party with the Hashtag MustacheParty\n** Send Joyce mustache pictures for Tweets\n** Include our sponsors\n* [http://www.mustacheparty.org/| Official Website]\n** Features basic when, where, and what information on a static page with a counter \n** Includes our sponsors\n** Zach (Digital Desert) and blkhat\n\n== Sponsors ==\n* Thru the Wires\n* Gangplank\n* OvenTree\n* DigitalDesert\n* Lightning Octopus\n* HSL GoogleGroups call for sponsors thread\n* Send a quick email to Jeremy or Joyce for Press/Donation Request Letter Template\n* Interested or know someone who would be interested in sponsoring? \n** We will put your company name on the Mustache Party event website, up on the HeatSync Labs website, the  [http://www.facebook.com/event.php?eid=109314745794645&ref=ts|  Mustache Party Facebook], the Mustache Party Twitter page, the HeatSync Labs Twitter page, and our event flyers and signs as we disperse them around town. This is intended as our way of showing appreciation for your help toward our cause\n\n=Music Acts=\n\nWe want a musical act that can represent our do it yourself maker culture.  Genres that come to mind initially:  Industrial, Nerdcore, Experimental Electronica, etc.\n\n* Minibosses - Rock band that plays classic video game tunes - Still No Answer From Them...maybe for another event\n* Through The Wires - Local Group of Experimental Electronica Enthusiasts - Have accepted!\n\n=Catered Food=\n\nNeed to look into possibilities for free catering.  Have any suggestions?  Know anyone local that would be willing to cater for free for some good press?  Some possibilities:\n\n* 24 Carrots - http://24carrotsjuice.com/ - Has catered Gangplank and other events many times.\n* Cathy's Rum Cake - http://www.cathys-rum-cake.com/ - Looks like they've done free samples at different locations.  Challenge her to make a robot mad scientist cake?\n* Silver Mine Subs - http://silverminesubs.com/ - Sandwich shop that is up late nights?  Ask for bite sized sub samples.  Sell that they are the sandwich shop of choice because they're tasty and they are open when we're working.\n*got a contact for red bull when they came by gangplank  gotwiiings@gmail.com <--- emailed Red Bull rep contact provided by Katie and am waiting for response. \n* ???\n\n=Cash Bar=\nSadly in Arizona you are not allowed to have a cash bar without a liquor license.  Several companies, [http://www.pourmasters.com/ Pour Masters] and [http://www.shakeitupbartending.com/ Shake It Up], exist where you can get around this for your event.  There are 2 options:\n*Hire just a bartender for ~25 an hour for a minimum of 5 hours and you provide the alcohol (I think they'll provide mixers usually so its $125 + alcohol)\n*Buy a package where they bartend per head for a minimum of 100 people.  These are $8 a head for Beer and Wine and ~15 a head for well drinks ($800-1500)\n\nHowever there is one interesting loop hole for nonprofits.  If you are a 501c3 you can apply for a liquor license for your event for ~300 dollars per event and proceeds go to your nonprofit!  We're not 501c3 yet, and thats an expensive license, but might be handy in the future.\n\nSo for this event I think we either provide our own liquor (and maybe our own bartender) or BYOB or skip it all together..  It'll be interesting to watch how the Poker Tournament is held.\n\n=Furniture=\nWe expressed interest in making gangplank out to be lounge-y and club-y for the event.  They have 3 couches, but ideally we'd like to see 3-6 more probably.  \n\nWe found a company [http://www.uniquetabletoprentals.com/ Unique Table Top Rentals] who will rent furniture for just this occasion.  As you would expect however they are PRICEY.  Their cheapest goods are the armless couches which they have a few in the ~$280 each range.  Add to this delivery charges around ~$75 and a deposit of around 150% of what your rental costs are(If you are renting $500 in goods, expect ~$750 deposit) and this puts them out of our range sadly.\n\nCan we make some sort of bar seating ourselves?  Can we round up enough couches off of craigslist or from our people?  Can we round up beanbags and rugs on the cheap?\n\n=Interactive Installations=\n\nWe want this event to be a chance to feature our local Makers.  You have anything to show off?\n\nNew Project Ideas:\n\n* Near UV Drawing Displays and Where's Waldo?\n* Laser Trip Lines for Swag\n* Mustache Cornucopia Machine(RepRap)\n* Color Spectrum Fun? - http://bit.ly/9fCTOC\n* 1950's Style Robot Pinata\n* Display Model of Near Space Balloon\n\nLocal Maker Projects:\n\n* Todd's Homemade Van De Graaff Generator\n* Rene's Modded Motorcycle\n* Justin's Solar Trike\n\n=Funding=\n\nI'd like to see if we can solicit donations from local parts, tools, and storage distributors that we use(feel free to add any others you can think of):\n\n* Goldmine Electronics - http://www.goldmine-elec-products.com \n* Circuit Specialists - http://www.circuitspecialists.com/ \n* Tritek Electronics - http://www.tritekelectronics.com/\n* Fry's Electronics - http://www.frys.com/template/ecomponents  \n* Radioshack - http://www.radioshack.com/home/index.jsp\n* Harbor Freight - http://www.harborfreightusa.com/usa/common/start.do\n* Home Depot - http://www.homedepot.com/\n* Lowe's Home Improvement - http://www.lowes.com/\n* Ace Hardware - http://www.acehardware.com/home/index.jsp\n\nI'll be writing up and uploading a generic letter to present to these establishments.  We'll need help approaching these places.",
    "bytes": 11003
  },
  "revision_count": 63,
  "first_revision_timestamp": "2010-08-30T01:59:48Z",
  "is_redirect": false
}