{
  "title": "Laser Cutter Kickstarter",
  "ns": 0,
  "id": 249,
  "slug": "Laser_Cutter_Kickstarter",
  "latest_revision": {
    "id": 4600,
    "timestamp": "2020-06-15T00:37:41Z",
    "contributor": {
      "username": "Gamebofh",
      "ip": null,
      "id": 710
    },
    "comment": "+category",
    "text": "HeatSync Labs wants a laser cutter, so a number of us have volunteered to make a Kickstarter video to convince the internet to help HeatSync Labs get one.  The project ends on December 23rd, 2010.\n\nLinkage: http://www.kickstarter.com/projects/heatsynclabs/laser-cutter-for-phoenix-area-makers\n\n== Lazors! ==\n\nThe laser cutter we're aiming to acquire is either an Epilog Legend 36EXT or a Universal ILS 9.75 or an equivalent OEM model.  A sexy video of the OEM model in action can be found here: http://www.youtube.com/watch?v=R7UaSkPU1Go\n\nSpecs for the ILS 9.75 can be found here: http://www.ulsinc.com/products/ils975/\n\nSpecs for the Legend 36EXT can be found here: http://www.epiloglaser.com/legend_36ext.htm\n\nThese are the options we are looking for:\n\n* 80-watt to 125-watt laser tube (depending on purchase time, applicable sales pricing and funds raised)\n* Rotary attachment\n* Motorized up-down table with autofocus\n* Industrial chiller\n* Red-light position\n* Vacuum table\n* Honeycomb support bed\n* Air assist\n* Additional tube(s) and additional mirrors/lenses as they are wear & tear consumable parts\n\n== Prize Tiers ==\n\n===Original Idea===\nThe original prizes and tiers were developer by Joyce, Zach, and Drea and they are these:\n\n'''$25+'''\nHeatSync Labs will send you an official schwag pack (stickers, buttons, laser-cut pieces, business cards, etc). Its packed full of fun stuff, complete with bragging rights!\n\n'''$75+'''\nShow your support with a personalized HeatSync Labs metal name plate. Display your name and the HSL logo anywhere you are \"allowed\" ! ;)\n\n'''$150+'''\n3x5 Metal* lasercut picture of your choice. We'll etch a fun picture for yourself or a friend or family. Great as a gift to show how much you care (about yourself or others!)\n\n'''$500+'''\n8x10 Metal* lasercut picture of your choice. Is your picture too epic for 5\", or maybe you want all your cats in the picture of yourself or friends or family or other pets? Pledge 500 dollars and get a fatty 8x10 inches of pixelated pleasure etched on metal.\n\n'''$1,000+'''\nLasercut Makerbot** frame pieces You know you can't find these on eBay. Pay up.\n\n * I don't think we can actually cut metal with the laser cutters we're looking at.  Can someone verify this?\n ** Makerbot is a copyrighted term; We'd have to say something like Makerbot-compatible if we offered this.\n\n===Current Prizes===\n\nThe current prizes (as of December 4th), developed by David.H, David.U and Jeremy are these: \n\n'''$10+'''\nOne (1) laser-cut acrylic mustache holiday ornament (random color).\n\n'''$25+'''\nThree (3) unique laser-cut acrylic mustache holiday ornaments (various random colors).\n\n'''$50+'''\nThree (3) unique laser-cut acrylic mustache holiday ornaments (various random colors) and a one-of-a-kind laser-cut mustached angel tree topper!\n\n'''$200+'''\nFull set of thirty-two (32) unique laser-cut acrylic mustache holiday ornaments (various random colors) and a one-of-a-kind laser-cut mustached angel tree topper!\n\n'''$500+'''\nFull set of sixty-four (64) unique laser-cut acrylic mustache holiday ornaments (various random colors) and a one-of-a-kind laser-cut mustached angel tree topper!\n\n'''$1000+'''\nFull set of sixty-four (64) unique laser-cut acrylic mustache holiday ornaments (various random colors), a one-of-a-kind laser-cut mustached angel tree topper, and a gold-freaking-plated mustache holiday ornament!\n\n * The kickstarter doesn't specify what type of mustache, but Nietzsche had an epic 'stache and we should model his.\n\n'''NOTE''': Since the kickstarter has already been launched, we cannot remove the current prizes.  We can, however, add some new ones into the mix.  We want your suggestions!\n\n===Proposed Additional Prize Ideas===\n\n''David.H:''\n\n*'''$10+''' Laser-cut/etched transparent red plastic bacon-shaped bookmark.\n\n*'''$30+''' 6\" x 9\" clear orange acrylic etched photo of yourself with the caption \"I <HSL logo> Lasers\" \n\n*'''$50+''' 11\" x 8.5\" clear orange acrylic plaque featuring etched \"<HSL logo> <3 <Contributing hackerspace logo>\" and handwritten signatures of the members.\n\n''Nate.P(l):''\n\n*HSL keyfob(s) (unknown material or price) \n\n*license plate frame (car or bike) (unknown material or price) \n\n*engrave your phone/laptop (unknown price)\n\n''Jeremy L.:''\n\n*'''$50''' and up get intro class to using the laser cutter(safety and printing your first test design...these classes will be necessary for cutter use) \n*Hackerspace with the most members that have contributed will have x amount of their logo printed out on x material.\n\n''Corey:''\n\n*Shark with freaking lasers puzzle! (unknown material or price)\n\n''Ray M.''\n\n* An acrylic item of your choice. The more square inches of the uncut acrylic, the higher the cost. Price them at \"midpoints\" between existing items, e.g. $20, $30, $60, $75.\n\n''Your name/ideas here!''\n\n== Promotion ==\n\n'''Facetime'''\n\nThe most effective means of achieving donations is an in-person request to friends and people you know who want to help the space, perhaps even only as a personal gesture to help you get your hands on a thousand-dollar toy.  Open up your address book and start making some calls.\n\n'''Linkage'''\n\nOur story is posted in various parts of cybersauce.  You can help out by digging/voting/upboating/reblogging our various online mentions!  Here they be:\n\n'''Reddit''': http://www.reddit.com/r/hackerspaces/comments/edjpt/heatsync_labs_seeks_funds_from_cybersauce_to_buy/\n\n'''Newslily''': http://newslily.com/comments.cgi?thread_id=38041\n\n'''Digg''': http://digg.com/news/technology/the_countdown_to_lasertime_begins_now_heatsync_labs\n\n'''Tumblr''': http://huertanix.tumblr.com/post/2068127417/kickstarter-laser-cutter-for-phoenix-area-makers\n\nKickstarter has a neat widget that you can put on your site, unless\nits Wordpress, because Wordpress hates iframes and thus hates America:\n <iframe frameborder=\"0\" height=\"380px\"\n src=\"http://www.kickstarter.com/projects/heatsynclabs/laser-cutter-for-phoenix-area-makers/widget/card.html\"\n width=\"220px\"></iframe>\n\nHere's a short link you can use on Identi.ca/Twitter/SMS/etc:\nhttp://kck.st/hl5nh6\n\n'''Flier'''\n\nAs seen at SuperHappyDevHouse at Hacker Dojo!  The official HSL Laser Cutter Kickstarter flier (PDF direct link):\nhttp://dotbloom.com/hsl_laser_cutter_kickstarter.pdf\n\n[[Category:Laser]]",
    "bytes": 6289
  },
  "revision_count": 32,
  "first_revision_timestamp": "2010-12-05T05:48:54Z",
  "is_redirect": false
}