{
  "title": "Leather Working",
  "ns": 0,
  "id": 1385,
  "slug": "Leather_Working",
  "latest_revision": {
    "id": 6085,
    "timestamp": "2024-09-10T01:58:39Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "station template added",
    "text": "*'''Station Champions:''' Needed\n*'''Communication:''' Post in Slack #general if you have questions or need help\n*'''Certification:''' None, ask if you need help\n*'''Events:''' None\n\n\nJustin F. Donated leather working tools. These are currently stored in the drawer labelled Leather near the Lock Picking by the woodworking area.\n\n== Tools ==\n*'''Hollow punch set'''.  Useful to punch round holes, such as to install buttons or rivets.  There is a small hex key to tighten the screw which holds the interchangeable pieces in place.\n*'''Edge slicker/burnisher tool + attachments'''.  Used to burnish an edge for protection and aesthetics.\n*'''Diamond chisels'''.  Used to punch holes through one or more pieces prior to stitching.\n*'''Stitching groover'''.  As a matter of preference, it can be used to create a grooved stitch line.  The stitches sitting in the groove will be less prone to abrading with use.  More common practice is to mark the stitch line with a scratch awl before punching/stitching.\n*'''Stitching awls'''.  For one-off stitching holes and when a hole wasn't punched all the way through by stitching chisels.\n*'''Scratch awl'''.  Useful at various stages of a project.  Particularly useful when starting a project for marking a pattern onto a piece of leather prior to cutting the components out.\n*'''Edge bevelers'''.  Used to bevel an edge in order to prevent fraying and maintain a professional appearance.\n*'''Skivers (Tandy Super Skiver, safety skiver)'''.  These are used to thin a piece of leather.  Most commonly, this will be useful to cut down bulk at an edge where multiple pieces are stitched together.\n*'''Stitching clamps (2)'''.  This tool holds a project so it can be stitched with both hands.\n*'''Honing guide'''.  Block of red wood with different guides for sharpening different tools.  Sandpaper placed on guide before tool is dragged along it.\n*'''Thickness gauge'''.  Used to measure the thickness of leather.\n*'''Rivet setter'''.  Used to set copper rivets.\n*'''Edge creaser'''.  Used to place a crease along the edge of a project for aesthetic value.  \n*'''Thread snipper'''.\n\n== Supplies ==\n*'''Gum tragacanth'''.  Edge finishing product.  Used ''before'' beeswax.\n*'''Beeswax'''.  Edge finishing, etc.\n*'''Leather adhesive''' (Eco-Flow Leather Weld).  Two pieces can be glued together at the edge before stitching.\n*'''Waxed threads'''.  This is fairly heavy-duty thread and not ideal for all projects.\n*'''Saddler's needles (John James #4)'''.  A versatile size of the most recommended saddler's needle for stitching leather (note holes must be punched beforehand).\n*'''Blades for safety skivers'''.\n*'''Sand paper for honing guide'''.  Use lower number grits first, progressing to higher numbers.\n*'''Honing compounds (yellow, green)'''.  Used to sharpen tools, such as edge bevelers.  Can be loaded onto a piece of thread which is pulled through the groove on an edge beveler to sharpen.\n\n== Photos ==\n<gallery widths=300px heights=200px>\nFile:Stitchingclamp.jpg|Example of stitching clamp in use.\nFile:Stitching Clamp 1.jpg|Holds projects so you may stitch them.\nFile:Awls.jpg|Top: scratch awl. Bottom 3: various sizes of saddler's awl.\nFile:Burnisher.jpg|Automatic burnisher tool + attachments for different thickness projects. Can also be used with sanding drums.\nFile:Burnisher side.jpg|Burnishing tool + variety of attachments.\nFile:Burnisher Key.jpg|Chuck key for burnisher tool.\nFile:Circle punches.jpg|Circle punches + misc heads. Used for installing buttons or rivets, among other things.\nFile:Hex key.jpg|These are used to change the heads on the round punches.\nFile:DIamond chisels.jpg|Different stitching chisels; specifically, diamond chisels. The spacing of teeth dictates the way your stitches will look.\nFile:|Edge creaser. Used to impart a decorative line along edge of leather. A more refined look. The left tine goes on surface of leather, right rides along the edge to keep a straight line. Could use some love if anyone enjoys restoring hand tools.\nFile:Glue.jpg|Leather Weld by Eco-Flo. This is a water-based adhesive. Used to bond two pieces of leather along a stitch line. This will occur either before holes are made with stitching chisels, *or* after that step and before stitching occurs\nFile:Groover.jpg|This is a groover. Its purpose is to carve a small groove where the stitch line will go before stitching holes are chiseled. This allows a more low-profile stitch line in order to minimize abrasion in high-wear areas. The other option is placing a crease with wing dividers or a scratch awl. \nFile:Gum trag Beeswax.jpg |Left: beeswax. Right: gum tragacanth. These are products used in edge finishing; specifically, burnishing.\nFile:Honing compound.jpg|Stropping compound. The yellow is the more coarse of the two, and so would be used first, with the green being a finer grit and used second.  These can sharpen a blade using a strop (can be easily made or purchased). They can also sharpen edge bevelers by loading a bit onto a piece of thread and dragging it through the groove. \nFile:Honing guide.jpg|The red block has different rails with different shapes for sharpening grooved blades such as those on edge bevelers. Sandpaper is placed over the rail and the blade pulled over it.\nFile:Needles.jpg|These are John James Saddler's Harness needles in size 004 (the smallest and most versatile John James makes).\nFile:Rivet setter.jpg|This is a rivet setter, used to set copper rivets.\nFile:Safety skiver.jpg|These are skivers. The bottom is the Tandy Super Skiver, and the blades on the right fit it.\nFile:skiverblades.jpg|These fit the skiver with the wooden handle.\nFile:Snippers.jpg|Thread snips\nFile:Thickness gauge.jpg|Thickness guage. Use to measure thickness of leather. The project dictates what thickness is appropriate.\nFile:Thread.jpg|Various threads. With the exception of the Ritza Tiger Thread (a mid-weight thread), all of these are quite heavy-duty.\n</gallery>\n\n\n== Recommended tools & Supplies ==\n*'''French edger'''.  Helps thin leather in a similar way to a skiver, but useful at different times.\n*'''Copper Rivets'''.\n*'''Seam ripper'''.  Will help remove stitches in event of mistakes.\n*'''Thinner thread.'''  .45 mm waxed twisted poly thread is great.\n*'''Maul/hammer'''.  Nylon head.  Used to strike punches without ruining tools.\n*'''Thread spool storage/rack.'''\n*'''Adhesive spreader.'''  Amy Roke makes the best ones.\n*'''Canvas or denim scraps''' for the final step in edge burnishing.\n*'''Silicone mats''' to apply adhesive without making a giant mess.\n*'''Rubber glue removers'''.  Life savers and inexpensive.\n*'''Sandpaper''' in fine grits.  Typically 500-2000.  Used mostly in edge finishing.",
    "bytes": 6707
  },
  "revision_count": 30,
  "first_revision_timestamp": "2023-07-25T05:36:27Z",
  "is_redirect": false
}