{
  "title": "LTD Stirling Engine",
  "ns": 0,
  "id": 687,
  "slug": "LTD_Stirling_Engine",
  "latest_revision": {
    "id": 3290,
    "timestamp": "2012-04-04T08:22:57Z",
    "contributor": {
      "username": "Rbb36",
      "ip": null,
      "id": 239
    },
    "comment": "",
    "text": "I am noodling with a Low Temperature Differential (LTD) Stirling engine. These are Stirling engines that can run on a small temperature differential, like that between a cup of boiling water and room temperature. This particular design should not use a flame as the heat source because of the low-temperature materials used. I have wanted to build one for a while, and it may work as a project for K-12 students. I am creating this page to post some notes as I go through.\n\nThese are just field notes, not a set of instructions. For good step-by-step instructions, [http://www.scraptopower.co.uk/projects/the-30-minute-ltd-stirling-project check out Scrap To Power's build log].\n\n== First Parts Picture ==\n\n[[File:00-parts.jpg|400px|thumb|left|LTD Stirling Engine Parts]]\n\nSo far I have made the power piston, cut down two large tuna cans and a standard 2 liter, and made a displacer piston.\n\nThe power piston (little orange thing on the lower right) is a diaphragm type using a gatorade bottle lid, 1/4-20 x 1\" machine screw and nut, two 1 1/4\" dia fender washers, a punching balloon, and two rubber bands just the right size to go around once. The gap between the fender washers and the wall looks good: Wide enough to give a decent stroke without stretching at the extents or wrinkling in mid stroke, but small enough that it should keep power loss low. There's a piece of steel wire wound around the screw in the picture -- I was testing the form-a-thread effect of winding the wire around the screw's threads, and it worked very nicely. You can screw the coupling rod on just like a nut.\n\nLarge tuna cans and a standard 2 liter are nicely sized for each other; you get about 3/4\" overlap when you wrap the polyethylene from the 2 liter around the tuna can. I used a side-cutting can opener -- the weird ones that don't leave a sharp edge -- and I think I'm going to be able to get both cylinder heads out of a single can.\n\nI used the dumb-guy method of cutting the displacer out of a leftover piece of polystyrene packing material; cut a smooth edge on one of the tuna can walls and press it through cold. I think heating the can with a torch to hot-cut the foam would be worth the effort, but the cold method worked well enough for the first draft. To get the billet out of the tin can, I just lightly heated the sides of the can to shrink the polystyrene a bit. Once the puck was free of the cutter, I ran a low flame around the circumference to shrink and harden the edges a bit more, testing the fit in the tuna can as I went (it should fall under its own weight when you drop it in). After you run the flame around the circumference, it should harden enough that you can sand it to clean up the shaggies.\n<br clear=\"all\" />\n\n== Finished ==\n\n[[File:ltd-stirling-finished.jpg|200px|thumb|left|LTD Stirling Engine Finished]]\n\nThis is the final state of the engine. Note the thermal failure at the base of the cylinder.\n\nThe remainder of the build went smoothly. Once complete, I tested it with a cup of boiling water. It was putting power into the crank, but not enough to keep itself running. Some problems with the design were already apparent and serious enough that a scratch rebuild was inevitable, so I decided to give it a stronger heat source to work with; I fired up a propane torch, which really got its attention. It started spinning as soon as I put the bottom cylinder head over the flame. Then, about 3 seconds later, the epoxy melted as the cylinder wall overheated and shriveled. End of test.\n\nSuccess -- I got it to run under its own power, and figured out the things I want to change for the refined model.\n\n==== Coming Refinements ====\n\n* Hot Cut The Displacer Cylinder: I used the hot tin can method of cutting a polystyrene plug to act as the hub of the flywheel. That is definitely the right way to cut the displacer next time. You get a very clean plug with nicely beveled sides\n* Lighter Displacer Linkage: I used the same brass rod from the crankshaft for the displacer linkage. It was much too heavy. I am going to try the extreme other end of the spectrum with the next version; fishing line. This will both reduce reciprocating mass and address the next issue.\n* More Flexible Displacer Linkage: The displacer was tilting left and right due to the rigid linkage to the crankshaft. At the top and bottom of the displacement, this caused the displacer cylinder to bind up on the cylinder heads. I shortened the displacer stroke to solve the binding, but that prevented the displacer from reaching its extreme positions, reducing the efficiency of the heat cycle. A fishing line acting as a lifter-only linkage will allow the displacer to bottom out on the hot head without binding.\n* Lighter Power Piston: Two 1 1/4\" pan washers and a 1\" 1/4-20 machine screw are much heavier than this tiny power output needs. I am going to switch to plastic washers and a smaller, shorter screw -- maybe aluminum. The steel wire I used for the power linkage seemed about right, but I may look around for something a little lighter next time I'm at the hardware store.\n\n==== Summary ====\n\nOverall I am quite pleased with it. I would have liked the first version to run perfectly, of course, but hey, if it worked on the first try every time, it wouldn't be worthy to be called \"hacking.\" Such an elegant little machine, and it has been in the back of my mind for years. Nice to have done it, and I think the next one will be a significant improvement.\n<br clear=\"all\"/>\n\n== Process Notes ==\n\n=== Cut Sheet Steel Is Sharp ===\n\nCut sheet steel is sharp. Little slivers of cut sheet steel are sharp and nearly invisible.\n\nWhen cutting tuna cans with tin snips, if you back the snips out of the cut by even a little bit, or don't keep the blade intersection tight against the end of the cut when opening the jaws for the next snip, it is really easy to catch a hair of metal on one side of the existing cut -- which will create one of those sharp, nearly invisible slivers.\n\nTherefore, if you maintain constant gentle pressure holding the blade intersection against the end of the cut -- sliding the snips forward as you open the blades for the next snip -- you reduce your chance of getting an annoying metal sliver in your hand.\n\nGloves probably would have helped too. :)",
    "bytes": 6286
  },
  "revision_count": 40,
  "first_revision_timestamp": "2012-03-29T07:49:50Z",
  "is_redirect": false
}