{
  "title": "MediaWiki On Lightsail",
  "ns": 0,
  "id": 1286,
  "slug": "MediaWiki_On_Lightsail",
  "latest_revision": {
    "id": 4964,
    "timestamp": "2020-10-10T23:07:08Z",
    "contributor": {
      "username": "RobertBushman",
      "ip": null,
      "id": 713
    },
    "comment": "",
    "text": "This is intended to document how to install MedaiWiki on Lightsail. It's starting with notes on my attempts and has good intentions to mature into a proper tutorial.\n\n= To Do =\n\n* Document Lightsail Setup\n** SSH Login Key\n* Backup and Restore\n** Database Dump and Import\n** LocalSettings.php backup and import\n** Periodic Backup\n\n= Deploying on Lightsail Debian 10.5 =\n\nThis time around I'm going with a bare Debian 10.5 instance. I used 9.5 for the first pass, it only has PHP 7.0, which the latest version of MediaWiki won't run on. Debian 10.5 (which I don't recall seeing last time, I think it's new to Lightsail) comes with PHP 7.3, which will support the most current MediaWiki.\n\nI used the $5 instance with 1 GB RAM, 1 vcPU, 40 GB SSD, and 2 TB transfer. It's the best price/performance they offer at the moment; as you go to larger instances the price grows faster than the specs. If it can run on a $5 instance, I think it's the right call.\n\n== SSH Key ==\n\nTBD\n\n== Static IP Address ==\n\nWait for the Lightsail console to show that the instance is \"Running\" - it should only take a minute or two. Once the instance is up, assign it a static IP address. In the Lightsail console page on AWS, select your instance, and click on the Networking folder tab. Click on \"Create Static IP\". It will attach an IP from its pool to your instance, and you'll use that IP address for the DNS entries below.\n\nWhile you're at the Networking configuration, go to the Firewall section and add an entry for 443 (HTTPS).\n\n== OS Updates ==\n\nOnce it's fired up, login and update the OS:\n<pre>\n$ ssh -i <path/to/secret_ssh_key> admin@<ip_address>\n$ sudo apt update\n$ sudo apt dist-upgrade\n</pre>\n\n== DNS Entries ==\n\nAdd A records for each of the hostnames you want to create certificates for. I'm setting up traxel.com, www.traxel.com, and wiki.traxel.com, so I created 3 A Records all pointing to the same static IP address.\n\nNow wait for those records to cascade. It should be done in a day or two.\n\n== Apache ==\n\nLet's Encrypt creates files on your webserver, then hits the host with an HTTP request to confirm that you own the domain. Install Apache 2 so you can host the files.\n\n<pre>\n$ sudo apt install apache2\n</pre>\n\nThen you'll need a file like /etc/apache2/sites-available/003-wiki.conf for each of the hostnames. I pointed each one at a different directory, since I don't know if Let's Encrypt uses unique filenames. It probably does, but this guarantees it will work.\n\n<pre>\n<VirtualHost *:80>\n\tServerName wiki.traxel.com\n\n\tServerAdmin webmaster@localhost\n\tDocumentRoot /var/www/mediawiki\n\n\tErrorLog ${APACHE_LOG_DIR}/wiki-error.log\n\tCustomLog ${APACHE_LOG_DIR}/wiki-access.log combined\n</VirtualHost>\n</pre>\n\nAfter you create the conf files, activate them with a2ensite and disable 000-default with a2dissite (unless you're keeping that one active to cover the root hostname).\n\n<pre>\n$ sudo a2ensite 001-root\n$ sudo a2ensite 002-www\n$ sudo a2ensite 003-wiki\n$ sudo a2dissite 000-default\n$ sudo systemctl reload apache2\n</pre>\n\nFinally we'll need mod_rewrite - Let's Encrypt will create conf files that will redirect non-SSL traffic to HTTPS.\n\n<pre>\n$ sudo a2enmod rewrite\n$ sudo systemctl restart apache2\n</pre>\n\n== Let's Encrypt SSL Certificate ==\n\nLet's Encrypt will look at your active sites and ask you if you want to create certs for all of them.\n\nMake sure to use the \"Redirect\" setting so that any traffic arriving on port 80 gets redirected to the SSL port (443).\n\n<pre>\n$ sudo apt install certbot python3-certbot-apache\n$ sudo certbot --apache\n</pre>\n\nWow! OK, that was way easier than I was expecting. Sure, there's the setup that you have to do, but most of that would have to be done anyway just to get the webserver up. That is really awesome. I'll have to give the EFF a little extra this year.\n\n== MediaWiki Supporting Software ==\n\nFirst, the basics. You'll need all of these:\n\n<pre>\n$ sudo apt-get install mariadb-server php php-mysql libapache2-mod-php php-xml php-mbstring\n</pre>\n\nNext, the enhancements. These will give MediaWiki extra capabilities. See [https://www.mediawiki.org/wiki/Manual:Running_MediaWiki_on_Debian_or_Ubuntu#Optional_useful_packages Optional Packages]\n\n<pre>\n$ sudo apt-get install php-apcu php-intl imagemagick php-cli php-curl git\n</pre>\n\n== Configure PHP ==\n\nThere are a couple settings that are worth checking in PHP:\n<pre>\n$ cd /etc/php/7.3/apache2/\n$ grep memory_limit php.ini\n$ grep upload_max_filesize php.ini\n</pre>\n\n128 megs should be fine for memory.\n\nI'm torn on filesize. I'm trying to fit on a $5/mo machine with a 40 Gig HDD. Most things other than video for use on the web can be under 2 megs (the default size). I feel like the best answer may be a plugin to store large files in S3 at 1/4th the price. It's not a one-way-door, though. I'm leaving mine at 2 megs for now.\n\nMake sure the PHP plugins are enabled:\n\n<pre>\n$ sudo phpenmod apcu\n$ sudo phpenmod curl\n$ sudo phpenmod intl\n$ sudo phpenmod mbstring\n$ sudo phpenmod xml\n$ sudo systemctl restart apache2\n</pre>\n\n== Configure MariaDB ==\n\nIt's time to stop generically referring to MariaDB as MySQL. MySQL is a once-great project that is no longer trustworthy. MariaDB is the leading Open Source RDBMS.\n\nIf you haven't done anything with it yet, there will be no password.\n\n<pre>\n$ sudo mariadb -u root\n</pre>\n\nPick a username for MediaWiki to use (I'm using wiki_wiki as an example).\n\nPick a database name (I'm using hsl_wiki as an example).\n\nPick a password other than \"CHANGE THIS PASSWORD\".\n\n<pre>\nMariaDB> create database hsl_wiki;\nMariaDB> grant all on hsl_wiki.* to 'wiki_wiki'@'localhost' identified by 'CHANGE THIS PASSWORD';\nMariaDB> flush privileges;\n</pre>\n\nThen you can verify it worked if you like. (there won't be any tables, but it shouldn't give you an auth error)\n\n<pre>\n$ mariadb -u wiki_wiki -p\nMariaDB> show tables in hsl_wiki;\nMariaDB> exit\n</pre>\n\n== Download and Unpack MediaWiki ==\n\n<pre>\n$ cd\n$ mkdir tmp\n$ cd tmp\n$ wget https://releases.wikimedia.org/mediawiki/1.35/mediawiki-1.35.0.tar.gz\n$ tar -xvzf mediawiki-1.35.0.tar.gz\n$ mv mediawiki-1.35.0 /var/www/\n</pre>\n\n== Point Apache at MediaWiki ==\n\nNote that Let's Encrypt will have replicated your apache .conf file to an SSL version when you redirected traffic from 80 to 443.\n\n<pre>\n$ sudo emacs -nw /etc/apache2/sites-available/003-wiki-le-ssl.conf\n</pre>\n\nPoint your DocumentRoot at the mediawiki directory. It should look something like this:\n\n<pre>\n<IfModule mod_ssl.c>\n<VirtualHost *:443>\n\tServerName wiki.traxel.com\n\n\tServerAdmin webmaster@localhost\n\tDocumentRoot /var/www/mediawiki-1.35.0\n\n\tErrorLog ${APACHE_LOG_DIR}/wiki-error.log\n\tCustomLog ${APACHE_LOG_DIR}/wiki-access.log combined\n\n\tSSLCertificateFile /etc/letsencrypt/live/wiki.traxel.com/fullchain.pem\n\tSSLCertificateKeyFile /etc/letsencrypt/live/wiki.traxel.com/privkey.pem\n\tInclude /etc/letsencrypt/options-ssl-apache.conf\n</VirtualHost>\n</IfModule>\n</pre>\n\n== Configure MediaWiki ==\n\nWalk through the web interface to collect your settings. At the end, it will give you a LocalSettings.php file.\n\nSave the file locally, then upload it to your server and put it in the MediaWiki directory.\n\nAfter that, the wiki is ready to go. Hit it with your browser and away you go!\n\n\n== Backup & Recovery ==\n\nTBD\n\n== Migration from Older Versions ==\n\nTBD\n\n[[Category:Sysadmin Tutorials]]",
    "bytes": 7333
  },
  "revision_count": 53,
  "first_revision_timestamp": "2020-09-13T22:56:12Z",
  "is_redirect": false
}