{
  "title": "Model Aircraft",
  "ns": 0,
  "id": 200,
  "slug": "Model_Aircraft",
  "latest_revision": {
    "id": 1150,
    "timestamp": "2010-06-09T23:11:51Z",
    "contributor": {
      "username": "64.38.194.13",
      "ip": null,
      "id": 0
    },
    "comment": "Created page with 'For Phoenix: http://phoenix.gov/CITYCODE/ch024.html  Sec. 24-49. - Remote control aircraft.  A. No person may fly any remote controlled or self-propelled aircraft, including, but…'",
    "text": "For Phoenix:\nhttp://phoenix.gov/CITYCODE/ch024.html\n\nSec. 24-49. - Remote control aircraft.\n\nA. No person may fly any remote controlled or self-propelled aircraft, including, but not limited to, radio controlled or control line model airplanes, helicopters, and gliders, in a park or preserve except in parks designated by the Director or designee in flying sites that meet the requirements of Subsection C of this Section.\n\nB. In parks designated for operation of remote control aircraft, the Academy of Model Aeronautics (AMA) Safety Code is to be observed in flying radio-controlled or control line model airplanes, helicopters, and gliders. Persons flying radio controlled or control line model airplanes, helicopters, and gliders shall follow AMA guidelines and produce a current Academy of Model Aeronautics membership card. Only one remote control aircraft may be flown at a time.\n\nC. Flying sites shall at all times remain unobstructed and a safe distance away from other park users. Dimensions of flying sites shall be no less than 400 feet on all sides. For purposes of this Section, \"unobstructed\" means an open park area that is level and free of trees, structures, and fences, and that is fully accessible for the retrieval of launched aircraft.\n\nD. Children younger than 16 years of age shall be accompanied by an adult when flying model aircraft in City parks.\n\nE. Model aircraft that exceed any of the specifications listed below may only be flown in City parks or preserves where there is a specifically developed model aircraft flying site with spectator control fencing, established runways, flight pads or flying circles, and safety barriers for the protection of pilots and callers.\n\n1. Fueled radio controlled model airplanes with an engine size of .20 cubic inches, wingspan of 60 inches, or weight of 3 pounds.\n\n2. Electric powered radio controlled model airplanes with a wingspan of 80 inches or weight of 3 pounds.\n\n3. Radio controlled helicopters with a main blade diameter of 40 inches or a weight of 3 pounds.\n\n4. Radio controlled gliders with a wingspan of 80 inches or weight of 3 pounds.\n\n5. Control line model airplanes with a single engine size of .25 cubic inches",
    "bytes": 2198
  },
  "revision_count": 1,
  "first_revision_timestamp": "2010-06-09T23:11:51Z",
  "is_redirect": false
}