{
  "title": "Model Rockets",
  "ns": 0,
  "id": 199,
  "slug": "Model_Rockets",
  "latest_revision": {
    "id": 1155,
    "timestamp": "2010-06-09T23:15:05Z",
    "contributor": {
      "username": "64.38.194.13",
      "ip": null,
      "id": 0
    },
    "comment": "",
    "text": "*'''Chandler'''\n**Mesquite Grove Park\n***Riggs and Val Vista\n***only park where you are allowed to shoot off model rockets.\n***You must make a special request 10 days prior to the event\n***pick up the permit at the Tumbleweed Recreation Area or at the Parks and Recreation office\n*'''Gilbert'''\n**Crossroads Park\n***A,B,C & D engines allowed.\n***Must have a 100-500ft clearance from ANYTHING\n**McQueen Park\n***A & B Engines only\n***100-200ft clearance\n**Freestone Park\n***A,B,C & D engines allowed.\n***Must have a 100-500ft clearance from anything\n\nAt all places you must have a Ranger approve of your launch site\n\nYou can pick up an information sheet for model rockets at the Parks & Rec office at building 90.  I guess it gives you all necessary information.\n\n\n\nFor Phoenix: http://phoenix.gov/CITYCODE/ch024.html\n\nSec. 24-49.1 - Model rockets\nA. No person may use any model rocket in a park or preserve except in parks designated by the Director or his or her designee in launch sites that meet the requirements of Subsection C of this Section.\n\nB. Persons using model rockets in a designated park shall observe and abide by the National Association of Rocketry Safety Code and Safety Zone Requirements. Rockets shall not be launched in unsafe weather conditions or when wind speeds are greater than 20 miles per hour.\n\nC. Launch sites shall be unobstructed and a safe distance from other park users. For purposes of this Section, \"unobstructed\" means an open park area that is level, free of trees, structures and fences, and is fully accessible for retrieval of launched equipment. Dimensions shall be no less than 400 feet on all sides.\n\nD. Only rocket engines sizes \"A\" or \"B\" are permitted. Rocket engine size \"C\" and larger are prohibited from launching in parks.\n\nE. Children younger than 16 years of age shall be accompanied by an adult when launching model rockets in parks.",
    "bytes": 1886
  },
  "revision_count": 7,
  "first_revision_timestamp": "2010-06-09T23:10:35Z",
  "is_redirect": false
}