{
  "title": "Nearspace Balloon 2",
  "ns": 0,
  "id": 144,
  "slug": "Nearspace_Balloon_2",
  "latest_revision": {
    "id": 1975,
    "timestamp": "2011-02-21T23:33:12Z",
    "contributor": {
      "username": "64.88.170.40",
      "ip": null,
      "id": 0
    },
    "comment": "/* Camera */",
    "text": "==Team Members==\n{| border=\"1\"\n!Name\n!Email\n|-\n|Rick O\n|ricko@heatsynclabs.org\n|-\n|David H\n|huertanix@heatsynclabs.org\n|-\n|Paul H\n|paulhickey@gmail.com\n|-\n|Will B\n|will@heatsynclabs.org\n|-\n|Nate P\n|nate@coffeebot.net\n|-\n|Bobby M\n|bwmetz@gmail.com\n|-\n|}\n\n==Synopsis==\nThis project will involve sending a weather balloon into near space.  Near space is typically considered to be above 65,000 feet above sea level.  A near space balloon typically consists of the following major components:\n#Balloon + helium (duh)\n#GPS for tracking the balloon\n#One way radio communication\n##This is for sending us the GPS coordinates\n#Camera on a timer\n##Must take pictures every X minutes and have enough space to store them all\n#Flight computer\n##This coordinates all of the other parts and makes them work together\n#Batteries\n##Need to handle extreme cold and last long enough for the flight and for you to find it\n#Weatherproof container\n##This must keep out the cold as much as possible\n##Needs a hole for the camera to take pictures through\n##Must be able to open, but latch it shut securely\n##The electronics must be secured inside somehow\n##Balloon has to attach to this, but be able to release somehow after it pops.\n#Parachute\n##This slows the balloon down so it doesn't slam into the ground at terminal velocity, but it's not huge enough that it takes forever for the payload to return to earth.\n\n==Balloon==\n===Components===\n====Balloon and Helium====\nPurchase balloons most likely on line.  Rent helium tanks locally. May need to put a hefty deposit on the tanks.\n\n====GPS====\nBlackjack II cell phone has a built-in GPS.  We can use the free software Mologogo to track the phone.\n\n====Radio====\nBlackjack II cell phone IS a radio.  It even has two way radio capabilities.  Mologogo can use the phone's data network to send the phone's GPS coordinates back to a website.  We can then track the balloon by browsing to this website with other cell phones or cell phone enabled laptops.\n\n====Camera====\nWe can potentially use a used or donated digital camera.  Some of these have built in time-lapse functions.  If we can't find one that does, we can build a simple timer circuit to push the shutter button every few minutes.  We may also be able to write an app for the Blackjack II cell phone to use the phone's built-in camera.\n\n====Flight Computer====\nPaul has a Blackjack II cell phone he is willing to donate to this project.  The phone has the capabilities to be our computer, GPS, radio, and possibly our camera\n\n====Batteries====\nThe cell phone already has a battery.  If this battery is in good condition it may be sufficient to provide enough power in the cold weather for the length of the mission.  It may be a good idea to construct an external battery pack for the phone.  The pack can hook up to the phone via it's charging port.  This will allow us to drain the external batteries before switching to the phone battery as a backup.\n\n====Weatherproof container====\nCan use a styrofoam cooler with insulation.  Other's have also used insulated lunch boxes.  We can also construct something from scratch if we want.\n\n====Parachute====\nCan purchase or construct from scratch\n\n==Pricing==\nActual Cost is how much we actually pay for an item.  In some cases an item may be donated to us, but the competition states that all items must have a price associated with them.  In that case, we must find the donated item for sale somewhere, and record that price in the \"Recorded cost\" column.\n\n====Cell Phone Balloon====\n\n{| border=\"1\"\n!Item\n!Quantity\n!Actual Cost\n!Total\n!Recorded Cost\n!Source\n|-\n|1200 Gram Balloon\n|2\n|$45 est\n|$90\n|$45\n|http://www.kaymont.com/pages/cold-weather-balloons.cfm\n|-\n|55CF Helium\n|1\n|$38.50 \n|$38.50 \n|$38.50 \n|http://www.azairboutique.com/index.php?option=com_content&view=article&id=52&Itemid=71\n|-\n|Cell Phone\n|1\n|0\n|0\n|$40\n|Paul R\n|-\n|GoPhone (For the prepaid sim card)\n|1\n|$30\n|$30\n|$30\n|http://tinyurl.com/y9yxpe3\n|-\n|Cell Phone Antenna\n|1\n|$12\n|$12\n|$12\n|http://www.primecellular.com/CM200\n|-\n|Digital Camera\n|1\n|0\n|0\n|?\n|http://tinyurl.com/ydynpk2\n|-\n|Lunchbox\n|1\n|$10\n|$10\n|$10\n|http://tinyurl.com/y85dl4y\n|-\n|Parachute\n|1\n|$25\n|$25\n|$25\n|http://rocketchutes.com/\n|}\n\n====Ham Radio Balloon====\n\n{| border=\"1\"\n!Item\n!Quantity\n!Actual Cost\n!Total\n!Recorded Cost\n!Source\n|-\n|1200 Gram Balloon\n|2\n|$45 est\n|$90\n|$45\n|http://www.kaymont.com/pages/cold-weather-balloons.cfm\n|-\n|55CF Helium\n|1\n|$38.50 \n|$38.50 \n|$38.50 \n|http://www.azairboutique.com/index.php?option=com_content&view=article&id=52&Itemid=71\n|-\n|Radio\n|1\n|$40-$50est\n|$40-$50est\n|$40-$50est\n|ebay.com (Search \"Realistic HTX-202\")\n|-\n|TNC\n|1\n|0\n|0\n|$33\n|http://www.byonics.com/tinytrak/\n|-\n|GPS\n|1\n|\n|\n|\n|\n|-\n|Digital Camera\n|1\n|0\n|0\n|?\n|http://tinyurl.com/ydynpk2\n|-\n|Lunchbox\n|1\n|$10\n|$10\n|$10\n|http://tinyurl.com/y85dl4y\n|-\n|Parachute\n|1\n|$25\n|$25\n|$25\n|http://rocketchutes.com/\n|}\n\n==Ideas==\n#High Altitude Rendevous\n#* Collaborate with another nearby hackerspace to launch balloons simultaneously.  These balloons should communicate with each other somehow.\n#Live Video\n#* Use a video transmitter to send live video to ourselves on the ground\n#* http://www.mfjenterprises.com/Product.php?productid=MFJ-8704\n#TCP/IP via Radio\n#*http://www.febo.com/hamdocs/intronos.html\n#Balloon Wargames\n#*Combined with the TCP/IP idea we could host \"hacker wargames\" on our balloon.\n#*A simple idea is to host a text-only web page (or something similar) that has a button and a text box.  The user enters their hackerspace name in the box and clicks the button.  When this button is clicked the user \"owns\" the web page and their hackerspace name is displayed.  Other teams must access the page and click the button to steal ownership.  The last team to own the page before the balloon lands/pops wins.\n#Barometer\n#Panoramic Video/Photos\n\n\n==Press==\nWe had the crazy idea of inviting [http://www.local-motors.com Local Motors] and their [http://www.local-motors.com/rallyFighter.php Rally Fighter] out to be our lead chase vehicle.  It sounds like they're willing to mount whatever gear we need and have the ports to power it.  Sadly we gave them short notice for the first launch.  It is advised to contact them ahead of time for this launch!\n\n\n==See Also==\n[[Nearspace Balloon]]",
    "bytes": 6266
  },
  "revision_count": 14,
  "first_revision_timestamp": "2010-02-22T15:37:43Z",
  "is_redirect": false
}