{
  "title": "Nearspace Balloon",
  "ns": 0,
  "id": 138,
  "slug": "Nearspace_Balloon",
  "latest_revision": {
    "id": 1428,
    "timestamp": "2010-10-26T02:34:25Z",
    "contributor": {
      "username": "68.3.33.180",
      "ip": null,
      "id": 0
    },
    "comment": "/* Camera */",
    "text": "==Team Members==\n{| border=\"1\"\n!Name\n!Email\n|-\n|Rick O\n|ricko@heatsynclabs.org\n|-\n|David H\n|huertanix@heatsynclabs.org\n|-\n|Paul H\n|paulhickey@gmail.com\n|-\n|Will B\n|bradley.will@gmail.com\n|-\n|Nate P\n|nate@coffeebot.net\n|-\n|Bobby M\n|bwmetz@gmail.com\n|-\n|}\n\n==Launch Procedure==\nThis is a check list of final tasks, supplies and duties.\nSome tasks are not assigned but they still need to be finished by Friday night.\nI put myself down for a lot of the launch supplies but that’s only because I’m making the list and know I have this stuff.\nLaunch duties can be reassigned as need but should be finalized by Friday night.\n \n \n'''Tasks to do before launch date:'''\n*Make and affix labels to payload box, inside and out (???)\n*Finish parachute (???)\n*Add key rings and swivels to top and bottom of parachute (???)\n*Check batteries levels and if low replace or charge (Rick & Jasper)\n*Download maps of all possible flight projections and put on laptop (Rick)\n*Collect cell phone numbers for chase vehicles and all radio call signs (Rick)\n*Collect chase vehicle descriptions and plate numbers (Rick)\n*Finalize the launch site based on weather prediction and flight plan software (Rick)\n \n'''Check off list of supplies to bring on launch date:'''\n*Water, flashlights and food/snacks incase we have a long search (Each Person)\n*Full tanks of gas (Each Person taking a chase vehicle)\n*Bring extra 1.5v AA and AAA batteries (Rick)\n*Balloon (Paul)\n*Payload and below content (Rick)\n*Camera\n**Camera batteries\n*Radio\n**Radio batteries\n*Antenna (both)\n*GPS\n*Tinytrak\n*iPod batteries (powers GPS and Tinytrak)\n*Buzzer\n**9v battery\n*Key rings for connectors\n*Swivels\n*Wing nuts, washers and cotter keys to assemble and hang payload box.\n*Gloves to handle balloon, already in box (Paul)\n*5lb jug of water with string and hanger (Todd)\n**(Payload + string + parachute + 1lb free lift)\n*(3.5lbs + 0.5lbs + 1lb) = 5lb\n*Extra heavy weight to anchor balloon during filling (Todd)\n*Helium tank (Todd)\n*Hose with tank and balloon adapters (Todd)\n*Wrenches to connect adapter to tank (Todd)\n*Blue Traps (Todd)\n*Blankets (Todd)\n*Knife to cut string (Paul)\n*Ear plugs for people assigned to holding payload and parachute for deployment. (Todd)\n*Duct Tape (Todd)\n*Zip ties about 6 inches or longer (Todd)\n*Small wire cutter to cut zip ties (Todd)\n*Todd’s hand held and GPS and car GPS unites (Todd)\n**Make sure both are fully charged. (Todd)\n**Car antenna for Todd’s GPS (Todd)\n**Car chargers for both of Todd’s GPS units (Todd)\n*Tracking receiving radio (Rick)\n**Modem (Rick) Europe\n**Magnet mount antenna for car (Rick)\n**12v power plug splitter (Todd)\n**Data line for Todd’s GPS to Todd’s backup laptop (Todd)\n**Serial to USB for Todd’s backup GPS and backup laptop (Todd)\n*2 Laptops with software to display tracking on maps (Rick & Todd)\n**2 power inverters (Todd & Zack P.)\n**Topo map CD-ROMs of AZ (Todd)\n \n \n'''Launch Duties:'''\n*At 5am recalc the flight prediction and maybe change to alternate launch site (Rick):\n*Avoid urban areas\n*Avoid lakes\n*Avoid airports\n*Avoid mountains\n*Avoid military bases\n*Avoid inaccessible terrain.\n*Exchange cell phone numbers and radio call signs (Everybody!)\n*Make sure above check off list is … well… checked off.\n*Drive to launch location (Everyone)\n*Layout tarps and blankets (Zack P. & Nathanael)\n*Put on gloves and layout balloon (Paul)\n*Payload + parachute + balloon assembly: (Nathanael & Paul)\n*Cut the OEM balloon string about 1/3 from bottom.\n*Tie balloon’s string to swivel at top of parachute.\n*Tie remaining string between parachute and swivel at payload.\n*3 members to wear gloves and guard balloon from tipping over during filling\n*(?+?+?)\n*Tie balloon to extra heavy weight to prevent accidental release while filling (Nathanael)\n*Fill balloon: (Todd, Rick & Nathanael)\n**Rick puts on gloves and holds fill tube in balloon’s neck.\n*Zip tie balloon neck to PVC pipe (Nathanael)\n**Todd controls helium flow.\n*Validate we have 1lb of free lift using jug of water (Nathanael)\n*Cut zip tie on balloon neck (Nathanael)\n*Cork balloon (Paul & Nathanael)\n*Fold over end\n*Zip tie to secure\n*Cover with duct tape.\n*Turn on radio and tinytrak (Rick)\n*Validate payload transmission and reception (Rick)\n*Turn on camera (John)\n*Turn on sound beacon (John)\n*Check that all items in payload are on and secured (Paul)\n*Test wind direction (Zack P.)\n*Seal up payload box and hold for deploy (Zack P.)\n*Hold parachute for deploy (Paul)\n*Release balloon on mark (Nathanael)\n*Take photos and film launch (John + anybody else)\n\n==Tasks==\n{| border=\"1\"\n!Task\n!Name\n!Completed?\n|-\n|Balloon\n|Paul H\n|No\n|-\n|Camera\n|John K\n|Yes\n|-\n|Helium\n|Paul H\n|Yes\n|-\n|Parachute\n|Casey D\n|No\n|-\n|Container\n|Rick O / Bobby / Nate\n|No\n|-\n|Radio\n|Rick O\n|No\n|-\n|GPS\n|Zach\n|Yes\n|-\n|Buzzer\n|John K\n|Yes\n|-\n|Camera timer\n|John K\n|Yes\n|}\n\n==Synopsis==\nThis project will involve sending a weather balloon into near space.  Near space is typically considered to be above 65,000 feet above sea level.  A near space balloon typically consists of the following major components:\n#Balloon + helium (duh)\n#GPS for tracking the balloon\n#One way radio communication\n##This is for sending us the GPS coordinates\n#Camera on a timer\n##Must take pictures every X minutes and have enough space to store them all\n#Flight computer\n##This coordinates all of the other parts and makes them work together\n#Batteries\n##Need to handle extreme cold and last long enough for the flight and for you to find it\n#Weatherproof container\n##This must keep out the cold as much as possible\n##Needs a hole for the camera to take pictures through\n##Must be able to open, but latch it shut securely\n##The electronics must be secured inside somehow\n##Balloon has to attach to this, but be able to release somehow after it pops.\n#Parachute\n##This slows the balloon down so it doesn't slam into the ground at terminal velocity, but it's not huge enough that it takes forever for the payload to return to earth.\n\n==Balloon==\n===Components===\n====Balloon and Helium====\nPurchase balloons most likely on line.  Rent helium tanks locally. May need to put a hefty deposit on the tanks.\n\n====GPS====\nZach's hacked Palm GPS mapper.  Outputs serial data which should work great for the TinyTrak and fits into an Altoids tin.\n\n====Radio====\nRadioShack Realistic HTX-202.  It's a pretty rugged hand held radio.  It has a BNC connector which will allow us to easily add an external antenna.  The rechargeable battery is shot but the radio can be powered externally by a separate battery pack.  The radio is capable of 2-meter transmission only, but that should work just fine and includes the APRS frequency.  Maximum output power is 5 watts which should be sufficient with an external antenna.  http://www.eham.net/reviews/detail/1296\n\n====Camera====\nThe camera that was flown on the mission was a Canon PowerShot A570is containing a 4GB SD card. The firmware had been replaced with the [http://chdk.wikia.com/wiki/CHDK CHDK] variant called SDM [http://stereo.jpn.org/eng/sdm/index.htm Stereo Data Maker] to allow for both video and still images to be taken during the flight.\nThe code used in the camera can be found here: [http://www.teamdroid.com/Astro1.bas Astro1.bas]\n\n====Flight Computer====\nI have a TinyTrak3 that can be used to take serial GPS data and send it out of the radio automatically.\n\n====Batteries====\nThe cell phone already has a battery.  If this battery is in good condition it may be sufficient to provide enough power in the cold weather for the length of the mission.  It may be a good idea to construct an external battery pack for the phone.  The pack can hook up to the phone via it's charging port.  This will allow us to drain the external batteries before switching to the phone battery as a backup.\n\n====Chassis====\nCan use a styrofoam cooler with insulation.  Other's have also used insulated lunch boxes.  We can also construct something from scratch if we want.\n\n====Parachute====\nCan purchase or construct from scratch\n\n==Launch Site==\n* Grabbed this info from UAT's nearspace wiki: http://nearspace.0x58.com/index.php?title=Launch_Sites\n\n===Primary===\n<div style=\"float:right\">\n<googlemap version=\"0.9\" lat=\"32.84503\" lon=\"-112.31748\" type=\"terrain\" width=\"400\" height=\"400\" selector=\"no\" controls=\"small\">32.84503, -112.31748Primary Launch Site</googlemap>\n</div>\n*Launch Site 1\n**Cord (decimal):    32.84503 by -112.31748 at 1801.2ft MSL\n**Cord (deg/minute): 32° 50' 42.108\" N by 112° 19' 2.928\" W at 1801.2ft MSL\n\n<div style=\"clear: both\"> </div>\n\n===Secondary===\n<div style=\"float:right\">\n<googlemap version=\"0.9\" lat=\"32.69635\" lon=\"-111.49202\" type=\"terrain\" width=\"400\" height=\"400\" selector=\"no\" controls=\"small\">\n32.69635, -111.49202\n</googlemap>\n</div>\n*Launch Site 2\n**Cord (decimal):    32.69635 by -111.49202 at 1630.6ft MSL\n**Cord (deg/minute): 32° 41' 46.86\" N by 111° 29' 31.2714\" W at 1801.2ft MSL\n\nThe closest major airport is Eloy Municipal with is about 9 miles to the NW.\n\n<div style=\"clear: both\"> </div>\n\n===Tertiary===\n<div style=\"float:right\">\n<googlemap version=\"0.9\" lat=\"33.11829\" lon=\"-111.389267\" type=\"terrain\" width=\"400\" height=\"400\" selector=\"no\" controls=\"small\">\n33.11829,-111.389267\n</googlemap>\n</div>\n*Launch Site 3\n**Cord (decimal):    33.11829 by -111.389267 at 1621ft\n\n<div style=\"clear: both\"> </div>\n\n==Pricing==\nActual Cost is how much we actually pay for an item.  In some cases an item may be donated to us, but the competition states that all items must have a price associated with them.  In that case, we must find the donated item for sale somewhere, and record that price in the \"Recorded cost\" column.\n\n====Ham Radio Balloon====\n\n{| border=\"1\"\n!Item\n!Quantity\n!Actual Cost\n!Total\n!Recorded Cost\n!Source\n|-\n|1200 Gram Balloon\n|2\n|$45 est\n|$90\n|$45\n|http://www.kaymont.com/pages/cold-weather-balloons.cfm\n|-\n|90CF Helium\n|1\n|$40.00 + $100 deposit\n|$40.00\n|$40.00\n|http://www.azfunparty.com/helium.html\n|-\n|Radio\n|1\n|$0\n|$0\n|$40-$50est\n|ebay.com (Search \"Realistic HTX-202\")\n|-\n|TNC\n|1\n|$0\n|$0\n|$33\n|http://www.byonics.com/tinytrak/\n|-\n|GPS\n|1\n|$0\n|$0\n|$15\n|\n|-\n|Digital Camera\n|1\n|$0\n|$0\n|?\n|http://tinyurl.com/ydynpk2\n|-\n|Chassis\n|1\n|$7-8\n|$7-8\n|$7\n|http://bit.ly/dipcOI (DAP Spray Foam)\n|-\n|Parachute\n|1\n|$25\n|$25\n|$25\n|http://rocketchutes.com/\n|}\n\n==Competition==\n===Rules===\n*One team per hackerspace. Any size build team, but only 10 people for the launch and retrieval team.\n*Payload must be under 4 pounds.\n*Parts cost limit of $250.00. Must show receipts or have other proof of purchase.\n*Payload must return with pictures taken from the flight.\n*Only one official launch per team allowed. Notice of official launches must be given by 8 a.m., and a judge must be present for the launch to count.\n*All local laws and ordinances must be followed throughout the entire competition.\n*The Event Board may judge any other conduct considered outside “the spirit” of the event and disqualify a team that does not adhere to it by majority vote.\n\n===Scoring===\n*Retrieval Time Base: 50 points. 1 point off for every minute past 45 minutes.\n*Weight of Payload 5 points added for every 1/2 pound under 4 lb.\n*Cost of Setup Base: 50 points. 0.5 points off for every dollar over $150.\n*Total Points Base 100 + 5 per each -1/2 pound.\n\n===Judging===\n*Judges are members of each hackerspace, and will be submitted to the Event Board. They will ensure all rules are followed.\n*One person from each hackerspace will be on the Event Board. The Event Board will oversee the event, judge each applicant, and declare winners.\n\n===Dates===\n*Competition starts immediately upon challenges going out.\n*Teams will indicate acceptance of challenge by March 1, 2010 (at workshop88.com/space).\n*Launches will be held between June 1, 2010 and August 31, 2010.\n*Results of the official launch must be sent in by September 7, 2010.\n*Winner will be announce on or before September 30, 2010.\n\n==Checklist==\n-Radio\nWhere are we on the radio?  Have we been able to successfully communicate to the repeaters and see it online?  Are we using another radio?\n\n-Cold Test\nCold testing with dry ice to make sure the electronics and batteries won't fail\n\n-Mounting rig for the module to the balloon\nRick and I have talked about it, and we discussed it last night and it seems to be the consensus that it would be best if we got a metal tube and put either a metal plate or giant washer at the bottom of it, and run the length of pipe through the module, then attach that pipe to the balloon using an eye-hook or a swivel.\n\n-Parachute\nOnce we finish designing the mounting rig, we will have the final weight and size of the module so Casey can work on the parachute.\n\n-Calculate balloon parameters\nFind out the bursting diameter/altitude, ascension speed, helium required, etc, etc\n\n-Create flight checklist\nI think we should just create the flight checklist on the wiki.  It looks like you don't even have to login to make changes, so anyone can add to it\n\n-Other\nMaterials checklist for tarps, gloves, charge batteries, hand warmers, weights, etc\n\n-Launch predictions\n\n-LAUNCH\n\n==See Also==\n[[Nearspace Balloon 2]]",
    "bytes": 13138
  },
  "revision_count": 70,
  "first_revision_timestamp": "2010-02-12T02:54:24Z",
  "is_redirect": false
}