{
  "title": "New to HeatSync Labs?",
  "ns": 0,
  "id": 1160,
  "slug": "New_to_HeatSync_Labs",
  "latest_revision": {
    "id": 6799,
    "timestamp": "2026-01-12T01:14:29Z",
    "contributor": {
      "username": "Jaymcgavren",
      "ip": null,
      "id": 731
    },
    "comment": "Re-use FAQ page map",
    "text": "==What is HeatSync Labs?==\n\nEstablished in 2009, HeatSync Labs is Arizona's first 501(c)3 [https://en.wikipedia.org/wiki/Hackerspace hackerspace]. We are a community workshop that makes workspace, tools, and other resources available to students and hobbyists, artists, engineers and entrepreneurs to build their projects, prototypes, and art. We believe in creating a community of collaboration and learning-by-doing.\n\nThe concept for HeatSync Labs came out of the desire for a group of Arizona locals to get together and continue working on projects after academic life. Instead of working alone, we wanted to build our workshops in public. Throughout 2009, we discovered, and in some cases, visited, other notable 'hackerspaces' popping up across the country ([https://noisebridge.net/ NoiseBridge], [http://pumpingstationone.org/ Pumping Station: One], [https://www.nycresistor.com/ NYC Resistor], [https://hacklab.to/ Hacklab Toronto], and [http://hacdc.org/ HacDC]) and wondered what was holding us back.  We decided to join in on the fun.\n\n==Visiting the lab==\n\nWe are at [https://goo.gl/maps/5oo83 108 W Main St] in downtown Mesa.\n\nThere are several free public parking lots available nearby, including the \"Green Lot\" across North MacDonald.\n\n[[File:HSL_Parking.png|500px]]\n\n==Getting started==\n*Be sure to fill out a [https://forms.gle/zss1bJSN7ocKQudz6 waiver]\n*If you want to donate [[Membership_Guidelines#Membership_Guidelines | memberships]] are an option\n*Here's a direct link to [https://members.heatsynclabs.org/users/sign_up member sign up]\n*Regardless of membership come to [[Hack Your Hackerspace]] (HYH) and get an orientation\n*If you can't make HYH read through the [[Walk Through Orientation]] page\n*As soon as you are a paying member you can ask any current member for help getting a box or your locker set up\n\n==How HeatSync Labs works==\nYou are as in charge as anyone else. By coming down, or visiting virtually, you are an empowered community member. It is up to you to get stuff done. If you think there should be a better process/tool/space, make one/buy one/find one. It helps to voice your idea to find like minded individuals in the community to help implement it, but the power is in you. Do it. If it sound dangerous, consult with others at the lab. If you think others will have an opinion about what you want to do, communicate. In the end though, if you care about it, it is up to you to make it happen.\n\n==Inside the Lab==\nBecause Heatsync Labs is a community, as well as a non-profit, when you visit the physical location, you are likely to be met with the chaos that happens as people get things done. The Lab is mostly a place to go and work on things. There is no paid staff, there is no one whose job it is to sit and greet people coming in the door (front or back). There is a [[Hosting | host]], a person who has opened the lab to the public. They may sometimes wear a captain's hat, but mostly they look like everyone else there, working on some project, or talking to some other new person who beat you in the door by a few minutes. \n\nA word of advice - Be brave and talk to people. The reason there is a lab, and not a giant tool share is because we all have a desire to be around people interested in what we are interested in. You may find that with a question or two about what someone is working on, that you have met someone with a common skill set. Or someone that has the interest in sharing their knowledge so that others can learn. Or just a tinkerer working on their most current idea. Unfortunately, there are rude people, but most are nice people that really are too busy to chat. Don't take offense, ask someone else. Remember a time when you were working on a cool thing and got asked a question when you just needed to get this last thing done. That is probably what was going on.\n\n==Joining In==\nHeatsync Labs is operated by volunteers. We are people just like you who visited the lab, thought it was neat, liked the people we met, and started helping out. It's awesome! HeatSync Labs is a place where you get to help people learn about tools and turn their dreams into reality, while spending time with other people who think that is a good idea.\n\nThere are lots of ways to help. You can assist with one of our classes, [[Hosting | hosting and co-hosting]] open hours,  work on improving the workstations, be here and help create a positive social vibe, become an instructor and teach a class, help with bookkeeping and administration, write instructional docs, or post sections like this on the wiki. I'm doing it right now. :)\n\nThose are just examples. Ask around and find out what else you can help with. Or come up with your own ideas and bring them up at [[Hack Your Hackerspace]]. We want to help you find a fulfilling path here at HeatSync Labs.\n\nTo learn more take a look at our wiki page on [[Joining_In]].\n\n==Stuff at the Lab==\nThe lab is filled with tools to make magic happen. Most of the non-tool contents of the lab is someone's project. There are all kinds of undocumented, half completed things. You may not be able to tell apart the tear-down bin from someones latest prototype. The best way to approach this is to ask questions. The people at the lab will have some knowledge, but maybe not the specifics. Ask questions and look for answers and you will find them.\n\n==Not at the Lab==\nThe community has many other venues, the website, this wiki, a google group, slack, a controversial facebook page, twitter account, Flickr, GitHub repo and many others. If you want to learn more, try one or more. Pick your favorite flavor and reach out. There is always something going on.\n\n==More Questions?==\nIf you have more questions, see the [[Faq|FAQ]]",
    "bytes": 5727
  },
  "revision_count": 19,
  "first_revision_timestamp": "2014-04-27T03:19:59Z",
  "is_redirect": false
}