{
  "title": "Open Hours",
  "ns": 0,
  "id": 1146,
  "slug": "Open_Hours",
  "latest_revision": {
    "id": 5602,
    "timestamp": "2023-08-12T20:52:42Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "/* What is available during open hours */",
    "text": "==Open Hours - Meaning for the Public==\n===When we say \"we are open\" we mean===\nWe have posted open hours on our website. This is our minimum goal. It maybe (hopefully very rarely) that during the posted hours, we don't have a host arriving as needed. You can always see if the doors are unlocked on the main page of our website as well.\n\n===What is available during open hours===\nAll tools are available for use during open hours. Many of the larger tools require an orientation/training class in order to use it. Tools like the laser cutter, mill, lathe, welding tools, and many of the others have official classes periodically to train and go over proper safety when using those tools. Once you have take a qualifying course, or worked with the champion of the area enough to win approval, you may use the tools during hours where a card holder has sponsored you (which includes open hours). It is best to come down and find out what is going on with the community before planning to use any of the large tools for projects that will require more that a few minutes to work on.\n\n==Open Hours - Meaning for the Host==\nHere are more ideas about [[Hosting]] and [[Hosting#Co-Hosting | Co-Hosting]].\n\nIn general hosting an open hours means: being there on time (or earlier) and leaving on time (or later - no earlier, unless somebody else covers it for you). It also means sitting somewhere near the front of the lab, and helping anybody that comes in. You are responsible to and represent the community for those that come in when you open to the public. Be excellent to them. Help them learn the guidelines that allow HSL to make these awesome tools available to the public. Verify training and waiver signatures for anyone using tools that require training. By helping them follow the order the community has setup, you help them join the community and protect HSL from the results of situations gone wrong.",
    "bytes": 1909
  },
  "revision_count": 7,
  "first_revision_timestamp": "2014-01-22T01:50:12Z",
  "is_redirect": false
}