{
  "title": "PCB Etching",
  "ns": 0,
  "id": 128,
  "slug": "PCB_Etching",
  "latest_revision": {
    "id": 4762,
    "timestamp": "2020-07-19T20:40:30Z",
    "contributor": {
      "username": "CrazyBlackStone",
      "ip": null,
      "id": 711
    },
    "comment": "/* Internet */",
    "text": "==Professional Options==\n\n=== Local ===\n* [[Local Resources#Electronics|Avanti Circuits]] - located in North Phoenix. You have to buy a full board apx 18in x 24in for a few hundred dollars, but it's completely panelizable and customizable, they work for your business and will do rapid turnaround or weird requests. Go in on it with some friends.\n\n=== Internet ===\n* [http://batchpcb.com/ BatchPCB] for fairly quackish and cheap turnaround - 1 month\n* [http://www.seeedstudio.com/depot/fusion-pcb-service-p-835.html?cPath=185 Seedstudio Fusion PCB] for qty10, relatively cheap for small sizes. 2-5 week turnaround typical.\n* [http://dirtypcbs.com/ Dirty PCBs] done dirt cheap (dubious quality)\n\notherwise find a deal with the big boys\n* [http://4pcb.com Advanced PCB] has 2 layer 33 each at 33each.com (min 4+1free comes to like 150 shipped) a and they have a decent system for checking your design at freedfm.com\n\nOne problem you should already have noticed is these places have 100 domains so its hard to know if you're dealing with the same shop.\n\nCheap Chinese PCB fab houses - they make surprisingly good PCBs for the price and have SMT assembly services, but shipping takes a while. Though they have really fast turnaround time (24hrs) compared to American PCB fab houses.\n* https://jlcpcb.com $2 for 5 pieces of 100mmx100mm maximum size, shipping not included\n* https://www.pcbway.com/ $5 for 5 pieces, shipping not included (you get a lot more customization options compared to JLCPCB)\n\nhaven't tried them but\n* http://www.goldphoenixpcb.biz\n* http://www.expresspcb.com/ExpressPCBHtm/HowWorks.htm\n* http://www.sunstone.com/QuoteQT.aspx (pcbexpress, pcb123)\n* http://www.batesquote.com\n* https://www.7pcb.com\n\nsome good but perhaps outdated info from ladyada\n* http://www.ladyada.net/library/pcb/manufacturers.html\n\n==Homebrew==\nThere are several options for home etching, but they all boil down to covering up the copper you DON'T want to take off, and bathing the rest in acid.\n\n*[[PCBLaserEtch]] - using paint and a laser engraver\n*photo resist - using light to affix your pattern\n*heat transfer - using heat\n*permanent marker - yep sharpie will resist etching, too\n\n===Design===\n*spacing: 10-12mil \n*route: 5-10mil\n*Adjust routing and/or footprints as necessary.\n\n===Laser Process===\nSee also: [[Stencil Etching]] -- for solder stencils.\n\n* Single-sided only unless you're very handy with a jig. This means single-sided copper board, too, unless you feel like wasting a bunch of FeCl/time trying to get rid of a whole side of copper to avoid shorting out the whole board.\n* Spray paint the copper with an even, not-goopy coat of matte spray paint. Let dry for awhile and then put on a second layer for best results. Glossy paint is somewhat elastic and will \"curl\" under the laser producing imprecise results.\n* Make sure your image is mirrored so you end up etching your circuit \"on the back\" -- in other words, if you put all your traces and pads on the top layer without mirroring and then etch the board, you're going to have a hard time soldering your components on the top side, fitting your soldering iron in between the component and its tiny little lead. So just mirror it and solder on the back like a normal person. Also, test the whole process with cardboard first so you don't laser, etch, and drill, and realize you've wasted 4 hours.\n* Our laser only accepts B&W images so you'll need to convert it to the right format. In Photoshop, you can convert an image to 2-bit (actually probably 1-bit) mode by going to Image>Mode>Grayscale and Image>Mode>Bitmap. Choose Diffusion Dither. Save as a .bmp and import into the laser. Double check that the dimensions are accurate. If it whines about being 2-bit bitmap, you likely didn't do the bitmap mode correctly and it's 1 or 2 bits of color stored in a 32-bit format or something.\n* Make sure that the colors are right: I think our laser engraves away all black pixels, which means those pixels will be exposed to acid, which means black = \"empty space\" and white = \"copper traces\". Double-check by running a preview beforehand and making sure that the red \"cut\" areas are the areas you want to end up as \"empty space\".\n* To get accurate sizing when importing into LaserCut, you'll also probably want to save your file at 254dpi / 100 dots per centimeter / 10 dots per millimeter. In other words, LaserCut seems to interpret a 254-pixel image as being 1 inch because (as far as I can tell) it doesn't respect DPI settings in files.\n* Follow the normal laser cutter directions and precautions.\n* Engrave (\"raster\") the image using power/speed settings recommended by the laser cutter job log. It's a good idea to test a small unused corner first; you want to ablate all the black paint leaving behind only the settled dust which can easily be wiped off. Avoid using too much power / too low speed because heating up the copper may \"glue\" the paint dust back on the board and the copper reflection may damage the laser.\n* Clean up the paint dust using rubbing alcohol or water (not acetone)\n* Follow the [[#Etch|Etch]] instructions below.\n\n===Preparation===\nYou will need:\n*copper clad board\n**Available at Fry's Electronics, Radio Shack, and other electronics supply shops.\n**Several places are also selling flexible PCB material called Kapton.\n*transfer material\n**Some use magazines or transparencies.\n**Special-purpose toner transfer paper is available.\n***Pulsar Pro FX - http://pulsarprofx.com\n***Press'n'Peel - http://www.techniks.com/\n*sealing foil (optional) - http://pulsarprofx.com\n*source of either UV light or heat\n**Desktop paper laminator works great.\n**Clothes/craft iron also works.\n*laser printer\n**Ink jet will NOT work.\n*scouring pad (NOT steel wool)\n*chemicals\n**dish soap\n**ferric chloride (FeCl)\n***Use this OR CuCl.\n***Get liquid so you don't have to mix the powder.\n***You can't just dump this down the drain when you're done with it (after several of etches).\n**cupric chloride (CuCl)\n***Use this OR FeCl\n***Easier to work with\n***http://www.instructables.com/id/Stop-using-Ferric-Chloride-etchant!--A-better-etc/\n***http://members.optusnet.com.au/~eseychell/PCB/etching_CuCl/index.html\n**vinegar, peroxide (H2O2, table salt (NaCl)\n***Inexpensive\n***Much less toxic\n***Easier cleanup\n***http://www.stephenhobley.com/blog/2011/03/02/still-messing-with-forces-i-dont-understand-the-formula/\n*non-metal container(s) and/or bubble tank larger than your board\n**http://www.instructables.com/id/Build-your-own-PCB-bubble-tank!/\n*protective gloves\n**latex or nitrile\n*paper cutter to trim board (optional)\n**only use for thinner boards (0.032-)\n**abuses blade\n*we also have a sheet metal brake/shear which can be used for boards\n\n\n30 minutes prior to transfer, turn on laminator. Use thickest setting for highest heat.\n\n===Print===\nWhen printing your design, there are two critical things to keep in mind.\n*Print a mirror image, scale to 1.\n*Set printer to maximum density. Use Transparency setting, if available.\n\nThese instructions assume you're using toner transfer paper.\n\n#Mark top sheet in paper tray for side and orientation.\n#Print circuit.\n#*top OR bottom layer, pads, vias\n#*no docu/caption\n#*Verify components fit on their footprints.\n#*Verify all traces are clear and distinct.\n#Cut transfer paper slightly larger than image.\n#Tape transfer paper over image, shiny side exposed.\n#*Be sure not to cover important parts with tape!\n#*Cover entire leading edge with tape to avoid jams.\n#Place paper back in tray, noting orientation.\n#Print image again with darkest setting.\n#Remove transfer paper.\n\n===Transfer===\n[[image:pcb_transfer.jpg|right]]\n#Cut board to appropriate size\n#*Leave enough board to push through laminator; At least two inches.\n#Scour copper surface\n#*Use scouring pad and a dab of soap\n#*Use very light pressure. You're trying to roughen the copper, not remove it.\n#*Surface should be slightly dull, with no gouges.\n#Rinse/dry board.\n#Partially fill one container with clean, cool tap water.\n#Align image on transfer paper with board.\n#Carefully trim excess paper with a razor or sharp scissors.\n#Maintaining alignment, apply heat with either laminator or iron.\n#*Laminator - Depending on the power of your machine, run your board through 2-6 times changing direction at least once.\n#*Iron - I have no experience with this method. The more heat and pressure, the better.\n#Place board in water. Paper will release after a few seconds.\n#Remove board from water, ensuring all paper has been removed.\n#*Be careful not to remove toner.\n#Inspect traces for excess/light toner.\n#*If small amounts of toner are missing, use fine-point permanent marker to carefully draw them in.\n#*If large amounts of toner are missing, wipe the toner off and restart.\n#*Remove excess toner with a razor blade.\n\nIf not using sealing foil, proceed to Etch section.\n\nIf using sealing foil:\n#Allow board to dry. (Do NOT wipe dry!)\n#Cut piece of foil slightly narrower, and 1\"-2\" longer than board.\n#Place foil, dull side down, such that all the toner is covered, and a large flap is folded under the board. This will prevent slipping when applying heat.\n#Being careful to avoid folds and wrinkles, run foil-wrapped board through laminator twice.\n\nTraces should now be covered in green. If there are still black portions, this should be fine. Toner is sufficient to mask; the sealant is merely added protection.\n\n===Etch===\n[[image:pcb_etched.jpg|right]]\nSome prefer using a sponge to apply the etchant. This is messy and slow, so we will use the submersion method. If you're interested in the sponge method, more information is at [http://www.instructables.com/id/Sponge-Ferric-Chloride-Method-Etch-Circuit-Bo/ Instructibles]\n\n#Trim excess copper board to avoid wasting etchant.\n#If only using one container, dump water out.\n#Fill container with enough etchant to cover board.\n#Place board in etchant bath.\n#*Be careful to avoid splashing. This stuff stains, and is a skin/eye irritant. Reading the MSDS for unfamiliar chemicals is always a great idea.\n#Agitate bath 5-10 minutes. (unless using bubble tank)\n#*Shake container\n#*Gently rub board with (gloved!) finger. Avoid touching things afterwards, this stuff stains everything.\n#*Check board frequently.\n#*Most of the visible etching happens very quickly toward the end of the process.\n#Submerge board in water or rinse in sink to remove all etchant.\n#Pour used etchant back into bottle for reuse.\n#*You can get several boards from a single batch of etchant.\n#*Do not dispose of used etchant down drain.\n#Dry board.\n\nCongratulations! Your board is now ready for drilling, if necessary, and population.\n\n===Cleanup===\n*Return used etchant to container for future reuse.\n**DO NOT dump down train. Etchant is toxic and contains heavy metals. Check MSDS or city hazardous waste department for disposal instructions.\n*Thoroughly clean up any spilled etchant.\n*Return printer to typical settings.",
    "bytes": 10931
  },
  "revision_count": 19,
  "first_revision_timestamp": "2010-01-27T07:43:17Z",
  "is_redirect": false
}