{
  "title": "Phoenix RepRap",
  "ns": 0,
  "id": 47,
  "slug": "Phoenix_RepRap",
  "latest_revision": {
    "id": 3064,
    "timestamp": "2011-12-13T08:01:39Z",
    "contributor": {
      "username": "Will",
      "ip": null,
      "id": 22
    },
    "comment": "",
    "text": "=Project Synopsis=\n\nCURRENT STATUS: In pieces, check out [[Fakerbot]] instead.\n\nWe've been trying to brainstorm a good project idea that we can focus on to present to ASU for the $2000 grant we're aiming for.  One project that would definitely put us on the map and would also allow us to reach out to the local community would be procuring a Rapid-Prototyping device.  The RepRap project is a prime example of one whose initial creator's intention was not only to make a device that was as inexpensive as possible but also one that can replicate itself.  Seeing the cost benefits analysis, as well as, the vast improvements with version II of this device(Mendel) we're thinking about going with that design.\n\n--Update - ASU did not fund us so we did it ourselves.  Take that establishment.\n\n==Design Summary==\n\nCheck out the RepRap main site here:<br>\nhttp://reprap.org/bin/view/Main/WebHome\n\nThey've got a great video/mini documentary explaining the background of the RepRap concept including an interview with the designer:<br>\nhttp://vimeo.com/5202148\n\nCheck out the below link for a good video summary of what the \"Mendel\" is:<br>\nhttp://objects.reprap.org/wiki/Mendel_Overview\n\n==Construction==\n\nThe RepRap team has done a pretty good job of ensuring that the design specs are open source so that the world wide community can participate in building and even bettering what they've started.\n\nBelow is their how to section on building a \"Mendel\" version of the RepRap:<br>\nhttp://objects.reprap.org/wiki/How_to_make_RepRap_Version_II_%22Mendel%22\n\n==Budget==\n\nThis is a tally of costs so far, and providers used.  You can see the original estimate on the rep rap site of $520 was rather low.  With all the various shipping charges (plus we got 15lbs of plastic) we will likely almost double this.  They also do not mention the impossibility of finding the prototyped/printed parts for the rep rap.  They are approximately 100 hours to print and thus we've found few rep rap/makerbot owners willing or able to print those parts for us.  These parts can also be rapid prototyped for around $1500 dollars which is slightly more than the advertised $20 dollars.\n\n===Located Parts===\n{| border=\"1\" cellpadding=\"10\" cellspacing=\"0\"\n|-\n|'''Item'''\n|'''US cost'''\n|'''Notes'''\n|-\n|Bearings\n|$76.14 shipped\n|TheBigBearingStore.com\n|-\n|Fasteners\n|109.20\n|Mcmaster.com\n|-\n|Belt\n|see Fasteners\n|Mcmaster.com\n|-\n|Extruder parts(machined)\t\n|$32.40 shipped\n|reifsnyderb on rep rap forums\n|-\n|Motors\n|302.85 shipped\n|Store.Makerbot.com\n|-\n|Plastic Stock\n|See motors\n|Store.Makerbot.com\n|-\n|PCBs\n|See Motors\n|Makerbot\n|-\n|Electronics\n|169.16\n|Parted out from Digikey, Allied,Arrow,Newark and Mouser\n|-\n|Thick sheet MDF, between 4mm and 6mm and at least 42cmx40cm\n|57.15\t\n|Lowes\n|-\n|Bar (smooth rod) BZP NOT BMS A2 Steel even better - at least 3m - M8 (8mm diameter)\n|See Thick Sheet\n|Lowes\n|-\n|Studding (threaded rod) -BZP  M8 (8mm diameter) at least 9 meters\n|See Thick Sheet\n|Lowes\n|-\n|epoxy,ties\n|See Thick Sheet\n|Lowes\n|-\n|silicon grease, kapton tape\n|~33.00\n|Grainger\n|-\n|pcb strip board, heatshrink tubing, \n|n/a\n|Scrap\n|-\n|12 PC or laptop Power Supply\n|n/a\n|Multiple units donated by various members\n|-\n|5v FTDI\n|19.04 shipped\n|Sparkfun\n|-\n|Extruder parts - 6-ohm length of fibreglass-insulated nichrome wire,\n|.50cents a foot\n|http://store.makerbot.com/nichrome-wire-31-ga.html\n|-\n|Extruder thermistor\n|4.06\n|http://www.circuitspecialists.com/prod.itml/icOid/6136\n|-\n|2pin .1inch pitch connectors to replace rj45s\n|~10\n|Newark.com EC100F-2 CE100F22-2\n|-\n|Thin sheet less than 2mm thick and at least  8cmx5cm\n|Free Scrap\n|Beer, Soda, Energy Drink Can\n|-\n\n|'''Total'''\n|'''$>794.26'''\n|''''''\n|}\n\n==NEEDED PARTS==\nThese are the parts we still need.  Perhaps you can help?\n\n{| border=\"1\" cellpadding=\"10\" cellspacing=\"0\"\n|-\n|'''Item'''\n|'''US cost'''\n|'''Notes'''\n|-\n|[[Phoenix_RepRap/Printed Parts|Printed Parts]]\n|Free From Local Printer Community\n|Laser Cut, Rapid Prototyped, or Printed?\n|-\n|Misc - oil, box cutter blades, more?\n|?\n|Lowes, Home Depot\n|-\n|'''Total'''\n|'''?'''\n|-\n|}\n\n==Build Log==\nSorting parts into 'kits' (whole lotta parts to sort)\nSoldering - 2 or 3 stations probably (12 boards of various complexity)\n*Dip soldering and SMD soldering\n*Toaster oven reflow\nTesting\nWiring\n*ribbon data\n*power\nMechanical construction\n*Extruder building\n*X, Y and Z\n*Rods cut to length\n\n==Status==\nInitial Build Done(ish)\n\n*There's one electronics/firmware/software problem we've been watching the entire build.  Our Z axis has always moved... oddly.  When running Z through the X or Y axis it actuates properly, but the Z output from the motherboard makes the motor move oddly and only in one direction.--Swapped for another board which is working fine, still haven't determined problem on old board though\n:''Z-axis output issue fixed, now it just needs calibration.'' --[[User:Geekner|Geekner]] 08:46, 10 March 2010 (UTC)\n*We're having some jerky movements in the Z mechanical construction.  We believe we have diagnosed this down to issues with metric and standard conversions on a certain z axis nut.  --works well enough for now\n*The Extruder motor board didn't appear to be able to drive the motor (and lots of thermistor problems)\n**Have more powerful motor hooked up now but the pinch wheel is such a pain and the software is so bad I don't l know if its any better.  \n**Also have hooked up 'underpowered' motor through pololu A4983 and have seen it occasionally move in rep rap software, but it  keeps crashing so not tested.  \n**Moving back to rep g the more powerful stepper seems to work now but isn't extruding.  Pinch wheel problems or still underpowered?(altered rep g to take stepper) \n**Havent yet found pinouts on the extruder board for repg firmware (different from rep rap firmware) to utilize the pololu stepper for use in rep g firmware\n\n<strong>Try to print again in rep g, wait for David's design now that we have functioning stepper in repg, rewrite software to not crash and or try other extruder board to see if its more stable?, find pinouts on extruder board for stepper and direction pins (on rep rap they come off the mobo as sda and scl)</strong>\n\n==Insufficiencies in Rep Rap Documentation==\n\n===Instruction issues===\n*Extruder page lists 5leds, but you actualyl need 9.  (were 9 in partlist it would seem) Led1 and Led9 are actually named Power and Debug also.\n*Need better documentation on Mendel modifications to build process.  We accidentally did a lot of soldering we had to desolder.\n*All mechanical construction steps don't actually give you any instructions, simply parts lists and completed pictures\n\n===Problems in Schematics===\n*Motherboard schematic claims 100u for c6, should be 10u as in documentation wiki\n\n===Missing from partslist===\n*4 conductor ribbon for the extruder\n*Thermistor for extruder\n*2 color 2 conductor 8amp guaged wire for power\n*XLR connectors --which we're not using so thats fine\n*We were short a length of 10 conductor ribbon\n*Extruder lists 180ohm 1206 resistor as not required... I think?  Or is it?\n*Partslist doesn't list any of the mendel mobo modification parts --3v Voltage Regulator 78L33 or electrolytic cap - we don't need anyway as we went with a sparkfun 5v ftdi breakout which matches a breakout on the mobo and gives us our 3.3v and 5v both I believe\n\n=== Unnecessary on partslist===\n*30 watt resistor - 30w-5-nd (digikey)\n*SPDT Slide Switch - as atx header isnt used on mobo anymore, switch doesn't actually switch anything\n*atx headers\n*rj45\n\n==Making Improvements==\n\n===What's Out There?===\n\n*Thingiverse Combined .stl Files:  [http://www.thingiverse.com/thing:1883 http://www.thingiverse.com/thing:1883]\n*Dremel Attachment: [http://blog.makezine.com/archive/2010/02/dremel_attachment_for_makerbot.html http://blog.makezine.com/archive/2010/02/dremel_attachment_for_makerbot.html]\n\n===New Ideas===\n\n*Be Able To Make It's Own Circuit Boards\n*Means to Recycle Plastic\n*Print on a finer scale\n*Increase Print Speed\n*Hot Plate for Print Consistency\n*Larger Print Area",
    "bytes": 8048
  },
  "revision_count": 56,
  "first_revision_timestamp": "2009-10-21T07:25:06Z",
  "is_redirect": false
}