{
  "title": "Poker Night Fundraiser",
  "ns": 0,
  "id": 37,
  "slug": "Poker_Night_Fundraiser",
  "latest_revision": {
    "id": 158,
    "timestamp": "2009-09-30T07:03:39Z",
    "contributor": {
      "username": "Uberschnitzel",
      "ip": null,
      "id": 9
    },
    "comment": "/* Documents */",
    "text": "[[File:Poker-Night.jpg|750px]]\n\n==Premise==\n\nThe time has come to begin preparations for our very first fundraiser!  Sean, Rick and Jeremy have put\nthe final touches on the Official Paperwork and it will be turned in shorty, allowing HSL to become a \nreal non-profit!!!  That said, we want to be ready to hit the ground with a fundraiser so that we can get some money to MAKE STUFF HAPPEN! \n\nI have offered to head this event, and I am asking for your help!  Please look over the following.\n\n==The Facts==\n  Event Title: HeatSync Labs Presents: \"Poker Night (and Other Nefarious Deeds)\"\n  Date: 3 October 2009\n  Time: 6-10 pm\n  Location: Mesa FOP (where we usually meet)\n  Goal: to raise $500 for HSL General Fund\n\n==The Vision== \n\"Poker Night (aOND)\" will be a step into the past.  From the password-guarded door, to the\nsmokey lighting and the music, it will be an atmosphere of a prohibition-era speakeasy, complete with mob\nbosses and other underground characters.  There will be something for everyone: card tables at different\nlevels of experience, black and white movies, a table to learn how to count cards, \"Lock-picking with\nJeremy the Shim\" and other nefarious tasks.  Basically, I want to set up an environment that is fun and\ndecadent, but also keeps in mind the Hacker essence while bringing in the bucks.  Costumes will be highly\nencouraged, but not mandatory. \n\nInterested???  Poker Night will be a pretty simple fundraiser to organize, easily do-able within a 3 week\ntime frame as long as we have great volunteers!  If this sounds like something you want to make happen (and\nit should- this is the most important thing we can do to get HSL up and running), there is a task for everyone\nwith every skill set and time available. \n\n==What We Need==\n1. Some people to head up sub committees (Ex: Donations, activities, food, advertising). This is going to be a bi-weekly commitment for meetings, some email communication time, and the time required to do your appointed task).  Most intensive. <br> \n2. Some people to help the people heading the sub committees, This will be a bi-weekly commitment for meetings and as needed by the sub-committee head. <br>\n3. Some people who can help set up the day of the event (1 day commitment).  <br>\n4. Some people to run events: Card dealers, food table/bar person, money collectors. (a few hours during the event)  <br>\n5. Some people who can help clean up after the event (a few hours commitment).  Least intensive.  <br>\n\n==What You Need To Do==\n1.Email me ASAP with how much time you have, what you'd like to do and if you have any special resources to donate/lend. (ex: roulette table, decorations, cards ect)  <br>\n2. Start Brainstorming ideas!! As soon as you're on board, I'll share my more detailed document on how we're going to pull off the awesomeness.  <br>\n3. COME TO OUR PREPARATORY MEETING!  We will meet this Thursday (17 September) at the FOP around 9:00 (after the meeting is over/spud guns are started).  There I hope to meet all of you and get the awesomeness underways!\n\n==Documents==\n\nWe're hoping to appeal to some businesses in the local area to donate some food/money to help fund this event.  It doesn't have to be much.  If you're interested in helping out with this feel free to print out the letter below to give to them so it looks official and they can know what we're about:\n\n[[Media:Fundraising_Letter.doc | Fundraising Letter for Businesses]]",
    "bytes": 3430
  },
  "revision_count": 20,
  "first_revision_timestamp": "2009-09-26T09:28:40Z",
  "is_redirect": false
}