{
  "title": "RepRapping",
  "ns": 0,
  "id": 209,
  "slug": "RepRapping",
  "latest_revision": {
    "id": 1242,
    "timestamp": "2010-07-30T07:03:20Z",
    "contributor": {
      "username": "98.177.240.110",
      "ip": null,
      "id": 0
    },
    "comment": "Created page with '=Get a file= The best source online for files is probably [http://www.thingiverse.com/ Thingiverse]  If you're feeling up to it you can design your own file!!  You need some sort…'",
    "text": "=Get a file=\nThe best source online for files is probably [http://www.thingiverse.com/ Thingiverse]  If you're feeling up to it you can design your own file!!  You need some sort of cad program.  Some free possibilities include:\n*[http://sketchup.google.com/ Google Sketchup]\n*[http://www.blender.org Blender]\n*[http://openscad.org OpenScad] - This is neat because its not graphical, its a 3d compiler!  Its a programming language.\n\nWhatever you use you need to export or save to STL format\n\n=Turn on=\nMake sure rep rap is turned on (little switch on lower right of the motherboard).  The usb cable should be plugged in to your computer and the power supply should of course be plugged in.\n\nOpen replicatorg which should automatically connect to the board.  Otherwise there is a connect button.  You should never have to do this, but you can click on machine and make sure driver is set to  Rep Rap w/DC motor (if thats what we're still using in the future where you're reading this)\n\nYou can also check machine, Serial port if it can't connect.  If replicatorg crashes, or just says could not use most recently selected serial port, you may have to unplug the usb cable FROM THE COMPUTER side to clear the COM port.\n\nOK, you're connected.  \n\n=Warm up=\nWe need to heat up the tip for ~5 minutes and extrude some plastic in order to get the machine operational.\n\nClick the Control panel button (arrows) and set Motor Speed PWM to 255, target temp to 225.  You must press enter or click your cursor outside of that input box in order to make this take effect.\n\nThe machine should immediately begin moving towards temp (theres a temperature graph below, with red as your tempature) and reach it within a minute or two tops. \n\nWhile this happens get comfortable with the X, Y and Z controls.  They move for the distance set in the Jog Size column.  Be careful not to jam the head into the table or the sides!\n\nMove the extruder at least 10 or 20mm off the table.  No need to be perfect(you can eyeball this).  Go ahead and click forward on the motor control which is under the pinch wheel extruder tab.  Watch the bearing and the gear on the extruder.  Both should be turning.  If not stop the motor and wait for the barrel to heat up more and or help the extruder along by pushing down on the filament.  If the bearing begins to move go ahead and floss the teeth of the gear wheel with the toothbrush.  The gear may have stripped the filament and we need to get that loose plastic out of the teeth.    \n\nBy now you should be freely flowing plastic or you've got a blocked heater barrel or your pinch wheel setup is not adjusted properly.  You should find help or start googling (try the makerbot and or rep rap sites).\n\nSo you're freely flowing plastic will pile up.  Do this for a few minutes, making sure the plastic doesn't touch the tip, we don't want it melting the plastic or building it up there, clean anything away from the tip.  Stop the extruder and clean any plastic\n\n==Zero machine==\nRep Rap doesn't know or care where it starts, you pick your zero before you print.  For some reason I feel like we need to do this everytime, I think our z binds a bit and 'loses' a few mm everytime we move it up and down.\n\nPut a piece of paper down on the platform and slowly move the toolhead down to touch it.   you want to be able to move the paper around a bit, but have some drag on it too.  You need to experiment with this.  As you get closer you can lower the jog size.  \n\nWhen you think you have it, and your toolhead is in the middle of your x and y axis as well, press set zero.\n\nNow you can leave the control panel.\n\n=Generate GCode=\nOpen your stl file if you havent already.  Click the model tab, and then click the large \"generate g code\" button on the right.\n\nYou want to use the rep-rap cupcake profile and make sure 'use raft' is clicked and click ok.  (If you're feeling advanced you can manage your profiles and dig into the Skeinforge settings.)\n\nThis generates your tool paths.  When this finishes youll see some code in your window.  Eventually you want to read through this and understand it, but for now just click the build button on the top left.  \n\n=Print!=\nYour machine should still be at temperature from your previous setup.  It will attempt to bring the extruder up to temperature but this isn't very reliable right now and so that's why we've already done that before.  For some reason it seems like the makerbot firmware doesn't get to temperature before starting the actual build commands so make sure you are at temp before you press build.  \n\nNow your z will move up 20.  Its going to extrude a bit of plastic and wait for you to press ok.  Press ok and clear the plastic away.\n\nThe toolhead will return to 0 and begin to build what is called raft.  Raft evens out your build platform and creates a platform which plastic will stick to better, you will pull this stuff off of your piece after its done finshing.\n\nGood raft should look like this and means that you set your Z Zero well when you set zeros.  Bad raft looks like this and might jam up your extruder head.  Make sure allduring your print that the bearing adn the gear wheel are both turning anytime the printer is printing.\n\nYour print should run until its done at this point.  You can stop a print by using the stop button, or if there is an emergency or the tool jams into a wall/floor just turn off the power or pull the plug.  Its not particularly recommended you leave the rep rap printing unattended...",
    "bytes": 5501
  },
  "revision_count": 1,
  "first_revision_timestamp": "2010-07-30T07:03:20Z",
  "is_redirect": false
}