{
  "title": "Rules",
  "ns": 0,
  "id": 227,
  "slug": "Rules",
  "latest_revision": {
    "id": 6746,
    "timestamp": "2025-10-02T00:12:48Z",
    "contributor": {
      "username": "Jaymcgavren",
      "ip": null,
      "id": 731
    },
    "comment": "/* Membership Guidelines */ : add link to bylaws",
    "text": "==Membership Guidelines==\n\nThe below is an overview, please see the [[Bylaws#MEMBERSHIP|Bylaws]] page for important additional details!\n\n\n=== Eligibility ===\nHeatSync membership is open to the public, but use of certain equipment and key/security code may require further training, certification or approvals. We do not discriminate based on age (providing that the user is capable of operating the tool, a minor may need to be accompanied by a parent for liability reasons but may still become certified), gender, sexual preference, race, religion, or geek factor.\n\n===Membership Tiers===\n{| width=\"100%\"\n!align=\"left\" width=\"32%\"|Associate Membership\n!align=\"left\" width=\"2%\"|\n!align=\"left\" width=\"32%\"|Basic Membership\n!align=\"left\" width=\"2%\"|\n!align=\"left\" width=\"32%\"|Plus Membership\n|-\n|valign=\"top\"|Costs $25 per month, and confers\n*A vote at Hack Your Hackerspace (excluding card-granting votes)\n*Discounts for certain classes\n|\n|valign=\"top\"|Costs $50 per month, and confers the benefits of Associate Membership, plus\n*A vote at board elections\n*A bankers box for storage\n*Can be nominated for 24/7 key access, see [[Bylaws#CARD_ACCESS|Bylaws]]\n|\n|valign=\"top\"|Costs $100 per month, and you get all the benefits and rights of a basic membership, plus\n*A secure-able locker for storage. (No bankers box)\n|}\nMore than anything else, membership is a regular donation. Its is NOT payment for a service.\n\n'''Teachers get 50% off any membership.''' Sign up as normal, just make your payments for the discount rate.\n\n===Membership Fees===\nIf you sign up for membership via PayPal, your recurring monthly dues will be subtracted from your account the same date you enrolled. If you chose Cash/Check -- you can either mail your dues (108 West Main St. Mesa, AZ 85201) or deliver it to the current treasurer (treasurer @ heatsynclabs.org) at HeatSync. Please note recurring payments are -highly- encouraged-- remember we do not have staff. If cash/check are important please consider using your bank's automatic bill-pay feature, or prepaying for 3, 6 or 12 months up front.  '''Note:''' Membership fees are nonrefundable.\n\n===Membership and Equipment===\n\nThe equipment in the lab, and the supplies necessary to keep equipment in operation, are the responsibility of the members of Heatsync Labs. Supplies, materials, and other consumables, are kept in stock to the extent that members purchase them for the lab.\n\nConsumables such as stock, drill/mill bits, adhesives,etc are NOT a right of membership.  Many consumables are available in the shop but are expected to be refilled by members, or not be available.  Spare stock from projects may be stored in the space and is encouraged to be used--and refilled.\n\n===Good Standing===\nA member shall be considered in good standing if they are current on their dues or on a current board-approved scholarship.\n\nIf a member fails to pay their dues in a given month, HSL will make a good faith effort to contact them for resolution.\n\nIf the member refuses to pay their dues, membership will be immediately terminated. If they have a storage box/locker, they will be given 30 days to claim its contents, after which the contents will be donated to charity.\n\nIf the member is unreachable and/or does not respond to HSL's contact efforts within 60 days, a second contact will be attempted. If they are still unreachable and/or unresponsive after an additional 30 days, the contents of their storage box/locker will be donated to charity.\n\n===Non-transferability of Memberships===\nMember may not transfer their membership or any right arising therefrom. All rights of\nmembership cease upon the member's death.\n\n===Termination of Membership===\nThe membership of a member shall terminate upon the following events:\n* Upon the Members notice of termination delivered to the president or secretary of the corporation personally or by mail, email, or other written communication, such membership to terminate upon the date of delivery of the notice or date of postmark if deposited in the US mail.\n* The Board of Directors may terminate the membership of a member at a Board Meeting with cause by consensus vote.\n* Notice shall be given by any method reasonably calculated to provide actual notice to the member. The member shall be given an opportunity to be heard, either orally or in writing, within 7 business days of the effective date of the termination. The hearing shall be held, or the written statement considered, by the Board of Directors.\n* All rights of a member in the corporation shall cease on termination of membership as herein provided. All access cards and keys must be returned to HeatSync Labs.\n\n===General===\n* Clean up after yourself after using any public space or machine, including cleaning tables, machines and floor area around it and returning any items to their proper location.\n* Do not use a machine if you have not been shown how to operate it safely.\n* All accidents and safety violations are to be reported. \n* Only use correct tools for your work.\n* When carrying tools, sharp edges should be pointed downwards.\n* Be patient and do not rush.\n* Avoid distractions.\n\n===Workshop===\n* Avoid working alone in the workshop whenever possible.\n* Avoid creating a cluttered work area while working, especially if others are working in the workshop at the same time.\n* Be aware when working with long items such as 2x4s as to not hit equipment or people\n* When multiple tools are in being utilized on a single workbench, only one tool should be in operation at a time.\n* Only one splitter or surge protector per outlet.  Do not “daisy chain” them or overload the outlet.\n\n===Equipment===\n* Perform a visual inspection of the tool before using it looking for things like possible damage, missing or loose parts, or the previous user's materials\n* Do not use an equipment if it is marked as damaged or appears to be damaged\n* Damaged Equipment is to be reported to an officer as soon as possible \n* Keep flammable and combustible items away from spark producing activities. Before using a grinder, look to see what is stored around that might respond to a spark. The same with welding or cutting.\n* Know where the emergency button is on all tools\n* Use of Equipment while intoxicated is grounds for immediate expulsion of the member.\n* Misuse of any equipment is to be reported to an Officer as soon as possible\n\n===Clothing===\n* NO baggy/loose clothing\n* Closed toes shoes are required\n* Remove all jewelry including rings, necklaces, chains, lanyards and bracelets.\n* NO long sleeve shirts when working with power tools. (Long sleeves and long pants are required when welding)\n* Tie back long hair\n* Gloves when appropriate (when working with sharp or hot objects etc)\n\n===Safety equipment===\n* Safety goggles or a face shield must be worn when you (or anyone else in the shop is) using any equipment that expels debris or could cause things to fly out of control.\n* Hearing protection for yourself and others when working with tools that generate significant noise such as angle grinders, table saws, planers, etc.\n* Dust Masks when working with tools generating inhalation hazards such as fine sawdust\n* Know where your fire extinguishers are whenever working with flammable items/solvents or tools that generate flames, sparks or heat.\n* Familiarize yourself with the location and contents and usage of the first aid station and eyewash\n* When injured, seek assistance if needed! Then notify appropriate shop leader regarding the reasons for the injury\n* Report any usage or outage of first aid materials.\n\n==Equipment Use Guidelines==\nAsk another member before using an HSL tool for the first time; everyone knows how to use a screwdriver, but our shop is different from your garage; just ask and you won't accidentally violate unwritten shop etiquette.\n\n=== General Hand Tools ===\n* Use these tools only for their intended purposes.\n\n===Laser Cutter===\n* HeatSync Training required for use\nSee [[Laser Cutters]]\n\n=== Metalworking Tools ===\n;HeatSync Training, or other formal training plus a basic HSL \"test-out\", required for use\n{|width=\"100%\"\n|width=\"49%\" valign=\"top\"|\n*'''TRUST NO ONE''': Check for yourself if you have the right tools, a solid setup, and the machine is bolted down properly\n*HeatSync Training required for use. If you're a pro, you still need to be checked out by an instructor.\n* To clean, gently vacuum and/or brush the chips away from the ways. A spotless machine makes setup very easy\n*Always wear eye protection and closed-toe shoes.\n**Z99 rated industrial quality safety glasses with side-shields. [http://www.youtube.com/watch?v=qOSdSKyxhhI&t=1m15s Tools can throw off sharp, hot metal chips at considerable speed] as well as spin off chips of metal that can be quite hazardous. Don't take chances.\n*Wear short sleeve shirts, tie back long hair, and remove rings, wrist watches, necklaces, chains and other jewelry. \n** Sleeves, hair and jewelry can catch on rotating work and cause [http://www.youtube.com/watch?v=ajNdLT4exps severe injury] or [https://www.youtube.com/watch?v=EBSwOS90wgQ&feature=related death].\n|width=\"2%\"|\n|width=\"49%\" valign=\"top\"|\n*Always double check work areas before starting.\n**Make sure your work is [http://www.youtube.com/watch?NR=1&v=W-Y8FvTgHzk&feature=endscreen securely clamped]. Start the tool at low speed and increase the speed gradually. Do not trust that the machine has been set up in a sane way; what if someone removed the spindle and didn't reattach it securely?\n*Get in the habit of removing the chuck key immediately after use. \n**Some users recommend never removing your hand from the chuck key when it is in the chuck. The chuck key can be a lethal projectile if the lathe is started with the chuck key in the chuck.\n*Keep your fingers clear of the rotating work and cutting tools. \n**This sounds obvious, but people are often tempted to break away metal spirals as they form at the cutting tool.\n|}\n==== Lathe ====\n* Improve your skills: http://techtv.mit.edu/genres/24-how-to/videos (search the page for \"lathe\")\n* Sample project: chess pieces http://en.wikipedia.org/wiki/File:TurnedChessPieces.jpg\n* Basic operations: [[File:basic_lathing_operations.png|150px]]\n\n[[File:Heatsync_Labs_Lathe_101.doc|Lathe 101 Handout]]\n{|width=\"100%\"\n|valign=\"top\" width=\"32%\"|\n*Get in the habit of checking that there is nothing on the spindle that will fly out once turned on; chuck keys, loose parts, etc.\n*Check that autofeed is not engaged, and keep the tool post away from the spinning chuck.\n|width=\"2%\"|\n|valign=\"top\" width=\"33%\"|\n*Avoid reaching over the spinning chuck. \n**For filing operations, hold the file such that you are not reaching over the chuck and risking something being caught in it.  Your body should not be in front of the file itself in case the file snags and is thrown toward you.\n|width=\"2%\"|\n|valign=\"top\" width=\"33%\"|\n*Never use a file with a bare tang.\n**The tang could be forced back into your wrist or palm. Inexpensive wooden handles are readily available for common file sizes.\n|}\n\n==== Mill ====\n'''Main Article: [[Mini Mill]]'''\n\n* Printable class handout: [[File:Heatsync_Labs_Milling_101.doc]]\n** Complete class packet: [[File:Mill_Class_Packet.zip]]\n* Improve your skills: http://techtv.mit.edu/genres/24-how-to/videos (search the page for \"mill\")\n* Sample project: http://www.projectsinmetal.com/free-metalworking-project-plans-the-two-slider-mill/\n\n{|width=\"100%\"\n|valign=\"top\" width=\"49%\"|\n*Don't over-tighten collet / draw bar.\n**There's a point where it's firm and not gripping the endmill getting any tighter, that's good enough.\n**Lock the quill at the quill stop before milling - it only should unlock for drilling holes.\n*Lock the unused axes so they can't move while cutting\n*Use two flute endmills for aluminum, four flute for steel\n*Is your endmill center cutting or not?\n*Keep chips off the clamping surface, wipe them off with a brush and a rag before clamping.\n*Adjust speed and feeds according to tool diameter and material, 300 SFM, .001 IPT for steel, 1000 SFM, .003 IPT for aluminum\n*If you think you need coolant, slow down.  You can mostly machine dry, unless using tool steel or stainless.\n|width=\"2%\"|\n|valign=\"top\" width=\"49%\"|\n*Start with a DOC (depth of cut) of about 0.025\" per pass, if side-milling, start as light as possible\n*Remember to account for backlash, check for climb or (preferred) conventional cutting\n*You want consistent, sizeable metal chips to be coming off of the tool.   Metal powder means you have a dull tool, blue color means slow down your speed (RPM) and feed (cranking the handles).  If your aluminum is turning blue, you're doing something wrong\n*Sound is important. Aim for a pleasant bassy, sand-like \"[https://www.youtube.com/watch?v=Wk2VYwCIcZE bore]\" sound, not a high-pitched buzz/chatter/whine. If you start cutting and it buzzes or smokes (without lubricant), stop and double-check yourself. \n*Use both hands on the feed wheel to get a better feel for the machine and improve steadiness.\n*Milling steel takes about 1/3rd the spindle speed of aluminum for the same mill and feed rate.\n|}\n\n===CNC Mill===\n;See [[CNC Mill]]\n;HeatSync Training, or other formal training plus a basic HSL \"test-out\", required for use\n* Mill rules apply to CNC Mill\n* Do not leave the mill unattended. Stay within reach of the emergency stop button at all times while running.\n* Preview all milling jobs before running on the machine. \n* DO NOT hand-edit your G-code programs.\n* TODO: Add more safety & maintenance rules\n====Getting Started Resources====\nIf you'd like to use the CNC Mill, we are still working on a class but we have identified some things you'll need to learn first. So, you can get started right now on your own! '''Keep in mind these are intended as e-learning preparation for an eventual class, not as a substitute for hands-on training.'''\n\n# Multiple hours of Mill and 3D printer experience will be invaluable if not mandatory, because all the \"gotchas\" of both machines are present in a CNC Mill.\n# Ability to read G-code and M-code. The codes scroll by as the mill runs your program, and if there's any problem you'll need to have a basic understanding in order to troubleshoot things. There's only a couple dozen, so it's not too hard.\n#* Some starter resources I found while googling:\n#** http://www.cnccookbook.com/CCCNCGCodeRef.html\n#** http://www.cnccookbook.com/CCCNCGCodeCourse.htm\n#** http://www.youtube.com/results?search_query=CNC+Basics+E-Course\n#** http://www.youtube.com/results?search_query=cnc+g-code\n# Try using CAD/CAM programs like Solidworks with HSMXpress, or other CAD programs with CamBam, to design a part and generate GCode for it.\n#* Some starter resources: \n#** https://www.google.com/search?q=hsmxpress+tutorial\n#** http://www.instructables.com/id/From-SketchUp-to-CNC-Fabrication/\n# Try using Mach3 - it's the program that directly controls the CNC machine based on the GCode you've made - free trial from here: http://www.machsupport.com/\n#* Starter resources:\n#** http://www.machsupport.com/forum/index.php?action=dlattach;topic=19539.0;attach=27992\n\n===Welder===\n;HeatSync Training, or other formal training plus a basic HSL \"test-out\", required for use\n* Welding emits dangerous levels of visible and invisible wavelength light, use of TIG-approved goggles/helmet and only TIG-approved goggles/helmet is necessary when TIG welding\n** Acetylene goggles are dangerous to use on TIG welders\n*Wear Long pants, longs sleeves if possible, Flame retardant gloves, apron and if necessary hang flame retardant curtain to protect yourself and the workshop \n** Caution when using solvents when cleaning material prior to work\n\n===Soldering===\n* Clean your tips by using tip tinner, and brief and rare applications of the damp sponge or the brass cleaning wool\n* Before finishing, tin the tip fully to prevent oxidation when not in use\n* Never leave iron on and not in use for long periods of time\n* Keep hot surfaces away from burnable, meltable, or injurable areas.\n* When using hot air reflow, avoid extended low speed airflow and high temperature, as the unit can overheat.\n*Utilize the air filter, if available, on your iron to protect you from solder/flux fumes or only solder in well ventilated rooms\n===Metal-Cutting Bandsaw===\n{|\n|width=\"49%\" valign=\"top\"|\n* Do not run the blade too fast for the material \n** Highest speed is only suitable for aluminum (with coolant)\n** Avoiding hardened materials.  Unknown steel alloys should be tested with a file. Avoid cutting ends that have been discolored (hardened) by heat.\n* There is no danger in going too slow, so when unsure, go with the slowest speed.\n* Use the appropriate type of blade (fine versus coarse teeth)\n* '''Bandsaw blade longevity tip''' Blades should always have AT LEAST three teeth engaged in the cut, actively cutting. So, for example, if the blade on the saw is 14tpi, then 3/14 = 0.214\" thick material minimum. When possible, you should cut multiple pieces stacked together to try to achieve the minimum thickness for the blade, even backing-up the cut with sacrificial material works. \n** If you decide to proceed with too-thin material anyway, care must be taken to feed the material into the blade slowly and gently, if it's fed aggressively, one tooth will try to take a full 3/4hp cut and will probably just shear off from the blade itself, especially with the cheap-blade that ships with the saw.\n|width=\"2%\"|\n|width=\"49%\" valign=\"top\"|\n* When in the upright vertical position be sure to lock the hydraulic feed control in the lock out position(picture?)\n* When bringing up in the upright vertical position be aware of the pinch hazard of the position locking mechanism.  Move it into place slowly and safely using the c-clamp attached.  (picture?)\n* When cutting material make sure that the blade guard bearing is as close to the cut as possible.  You will need to adjust these when cutting material at an angle.(pictures)\n* Always keep the vertical tray on the machine.(picture)\n* Always let the blade do the cutting.  Never force it or apply pressure on the chassis to force the cut.\n* When cutting in the horizontal position the maximum height for round material is 7\" and rectangular is 7\" x 12\".\n* To adjust the vice you'll need a 5/8th and 3/4th inch wrench.\n|}\n\n===Laptops===\n===Bench Grinder===\n* Grinder must be firmly clamped or bolted to bench, or it will vibrate off the table.\n* Keep away from electronics due to conductive dust\n* Wheels can shatter and explode simply by being bumped\n* DO NOT STAND in front of it when turning on and turning off, as a shattering wheel can and will kill you.\n** You must clean up dust AND/OR you must not grind aluminum\n*** Aluminum dust can ignite and cause extreme injury\n\n===Angle Grinder===\n* Ear Protection is advised\n** You must clean up dust AND/OR you must not grind aluminum\n*** Aluminum dust can ignite and cause extreme injury\n===Pallet Jack===\n* Certified Weights (we have a 1ton?)\n* No standing, riding\n===Lift Table ===\n* Certified Weights (we have a 1ton?)\n* No standing, riding\n===Air Compressor===\n===Blow Torch===\n===Dremel===\n* Eye protection must be observed\n===Oscilloscope===\n* Don’t connect to high voltage sources (>250V p-p)\n* Be careful with oscilloscope probes as they are sensitive devices!\n\n===Hand Drill & Drill Press===\n* Adjust pulleys to the appropriate speed based on diameter and hardness of material\n* If drill bits are bad, put them in the Broken Tools bin.\n* If you break a bit, stop and reevaluate what you're doing wrong.\n* Don't use precision bits for rough work.\n* Don't use TiN (yellow) bits for Aluminum\n\n[[Category:Rules and Policies]]",
    "bytes": 19673
  },
  "revision_count": 116,
  "first_revision_timestamp": "2010-11-17T08:00:37Z",
  "is_redirect": false
}