{
  "title": "SEM Microscopy",
  "ns": 0,
  "id": 338,
  "slug": "SEM_Microscopy",
  "latest_revision": {
    "id": 2386,
    "timestamp": "2011-06-05T06:04:38Z",
    "contributor": {
      "username": "68.99.84.162",
      "ip": null,
      "id": 0
    },
    "comment": "/* Needed */",
    "text": "=For an ongoing account, see the Buildblog -> http://hsl-sem.tumblr.com/=\n\n__TOC__ \n[[File:SEM sketch, brainstorming.jpg |thumb|right|300px| Just brainstorming -- in the sketch, purple is status as of 3/2/2011, blue and green are welding needs, and orange is post-welding. [[:File:SEM sketch, brainstorming (large).jpg| High-Res]] ]]\n\n[[File:560px-Schema_MEB_(en).svg.png |thumb|right|300px| X-ray detector might come after everything else ;)]]\n==Project Description==\n\n===Lets build an SEM from scratch!===\n\nThe field of SEM means big bucks. The cheapest SEM just came on the market a few years ago and costs $70,000 US. The accelerating voltage is limited to 5kV and the sample chamber is micro-miniature. On the other end of things a full sized SEM is going to run you millions of dollars. Let's laugh a lot and make our own unit with a generous sample chamber and whatever accelerating voltage that we want (20kV would be more than enough). -Jasper\n\nHere's the recorded stream from Brandon's and Jasper's presentations (sorry for the crappy quality!):\n\nhttp://www.ustream.tv/recorded/12763200\n\n==Vacuum Information==\nA tungsten filament will burn out at 10^-2 Torr or higher. Therefore, it is absolutely neccesary that we get our vacuum system working to a sufficient degree that we reach the measurement limit of our DV-6M thermocouple gauge (10^-3 Torr). \n\n=== Flanges ===\n[[File:QF_Flange.jpg |200px|thumb|left|QF/KF Flange Operation]] \n<br style=\"clear:both\">\nFor the best vacuum, we should use either conflats or QF/KF fittings. QF/KF is good to 10^-8 Torr which is more than enough. Conflat would be nice, but is more expensive and more hassle as the seals are only good for a single mate. QF uses a viton O-ring (Isopropanol, but not methanol or acetone, can be used to wipe Viton o-rings clean) while conflat uses a single-use-only copper gasket with biting metal knife edges on either side to form a gas tight metal-metal seal. \n\n\n=== Hose To Chamber Fitting ===\n\nWe should weld on a [http://www.ancorp.com/product.aspx?id=3606 QF40-150-ALF] (KF40 half nipple, 6061-T6 Aluminum, $15.50) onto the chamber and use a [http://www.duniway.com/images/pdf/pg/p-06-to-08-hard-kf-fit-quick-flange.pdf  KF40-HA] (KF40 Flange To Hose (1 1/2” or 1 5/8” ID) Adaptor, Aluminum, $17) to link up the hose. For hose we should use 1.5\" gum rubber which is ~$17 per foot new. Surplus would be a good thing here as we need about 3 feet. \n\n=== DV-6M Gauge ===\n<br style=\"clear:both\">\nThe DV-6M is a thermocouple vacuum gauge which relies on the thermal conductivity of the air to measure a vacuum between 10 Torr and 10^-3 Torr. At atmospheric pressure the tiny hair sized thermocouple wires dissapate all of their heat into the air and the thermocouple reads a lot ambient measurement (0.6mV). At 10^-3 Torr the conductivity of the air drops to a point where all of the heat is retained in the heating element and the gauge reaches its full-scale reading. To read below this the B-A Gauge described below.\n\n[[File:Dv6m_supply.png|200px|thumb|left|Interruptible Heater Supply]] [[File:DV-6M_Supply_Protoshield.jpg|200px|thumb|none|Interruptible Heater Protoshield]] \nThe DV-6M contains the thermocouples in series with the heating element so a DC heating current of 21mA (0.380V across the 19.2Ω Heater) needs to be interrupted for ~5ms in order to take the reading of the thermocouple. A prototype interruptible supply was made which appears to work but will need further integration into the thermocouple amplification circuitry. \n\n=== B-A Gauge ===\n[[File:BA_Gauge.jpg|200px|thumb|left|Bayard-Alpert hot cathode ionization gauge]] \n<br style=\"clear:both\">\nThe [http://www.flickr.com/photos/nebarnix/5470607516/ Bayard-Alpert hot cathode ionization gauge we have] has a 3/4\" glass interface. Reccomend we weld a [http://www.ancorp.com/product.aspx?id=3605 QF25-100-ALF] (KF25 half nipple, 6061-T6 Aluminum, $14) to the chamber and use a [http://www.duniway.com/images/pdf/pg/p-06-to-08-hard-kf-fit-quick-flange.pdf  KF25-CP75] (KF25 Flange To 3/4” Compression Port, $68) as a glass to metal interface. \n\n==Acquired==\n*Vacuum Chamber, $500\n**23\"x11\"\n**Aluminum\n*CF-218 right angle manual valve\n*Vacuum Pump, Dual-Stage Dual-Vane Rotary, Welch 1402, 10^-4 mTorr, $300\n*Basic Hose for testing, Free\n**Hose Clamps, $7.50\n*Electron Emitters, Donated, used\n*Vacuum Gauges\n**DV-6M, Free with Chamber\n**B-A Glass, $35\n\n==In Progress==\n**Driver/meter for the DV-6M thermocouple gauge, (Jasper)\n**Boring hole in chamber for the KF-25 to be welded in (Corey)\n\n==Needed==\n*Belt Drive Vacuum Pump Oil\n*Fittings\n**KF-25 half-nipples and caps for playing with feedthroughs \n***These might be lathable\n**KF/CF half nipple for exhausting the chamber.\n***Will require an adapter to connect to the CF valve if not CF-218\n*Vacuum hose, clear is ok, reddish is better (6 feet, 1\" ID)\n*Material for lenses (silicon steel? permeable iron/steel alloy? must be available in round stock)\n**HT power supply (1-20kVDC, 1-5kVDC OK for now)\n***Flyback transformer with variable duty cycle (to vary output voltage) and output capacitor to smooth waveform\n***Digital interface for varying the duty cycle \n*Webcam + White LED to mount inside of chamber\n*Driver/meter for the Bayard-Alpert hot cathode ionization gauge\n* Altera Cyclone IV FPGA for near-real-time image processing needs\n\n==Completed==\n\n===Feb 20th===\nWe created a vacuum with the Pump, Chamber, and Hose setup that we purchased the other day. The DV-6M thermocouple gauge is strange, but we managed to figure out how to get a useful reading out of it. It still has some weird parts that we need to figure out in order to correlate against a known vacuum level, but for now we have a relative baseline established of [[Special:Contributions/198.207.0.5|198.207.0.5]]1 Torr. Looks like we have a bit of leakage from the hose connections at the moment.\n\n===Feb 21st===\nUpon discovery of the leak using the water pour and vacuum gauge method, and an attempt was made to reseal the threads. Unfortunately a crack was discovered which caused the main valve (Swagelok Whitey Ball Valve SS 45S8) to shear off leaving half of the adapter fitting inside of the chamber and the other half in the valve. \n\n===Feb 22nd===\nBayard-Alpert hot cathode ionization gauge came in the mail today. Looks pretty sexy. We will need two more power supplies (+200VDC, -50VDC) a pico-amp meter, and a way to attach the glass tube to a metal flange. Looks like this will probably require some TIG welding, hopefully the MCC welding shop can help us out here. \n\n===Feb 25th===\nPaul has contacted a TIG welder at MCC who has previous experience with vacuum chambers and who has offered to help us for free (and possibly beer). We need him to weld on some aluminum KF-25 / CF half-nipples for exhausting the chamber as well as for feedthrough prototypes.\n\n===Mar 1st===\nJasper and Will whiteboarded next steps, and tried to de-gunk the secondary vacuum pump with 50% success and relative lack of injury. Corey returned the vacuum chamber, along with a $5 nipple extractor that unfortunately didn't work to remove abovementioned nipple.\n\n==Next Steps==\n\n*Achieving a good vacuum\n**Fix the vacuum hose fitting which broke off and attempt to get a better vacuum\n***Current strategy: replace with welded KF flanges, a KF-Hose adapter, and a new red gum-rubber hose\n**Build permanent circuit and enclosure for driving the gauge heater to 20mA.\n**Provide a digital readout of the thermocouple voltage as well as output the data onto a digital interface line for future incorporation.\n**Weld on the QF/KF flanges and mount the B-A gauge\n***If possible to weld on round surface, weld a 2-4 inch ISO or ANSI mount for oil diffusion pump to increase vacuum? Also consider adding a KF mount on top for detector feed-through to avoid RF noise.\n***Ask welder if welding on lid will cause warping. Discuss optimal KF mounting technique (seat KF mount in machined pit, so weld is not stressed during vacuum?)\n*Getting power/data into the chamber\n**Develop and test KF feed-throughs that can support up to 20KV (estimated >2cm of insulation to avoid arcing -- vacuum-capable epoxy that doesn't outgas? Corey's idea?)\n**Advise welder on  optimal placement of feed-throughs to avoid electrical problems (voltage differences, electrical noise, insulation [plastic is not allowed inside chamber])\n*Obtain scanning electron data\n**Deflector control\n**Detector, detector shielding\n*Translating electron data into images\n**Magic?\n\n==Cost Breakdown==\n{|style=\"border-collapse: collapse; border-width: 1px; border-style: solid; border-color: #000\" cellpadding=\"10\"\n!style=\"border-style: solid; border-width: 1px\"| Description\n!style=\"border-style: solid; border-width: 1px\"| Cost\n|-\n|style=\"border-style: solid; border-width: 1px\"|Welch 1402 Rotary Vane Pump\n|style=\"border-style: solid; border-width: 1px\"|$300\n|-\n|style=\"border-style: solid; border-width: 1px\"|1/2 Gallon of mineral oil\n|style=\"border-style: solid; border-width: 1px\"|$10\n|-\n|style=\"border-style: solid; border-width: 1px\"|23\"x11\" Vacuum Chamber, Al, W/ DV-6m Gauge\n|style=\"border-style: solid; border-width: 1px\"|$500\n|-\n|style=\"border-style: solid; border-width: 1px\"|Bayard-Alpert Glass Gauge\n|style=\"border-style: solid; border-width: 1px\"|$35\n|-\n!style=\"border-style: solid; border-width: 1px\"|\n!style=\"border-style: solid; border-width: 1px\"|Total Cost So Far\n$880\n|}",
    "bytes": 9419
  },
  "revision_count": 34,
  "first_revision_timestamp": "2011-02-20T22:38:54Z",
  "is_redirect": false
}