{
  "title": "Solar Concentrator",
  "ns": 0,
  "id": 222,
  "slug": "Solar_Concentrator",
  "latest_revision": {
    "id": 4009,
    "timestamp": "2013-01-31T19:23:24Z",
    "contributor": {
      "username": "Nebarnix",
      "ip": null,
      "id": 41
    },
    "comment": "typo",
    "text": "'''See http://heliosync.tumblr.com/ for more frequent updates.'''\n\nA project to generate some non-trivial amount of electricity via solar energy in 3 parts.\n\n*A solar concentrating \"dish\" to collect roughly 100 square feet of reflect light into 1 square or smaller area reaching temperatures of approximately 1,000F\n*A working fluid and turbine to convert heat energy into rotary motion. Optionally this may include/necessitate some kind of heat storage to moderate peaks/valleys in sun fall and potentially provide night electricity.\n*A generator to convert rotary motion into AC electricity. The goal would be to generate at a minimum 8 1KW hours per day.\n*Implement the project in a way that it is economically sensible. In metro phoenix the real adjusted per KWH hour cost is $0.15 . Which mean this project on a budget of $500.00 would pay for itself in 1 year or $1000.00 in two years. Costs exclude labor.\n*Implement the project in a way that is reproducible with the production of easy to follow online steps for other groups to implement with.\n\nProject Tasks\n\n*Confirm location with tentative heatsync member who has land near gangplank or find alternative location. Need 10H'x15L'x10W' space at a minimum. Must be able to poor concrete footing. Project is intended to be in operation for 3 months at a minimum.\n\n*Create scale model of concentrator frame. Pictures of a complete frame that may be a good starting point are http://imgur.com/sWEAW.jpg and http://imgur.com/GxCOh.jpg. Define math to establish correct fastened offsets to construct square parabola from matrix frame.\n** If final model is to use 10' 1/2\" EMT conduit determine lengths needed. From picture estimate 46, which is cost of $1.70 * 46 = $80 with tax.\n\n*Source low iron mirrored glass, we will need 10 1'x10' lengths.\n\n*Build mounting/housing and drive gear/pulley for generator rotor and stator. Parts are being donated, approximate retail value $50.\n\n*Determine input power/torque/speed needs for generator. Existing generator stator and rotor are 1KW. Potential upgrade would be http://www.harborfreight.com/10000-watts-max-7200-watts-rated-belt-driven-generator-head-45416.html which would more than pay for itself if sufficient power/torque. is available.\n\n*Determine turbine design, configuration, linkage. Determine math to identify heat/efficiency requirements for 1KW generation. Determine if heat storage is feasible/possible. Determine working fluid, steam seems probable.\n\n==Local Solar Data==\nSolar Cell Data gathered over a 9 day period in Dec 2010 by Jasper Nance\n\nHere is the data which I double checked with a good Candian friend who has lots of experience with solar applications. \n\nWe got 9 days worth of data (even got temperature data, it dipped to -0.8 degrees at one point. Brrr)\n\nWsun = Vsun.*Isun; %watts\nPsun = Wsun / 0.00387096;\nPideal = Psun / .04;\nplot(Time, Pideal);\n\nmax(Pideal) = 645.9 Watts per square meter.  This will be clipped slightly as the current did rail.\n\nPaul gives us a sanity check (which is even closer when you realize that we railed a tiny bit on the current)\n\nI just dug out said Handbook. Interpolating Table 3.2 on page 3-16 says that at a 56 degree zenith angle the solar irradiance is 697 W/m^2. Yeah, I'd say you nailed it.\n( the raw data from that table I mention is from D.M. Gates, \"Spectra Distribution of Solar Radiation at the Earth's Surface,\" Science V.151, pp523-529, published in 1966. ) \n\n[[File:heliosync_cloudless_day.png|300px|left|thumb|Cloudless Day]][[File:heliosync_cloudy_day.png|300px|none|thumb|Cloudy Day]]\n<br clear=\"all\" />\n[[File:heliosync_all_data.png|left|300px|thumb|Total Data]][[File:heliosync_power_density.png|300px|none|thumb|Power Density Calc]]\n<br clear=\"all\" />\n\n==Glass Supplier Search==\nWright Brothers Glassworks - 623-780-4000 - has no suppliers that can offer below 1/8th thickness with low-iron glass\n\nchandler glass - (480) 899-1656 - can only offer 1/8th and above, and not at 10 foot length\n\nAZ glass - (602) 923-0079 - no answer, generic 'voicemail box full' message\n\nThe Glass Works - (602) 253-7683 - Answering machine\n\nSouthern glass works - emailed, awaiting response.\n\n\n\nI can't find any local or online suppliers that offer low-iron/starphire mirrored glass at 3/32nd or below. If anyone else wants to try to find a supplier, this may be our main bottleneck.\n\n\nWe should also check the deflection of a 1/8th thickness glass to see if it might work instead.",
    "bytes": 4446
  },
  "revision_count": 6,
  "first_revision_timestamp": "2010-11-03T22:48:37Z",
  "is_redirect": false
}