{
  "title": "Starting a Non-Profit",
  "ns": 0,
  "id": 30,
  "slug": "Starting_a_Non-Profit",
  "latest_revision": {
    "id": 4442,
    "timestamp": "2017-09-28T00:30:36Z",
    "contributor": {
      "username": "Uberschnitzel",
      "ip": null,
      "id": 9
    },
    "comment": "Many links were broken.  Updating some ACC and IRS links referenced to current.",
    "text": "== Select the Name of the Corporation==\n\n=== Name Guidelines===\n\nWhen choosing a name ensure that it: <br>\n\n* Will afford strong federal trademark protection, but will not infringe on anybody's trademark or service mark\n* Will be easy for your customers to remember\n* Will describe your products or services(often not possible and not proffered)\n* Will allow you to obtain .com, .net., .org, .biz, .info and .us domain names\n\n=== Name Regulations===\n\nIt will probably be easiest to just choose a name and then make sure it fits within these rules:\n\nTo check the availability of a name and for some naming and for some naming standards: <br>\nhttp://www.azcc.gov/divisions/corporations/filings/namingpolicy.asp\n\nName must abide by these Arizona rules: https://www.azleg.gov/ars/10/03401.htm\n\n=== Check for infringement===\n\nUse https://www.irs.gov/charities-non-profits/search-for-charities to search the IRS Federal database for names\n\nUse http://ecorp.azcc.gov/Search to search the Arizona Corporation Commission database\n\n===Reserve the Name===\nhttp://www.azcc.gov/Divisions/Corporations/forms/starpas/formsSTPS/C006-Application-to-Reserve-Corporation-Name.pdf\n\n== Create the Non-profit organization==\n===Benefits===\n*Generally, we're not exempt on sales tax (its complicated, especially in arizona consult a lawyer and tax specialist)\n*Can be exempt from property tax (its complicated, must apply)\n*The big exemption is that 501c3's don't have to pay taxes on the business net income(state follows federal guidelines).  So earnings can be cycled right back into the organization to improve it.\n*Contributors to the organization can have their contributions be tax deductible(they should consult their tax specialist) \n*We also get reduced postage!\n\n=== Prepare the Articles of Incorporation===\nArticles are amended whenever new officers join or old ones leave. Also, if you need to change contact info or make tweaks to the mission statement and organization description/purpose.\n\n*Articles of Incorporation - Nonprofit Form:<br>\nhttp://www.azcc.gov/Divisions/Corporations/forms/starpas/formsSTPS/C011-Articles-of-Incorporation-Nonprofit.pdf\n\n*Articles of Incorporation - FAQ: <br>\nhttp://www.azcc.gov/Divisions/Corporations/forms/starpas/instructionsSTPS/C011i-Instructions-Articles-of-Inc-Nonprofit-STPS.pdf\n\nBe sure to note that the corporation will not practice discrimination so as to be eligible for tax exemption!\n\n=== Memberships===\n\nThe Articles of Incorporation must state whether or not the corporation will have members. An Arizona nonprofit corporation is not required to have members. The choice to have members or not have members is a decision for the founders and depends on the nature of the proposed activities and the desires of the founders. Nonprofit corporations without members are governed by the corporation's board of directors.\n\nIf the corporation will have members, the articles of incorporation or bylaws may establish criteria or procedures for admission of members and continuation of membership. Unless otherwise provided in the articles of incorporation or bylaws, a corporation with members shall hold a membership meeting annually at a time stated in or fixed in accordance with the bylaws. A member of a nonprofit corporation is not personally liable for the acts, debts, liabilities or obligations of the corporation.\n\nAll members have the same rights and obligations with respect to voting, dissolution, redemption and transfer, unless the articles of incorporation or bylaws establish classes of membership with different rights or obligations or otherwise provide. All members have the same rights and obligations with respect to any other matters, except as set forth in or authorized by the articles of incorporation or bylaws.\n\nA nonprofit corporation shall notify voting members of the date, time and place of each annual, regular and special members' meeting at least ten days but not more than sixty days before the meeting date.\n\n=== Directors===\n\nAll corporate powers are exercised by or under the authority of and the affairs of the corporation are managed by its board of directors, subject to any limitation set forth in the articles of incorporation.\n\nIf a nonprofit corporation has members, **the members elect all the directors (except the initial directors) at the annual meeting of members, unless either: (i) the articles of incorporation or bylaws provide some other time or method of election, or (ii) the articles of incorporation or bylaws provide that some of the directors are appointed by some other person or some of the directors are designated.**\n\nIf the corporation does not have members, all the directors except the initial directors are elected, appointed or designated as provided in the articles of incorporation or bylaws. If no method of designation or appointment is set forth in the articles of incorporation or bylaws, the board of directors shall elect the directors (other than the initial directors).\n\n=== Officers===\n\nA nonprofit corporation shall have the officers described in its articles of incorporation or bylaws or appointed by the board of directors in accordance with the articles of incorporation or bylaws. **The bylaws or the board of directors shall delegate to one of the officers responsibility for preparing minutes of the directors' and members' meetings and for authenticating records of the corporation**. The same individual may simultaneously hold more than one office in the corporation.\n\n===Conflict of Interest ===\nYou do not HAVE to create a conflict of interest policy, but you REALLY SHOULD.  It protects the organization by putting the liability back onto the parties who did not properly disclose or act. Conflict of interest is TOTALLY OK.  You just need to treat it properly. Disclose it, recuse yourself from committee or vote if necessary. You may still act with the disqualified party on a deal you just need to have a paper trail on why the deal was better than the others you didn't take. Note; The penalties are HUGE here, lookup Excess Benefit (The person on the board who benefited is responsibly 25% of 200% of excess, plus excess paid back, AND the board is responsible! (10% up to 20k) each, AND you can still lose the nonprofit status) There is NO statute of limitations.  Also NOTE: A board member is still a disqualified person until 5 years after they leave the board, So you can't step down to make a deal.\n\n\nAn 'insider' or 'disqualified person' is someone who has persona and private interests within the taxable exempt organization.  We cast this net as wide as possible in our disclosure statement which every board member must sign each year, which includes:\n*spouses, parents or sibling of the spouse, of the director; child grandchild sibling parent or spouse of a director\n*child, grandchild, sibling or parent or spouse of a child, grandchild, sibling or parent of the director\n*an individual having the same home as the director\n*a trust or estate of which an individual specified above is a substantial beneficiary\n*a trust, estate, incompetent, conservatee or minor of which the director is a fiduciary\n*and anyone else with substantial influence\n\n\nEach board member is subject to sign conflict policy annually!  Make sure net is cast 'wide' to protect you. Must include\n*acknowledge they received a copy\n*that they read and understood\n*that they agree to comply\n*that they understand the entity is tax exempt and must engage primarily in actives which accomplish its tax-exempt purposes.\n*their signature\n\n=== Governance Issues===\n\nThe general rule is that a nonprofit corporation may not make any distributions. It must keep as permanent records minutes of all meetings of its members and board of directors, a record of all actions taken by the members or board of directors without a meeting and a record of all actions taken by a committee of the board of directors on behalf of the corporation. The corporation shall maintain appropriate accounting records. The corporation or its agent shall maintain a record of its members in a form that permits preparation of a list of the names and addresses of all members and in alphabetical order by class of membership showing the number of votes each member is entitled to cast and the class of memberships held by each member. \n\nWithout the consent of the board of directors, no person may obtain or use a nonprofit corporation's membership list or any part of the membership list for any purpose unrelated to a member's interest as a member. Without the consent of the board of directors, the membership list or any part of the membership list shall not be:\n\n* Used to solicit money or property, unless the money or property will be used solely to solicit the votes of the members in an election to be held by the corporation.\n* Used for any commercial purpose.\n* Sold to or purchased by any person.\n\nEach year a nonprofit corporation must pay a $10 fee and file an annual report with the ACC that sets forth the following information that becomes available to the public:\n\n* The names and business addresses of its directors and principal officers.\n* A brief description of the nature of its activities.\n* Whether or not it has members.\n* A certificate of disclosure containing the information set forth in A.R.S. Section 10-3202.D.\n* A statement that all corporate income tax returns required under Arizona law have been filed with the Arizona Department of Revenue.\n* A statement of its financial condition consisting of one of the following documents: (i) the corporation's most recent copy of page 2, Form 99 filed with the Arizona Department of Revenue; (ii) a copy of the corporation's Charitable Organization Financial Statement as filed with the Arizona Secretary of State pursuant to A.R.S. §44-6552; (iii) a copy of the corporation's Treasurer's Report/Financial Statement prepared for the current fiscal year; (iv) a copy of the financial statement prepared for the corporation's members; or (v) a statement that the corporation conducted no business in Arizona in the past year.\n\n=== Choose a Statutory Agent - Not it!===\n\nEvery nonprofit corporation formed in Arizona or qualified to do business in Arizona must have and maintain a statutory agent located in Arizona. The purpose of a statutory agent is to give notice to the public of a person or entity authorized by the corporation that can be served with legal documents as the agent of the corporation. The statutory agent is the person or entity that can be served with a summons and complaint filed in a lawsuit.\n\n'''The statutory agent must be one of the following:'''\n\n* An individual who resides in Arizona.\n* A domestic business or nonprofit corporation formed under Arizona law.\n* A foreign business or nonprofit corporation authorized to transact business or conduct affairs in Arizona.\n* A limited liability company formed under Arizona law.\n* A limited liability company authorized to transact business in Arizona.\n\nThe corporation must notify the ACC if it changes its known place of business or statutory agent. If the statutory agent changes its street address, the statutory agent must give written notice to the corporation of the change and sign, either manually or in facsimile, and deliver to the ACC for filing a statement that includes the new address and that recites that the corporation has been given written notice of the change.\n\n=== Prepare a Cover Sheet===\n\nFill this out: http://corporations.azcc.gov/filings/forms/cfcvlr.pdf\n\n=== Prepare Certificate of Disclosure===\n\nCertificate found here: http://www.azcc.gov/divisions/corporations/filings/forms/cf0001.pdf\n\nWhen you file the articles of incorporation with the ACC, you must also submit a completed certificate of disclosure for nonprofit corporations. All incorporators and all people who are officers, directors or trustees at the time the articles of incorporation are filed must sign an initial certificate of disclosure and file it with the ACC. Signatures must be dated within 30 days of delivery to the ACC. When completing the certificate of disclosure: (i) check yes or no for question A, but if you check yes, you must attach to the certificate of disclosure all information requested in question B. Check yes or no for question C. If you check yes, you must attach to the certificate of disclosure all information requested in question C. \n\nIf within sixty days after delivering the articles of incorporation to the ACC any person becomes an officer, director or trustee of the corporation and the person was not the subject of the disclosures set forth in a certificate of disclosure previously filed with the ACC, the incorporator or incorporators or, if the organization of the corporation has been completed, the corporation shall sign and deliver to the ACC within the sixty day period a declaration, sworn to under penalty of law, setting forth all information required by A.R.S. Section 10-3202.D(1), regarding the person. If the incorporator or incorporators or, as applicable, the corporation do not comply with this requirement, the ACC may administratively dissolve the corporation.\n\n*You should warn them their answers will become public.  \n*Email them 2 months notice, and 1 month out, print the email for due diligence\n*If they don't answer and you've asked at 60 days and followed up at 30 days, you've made a good faith effort.(note non compliance does not mean you need to let the director go, oddly enough)\n\n=== Publish the Articles of Incorporation===\n\n* In a newspaper of general circulation the required number of times\n* Within 60 days after the Commission files (approves) the Articles of Incorporation, you must publish a copy of the Articles in a newspaper of general circulation in the county of the known place of business in Arizona for three consecutive publications. A list of acceptable newspapers in each county will be enclosed with your approval letter and is also available on the Commission website. The corporation may be subject to administrative dissolution if it fails to publish. You do not need to file the Affidavit of Publication you will receive from the newspaper.\n* Copied from the example articles of incorporation\n\n== Public Disclosure of Information of Tax Exempt Organizations==\nA tax-exempt organization is required to provide copies of its three most recent information returns, its exemption letter, and its approved application with supporting documentation, without charge (other than a reasonable fee for any reproduction and mailing costs), to persons requesting copies (with certain exceptions), unless it has made these forms widely available by publishing them on the Internet in accordance with IRS regulations.\n\n== Submit an affidavit of publication to the ACC==\n\n===Annual Report===\n\nThis annual report must be correctly filled out and submitted by the assigned due date or the corporation may be administratively dissolved or have its authority revoked by the State of Arizona. According to A.R.S. §10-1622.F, penalties accrue on business corporation annual reports which are submitted late (starting the day after the due date). Corporations must use the annual report form prescribed by the Corporation Commission. No other format is allowed.\n\nAnnual Report Instruction Sheet: http://www.cc.state.az.us/divisions/corporations/annrpts/arinstruct.asp\n\n\n== Obtain Tax Exempt Status==\n\nBeing a non profit organization does not mean you are tax exempt. You have to file separately for this status.\n\n=== Must meet these requirements===\n\n*Must meet requirements set forth in the Internal Revenue Code\n\nNon-Profit Types and Requirements for Exemption: <br>\nhttp://www.irs.gov/charities/nonprofits/content/0,,id=132157,00.html <br>\nWe're going for a Charitible Organization --> 501(c)(3).\n\nTo be tax-exempt under section 501(c)(3) of the Internal Revenue Code, an organization must be organized and operated exclusively for exempt purposes set forth in section 501(c)(3), and none of its earnings may inure to any private shareholder or individual. In addition, it may not be an action organization, i.e., it may not attempt to influence legislation as a substantial part of its activities and it may not participate in any campaign activity for or against political candidates.\n\nOrganizations described in section 501(c)(3) are commonly referred to as charitable organizations. Organizations described in section 501(c)(3), other than testing for public safety organizations, are eligible to receive tax-deductible contributions in accordance with Code section 170.\n\nThe organization must not be organized or operated for the benefit of private interests, and no part of a section 501(c)(3) organization's net earnings may inure to the benefit of any private shareholder or individual. If the organization engages in an excess benefit transaction with a person having substantial influence over the organization, an excise tax may be imposed on the person and any organization managers agreeing to the transaction.\n\nSection 501(c)(3) organizations are restricted in how much political and legislative (lobbying) activities they may conduct. For a detailed discussion, see Political and Lobbying Activities. For more information about lobbying activities by charities, see the article Lobbying Issues; for more information about political activities of charities, see the FY-2002 CPE topic Election Year Issues.\n\n===Application Process Step by Step===\nhttp://www.irs.gov/charities/charitable/article/0,,id=96099,00.html\nhttp://www.irs.gov/pub/irs-pdf/f1023.pdf\n*Part I: Identification Information\n*Part II: You must organize with your state, and attach proof\n*Part III : Confirm Required Provisions in Your Organizing Document\n**1) Your articles of organization must contain a statement of your exempt purpose, such as charitable, religious, educational, and/or scientific purposes. \n**2a) Must contain statement that your remaining assets, upon dissolution, must be used exclusively for exempt purposes, such as charitable, religious, educational, and/or scientific purposes.\n*Part IV: Provide Narrative Description of your Activities\t\n**need an attachment, as a narrative, of our past, present, and future\n*Part V: Compensation and Other Financial Arrangements With Your Officers, Directors, Trustees, Employees, and Independent Contractors\n**Name, Title, Mailing Address, Compensation\tof all Board Members\n\n\n1023 Checklist\n*Form 2848 - if we want someone to represent us (we don't think we need or want)\n** AFAIK: This form gives someone else (company or person) the power to modify, file, and view our IRS information. We don't need this because by default (we think) the organization itself can file it's own taxes. The people we would have modify are it already are members.\n*Form 8828 - \n** AFAIK: This is a form that is similar to the previous but only allows read-only view of our information .. perhaps an attourney to check and look at your data or something. We don't need this because we don't need anyone else to look at our taxes except for those who file, which already have the power because they can file.\n*Expedite Request\n**Basically just a written request, but you must have extenuating circumstances\n**http://www.patrickmurphy.house.gov/index.php?option=com_content&task=view&id=37&Itemid=83#10\n*1023 Schedules A through H as required\n**I read through these schedules and we don't need to file these because we aren't a church or other stuff.\n*Articles of Organization- Organizing Documents [http://www.irs.gov/charities/charitable/article/0,,id=122729,00.html]\n*Amendments to Articles of Organization in chronological order\n*Bylaws or other rules of operation and amendments\n*Documentation of nondiscriminatory policy for schools, as required by Schedule B\n* Form 5768, Election/Revocation of Election by an Eligible Section 501(c)(3) Organization To Make Expenditures To Influence Legislation (if filing)\n**We may be eligible to influence legislature in certain situations, we DO NOT wish to pursue this\n* All other attachments, including explanations, financial data, and printed materials or publications. Label each page with name and EIN.\n\n===Costs===\n\nhttp://www.irs.gov/charities/article/0,,id=212562,00.html\n\nUser fees will increase for all applications for exemption (Forms 1023, 1024, and 1028) postmarked after January 3, 2010:\n\n* $400 for organizations whose gross receipts are $10,000 or less annually over a 4-year period\n* $850 for organizations whose gross receipts exceed $10,000 annually over a 4-year period\n* $3,000 for group exemption letters.\n\nA complete schedule of all user fees will be published in the annual procedure released in January 2010.\n\nCyber Assistant, a Web-based software program designed to help 501(c)(3) applicants prepare a complete and accurate Form 1023 application, will become available during 2010. Once the IRS announces the availability of Cyber Assistant, the user fees will change again:\n\n* $200 for organizations using Cyber Assistant (regardless of size) to prepare their Form 1023\n* $850 for all other organizations not using Cyber Assistant (regardless of size) to prepare their Form 1023.\n\nIRS will announce when Cyber Assistant is available and the effective date of the user fee change. Sign up for the Exempt Organization (EO) Update, EO’s subscription newsletter, at www.irs.gov/charities, to automatically receive an alert that Cyber Assistant is available.\n\n==BEFORE you fund-raise==\n*You must REGISTER in any state you wish to solicit (raise funds) in!! You also have to be careful soliciting on the internet. You must not target any specific state, and if you regularly obtain funds from a single state, you must register THERE too! Look into the Charleston Principles for guidance. NOTE: Even those Coldstone/Applebees/etc 10% nights are considered solicitation. \n\n*Look into UPMIFA - Restricted use of funds. If you solicit donations for a specific purpose, they LEGALLY have to be used for that purpose.  You may wish to be vague, or specifically itemize a bunch of stuff you intend to use the funds for, to allow you to spend your raised funds as you wish.\n\n*RAFFLES ARE VERY DANGEROUS in most states.  They're considered gambling, and therefore a CRIME, without the proper allowances.  In Arizona non profits are not allowed to raffle until they've been operating for 5 years.  Also note that directors officers, employees or agents are of the nonprofit are LEGALLY DISALLOWED from participating in a raffle.  Finally note that ONLY directors officers, employees or agents are of the nonprofit are allowed to administer the raffle, you may not hire any outside agents to do so.\n\n==Non-Profit Organization Upkeep==\n\n*Have a regular meeting with the whatever your bylaws/articles decide is necessary to proceed.  In Arizona this meeting does not have to be public. You CAN have meetings over email, with one BIG stipulation.  The only motions that can pass are by UNANIMOUS CONSENT, and everyone MUST explicitly reply to email with their vote.\n*Have at least 1 'annual' meeting, generally the anniversary of the incorporation and the meeting you hold elections\n*Have an agenda and set goals. Don't actually have to publicly post an agenda or notice requirements if your Bylaws or Articles don't specify it!  Also if your bylaws don't mention it the standare is a 24 hour notice to call a 'special' session in between regularly scheduled sessions.\n*Can have an Executive committee-- a small agile committee which acts when board is out of session (probably ~3 members for a board of ~10).  They keep another set of minutes.\n*Make people commit themselves to tasks. \n*Keep good minutes of meetings, these only need be posted in accordance with state compliance.\n*You're paying your professional's (lawyer and CPA, etc) Do NOT let them bully you.  Make them make you understand and keep asking questions.\n*Non profit Compliance--An organization will not be public nonprofit if more than a substantial amount (10-15%????) of its activities do not further an exempt purpose.\n\n\nANYONE can request\n*1023 (and attachments), determination letter(1023 acceptance),  all correspondence!(the letter that told us to fix stuff) and last 3 filed 990 and 990ts at any time (not including donors schedule (b?))\n*if in person, same day! per day($20/day capped at 10k per document) penalties!, \n*(can ASK reasonable copying fee, but can't withhold for payment)\n*request by writing 30 days compliance\n*don't have to comply if 'widely available' (on guidestar for instance)\n*also don't have to comply if harassment(ddos basically)\n\n\nMEMBERS (have been for at least 6 months, made in good faith, tell us why, and the records must be connected to the purpose) are able to demand:\n*Articles, bylaws, resolutions dealing with member rights, minutes for past 3 years,actions taken by committees, written communications to members for 3 years, names and business addresses of current directors and officers, most recent annual report(state corporation commission report), member agreements, accounting records, membership list, most recent financial statements (very broad discretion here...)\n*(no fines associated with non compliance)\n\n\nDIRECTORS \n*can request whatever document is necessary to fulfill their fiduciary duties(basically anything)\n\n==Links==\n\nHas good info about starting a non-profit in AZ and includes sample documents: <br>\nhttp://www.keytlaw.com/az/entities/nonprofits.htm \n\nA more brief overview of what must be done to become a tax-exempt non profit in AZ: <br>\nhttp://www.hurwitassociates.com/l_s_initial_az.php\n\nChange of statutory agent form: <br>\nhttp://corporations.azcc.gov/filings/forms/ll0006.pdf\n\nOther Hackerspace 501c3 information \nhttp://bitsmasher.com/wiki/index.php/Corporation_and_Tax_stuff\n\n== Notes ==\n===Form 990===\nWhat is a IRS Form 990?\nForm 990 is an annual reporting return that certain federally tax-exempt organizations must file with the IRS. It provides information on the filing organization's mission, programs, and finances. \n*Looks like it's like a 1040 (1040-EZ) (which is the home tax \"return\") but for non-profit businesses. It has a 990 and 990-EZ. The 990 is only for non-profits who have exemption status (are a 501(c)X (where X is a random number not the letter 'X')) with the IRS. We are not that, but will be. THEREFORE, we MIGHT need to file something else for for the year 2008 since we are not tax-exempt (can't file 990) we might need to file something else since we are an existing company in the year 2008.\n\nWhich organizations are not required to file Form 990?\nNonprofits that have not received tax-exempt status from the IRS.\n\nhttp://www2.guidestar.org/rxg/help/faqs/form-990/index.aspx\n\n===Verify Our Documents===\n\nGet a local IRS rep in Phoenix to look at our compiled documents.",
    "bytes": 26835
  },
  "revision_count": 42,
  "first_revision_timestamp": "2009-09-13T03:07:12Z",
  "is_redirect": false
}