{
  "title": "Tesla Coil",
  "ns": 0,
  "id": 219,
  "slug": "Tesla_Coil",
  "latest_revision": {
    "id": 4386,
    "timestamp": "2016-01-15T05:36:12Z",
    "contributor": {
      "username": "Jjrosent",
      "ip": null,
      "id": 14
    },
    "comment": "/* Photos */",
    "text": "=Project Synopsis=\nWe would like to build a tesla coil for the mustache laser party (and beyond!)\n\n== Results First! ==\n=== Photos ===\nhttp://www.flickr.com/photos/zgiles/5157397046/ <br>\nhttp://www.flickr.com/photos/teamdroid/5111039475/ <br>\nhttp://www.flickr.com/photos/teamdroid/5111638950/ <br>\nhttp://www.flickr.com/photos/teamdroid/5111640714/ <br>\nhttp://www.flickr.com/photos/nebarnix/5101761518/ <br>\nhttps://www.flickr.com/photos/hslphotosync/6245219883/\n\n=== Videos ===\nhttp://www.youtube.com/watch?v=q17jW9Azok0 <br>\nhttp://www.youtube.com/watch?v=xoqYndAUuE0 <br>\nhttp://www.youtube.com/watch?v=Stf0R-ejJO8 <br>\n\n==Design Summary==\n\nTraditional Basic Tesla Coil Configuration:<br>\n[[File:basictc.jpg]]\n\nOur configuration:<br>\n[[File:Our_coil.png]]\n\n==Estimated Voltage Output==\nThe energy in the cap bank is 1/2 *C * V^2 when the spark gap fires. \nFor our capacitor bank and a 12KVRMS transformer that will be 0.5 * 35nF * 16968V^2 = 5joules\nAssuming that the energy is coupled 100% to the secondary, which it will not be, the voltage gain can be calculated using the same equation on the secondary capacitance; A 16\" pumpkin has a free space capacitance of 45.607pf.\nSolving for voltage using 5 joules, we now get:\nE = 1/2 *C * V^2 \n5 = 1/2 * 45.6pF*V^2 \nV = 468,292 Volts \n\nBallpark estimate as electric field shape and coupling to everything in the room will cause shifts from the ideal case. \n\n=Components=\n\n==Secondary Coil==\n\n:A secondary wound on an 8\" piece of green PVC is already available for use. Actual coil measurements are 6.25\" diameter, 22\" high, and approx 28turns per inch.\n\n\n==Primary Coil (Harry)==\n:A flat inductor used as a resonator within the LC tank circuit which is magnetically coupled to the secondary. Needs to be tuned with the main capacitor to the resonant frequency of the secondary LC circuit.\n\n====Build Notes====\n'''Acquired Materials:'''\n::*50' of 1/4\" copper tubing (Lowes ~$25). \n::*A large 20\"x12\" HDPE kitchen cutting board (Frys $10) \n::*10' of 3/8\" copper tube for strike rail (Lowes $12)\n::*Medium battery clips for tapping point connection (Lowes $3)\n::*2 ft square of plywood to mount. (Jasper)\n::*6 x 1/4\" nylon nuts and bolts for strike rail (Lowes approx $4.86)\n::*12 x zip ties\n::*Black spray paint\n\n:'''Notes:''' See [http://deepfriedneon.com/tesla_f_primary.html DeepFriedNeon] Primary Coil Page for example with images.\n\n:Cut the cutting board into six 20\"x1\" strips and drilled with 5/16\" holes at .75\" intervals for coil support rods.\n\n:To wind the copper tube through the rods place the tubing on a flat surface and arrange the tube into an approximation of the coil first.Then working from the innermost end of the coil and the outermost hole of the rods, thread the rods around the tube. It's important to pay attention to the inner ring diameter. This method may expand the inner diameter as you turn. \n\n:An additional series of holes were added to allow the creation of a strike rail to absorb any stray streamers that might hit the primary and damage the primary circuit components.\n:For the strike rail cut off excess length of support rods, leaving 1 extra hole, turn perpendicular to the rest of the rods, and drill a 3/8\" hole for the copper tube. Attach these smaller rods to the main supports with nylon nuts and bolts through the extra hole in the end of the support rods.\n\n:In the plywood: holes drilled at locations around the plywood to zip tie the support rods down, 1 hole for the primary connection, and a center hole for secondary coil ground wire.\n\n:'''Measurements:'''Inner Diameter 11\", Turn spacing .5\", Number of Turns 10\n\n==Transformer==\n<div style=\"text-indent:75px\">\nA 12KV 30mA neon sign transformer and an 12KV 60mA transformer are available for use. \n\n====Building Notes====\n\nWe killed the 12KV 60mA NST after about 10 seconds of total use and the protection inductors shorted and caught fire. A very old unit, the tar is very dry. Its not surprising that it died. It was depotted and brought back to life. An oven re-heat killed the shorted coil again, though a tar-paper unwrap and fishing out some broken windings brought it back again. The output current was increased to ~123mA by knocking out some of the magnetic shunts and the whole thing was submerged in mineral oil. An additional \"kick in the ass\" by connecting to a 27nF capacitive load revealed a weak spot near the short in the form of a nice fat explosive arc. After some short circuit testing revealed small luminous discharges between adjacent winding layers, it was decided to sever the top winding layer as there appears to be a short to the core somewhere in the layer. The second winding layer was used as the output sacrificing a small amount of voltage. The transformer showed no corona or arcing either with the capacitive load nor under tesla coil conditions. \n</div>\n\n\n==Spark Gap (Jasper)==\n<div style=\"text-indent:75px\">\nDischarges the energy stored in the main capacitor into the tank circuit. Forms the trigger for the relaxation oscillator once the capacitor charges to a specific voltage. \n\n====Materials needed====\n10x 1/2\" to 1\" copper pipe sections attached to a flat surface lain in parallel to form multiple small gaps of 1/8\" to 1/4\". Tuneable to using aligator clips to select different sections of pipe.\n\nAligator clips\n\n'''Note: Zach has supplied 2ft of 1/2\" copper pipe.'''\n</div>\n\n==Main Capacitor==\n<div style=\"text-indent:75px\">\nStores energy until a certain voltage is reached, then discharges through the main spark gap and sets up a resonance between the primary coil. \n\nAn exponentially decaying RF waveform is produced until the energy is dissapated, recharging begins at the next 60Hz peak (discharge is therefore at 120Hz). \n\nWe already have a 30nF 35KV maxwell pulse capacitor designed for high frequency use. \n</div>\n\n\n==Protection Inductors (Jasper / Paul)==\n<div style=\"text-indent:75px\">\nProvides a high impedance to RF in order to contain the RF within the tank circuit. Allows 60hz to pass unimpeded. \n\n====Materials needed====\nMagnet wire and wooden dowel. Target 10mH. Separate winding layers with an insulator to keep arcs from forming between the input and the output (which will have kilovolt potential differences)\n\n'''Note: Will has supplied dowels of about 1/2\" dia. left near the lathe, and Zach has magnet wire on the floor near the lathe. Zach has supplied 3ft of 5/8\" dowel as well.'''\n\n::question: how many winding layers of how many turns each?\n:::As many side-by-side turns as you can fit in a 4 inch length, make three layers and measure the inductance. We will go from there!\n\n====Building Notes====\nThe original inductors actually melted and caught fire during the first wave of 100% power testing for the tesla coil. 26 AWG magnetic wire per pound was $18 and each roll has a total inductance of 163mH. These should make very nice chokes as long as they don't start arcing. If they do, they can be submerged in mineral oil or vaseline.\n</div>\n\n\n==Protection Capacitors (Jasper)==\n<div style=\"text-indent:75px\">\nThese shunt any RF energy that passes the RF chokes to ground instead of injecting it into the transformer secondary. \n\n====Materials needed====\nTwo Old English 800 beer bottles, salt water, AL foil. \n'''Note: Jeremy Leung has supplied two OE 800 bottles'''\n</div>\n\n==Protection Spark Gap (Jasper)==\n<div style=\"text-indent:75px\">\nA simple tunable spark gap consisting of a grounded middle section with a gap on either side to each leg of the transformer's differential output. \n\n====Materials needed====\nThree pieces of threaded rod, 1 to 2\" long and polished as round as possible (to provide an even E field and predictable breakdown voltage). \n\nSet each into a small wooden slat and use the threaded nature of the rods to tune the gaps. Or something like that. \n\n::Question: please elaborate on the construction/arrangement of the pieces, I.e. what do you mean by slat, how should the threading work, where do the rods go in relation to each other.\n::: All three pieces will be end to end with a support in the center of each piece and a gap between the sections. The support will have a hole in it to match the rod, \n:::so that it may be adjusted back and forth simply by rotating. It might make sense to center and tightly affix the centeral section. \n\n'''Note: Zach has supplied 1/4\"-20 threaded rod.'''\n'''Note: Jasper has finished the protection spark gap as of 10/10/2010'''\n</div>\n\n\n==Discharge Terminal (Paul)==\n<div style=\"text-indent:75px\">\nA smooth conductive surface to use as a capacitor in the LC secondary resonator assembly. A jack-O-electrons. Let's carve a freakin' pumpkin!\n\n====Materials needed====\nPumpkin, knife, evil\n</div>\n\n=Future Plans/Wish List=\n#Rotary gap\n#More precise resonance tuning\n#1000pF doorknob caps to replace OE800 bottles\n#ebay more Maxwell/GA pulse caps ... just because\n#Keep the OE800s anyway because they're classy.\n#Stomp box ON/OFF switch\n#Mains filter to protect house wiring\n#Non-pumpkin top load\n#Pole Pig!! \n#Solid State Coil \n#ArcAttack-style Solid State Musical Driver\n\n\n=Reference=\nDeep Fried Neon - Tesla Coil Design, Theory and Construction<br>\nhttp://deepfriedneon.com/tesla_start.html\n\nSteve's High Voltage - Steve Ward, inspiration for the band ArcAttack<br>\nhttp://stevehv.4hv.org/\n\nWireless World - March 1995 - by Malcolm Watts<br>\nhttp://www.scribd.com/doc/12711857/tesla1\n\nHow Tesla Coils Work by Chris from The Geek Group:<br>\nhttp://www.youtube.com/watch?v=W_7fgcnzhmw\n\nand\n\nA Little Bit More In Depth on Resonance and Tesla Coil Basics by Chris:<br>\nhttp://www.youtube.com/watch?v=fT5_MmeSeDU&NR=1",
    "bytes": 9607
  },
  "revision_count": 54,
  "first_revision_timestamp": "2010-10-08T17:19:13Z",
  "is_redirect": false
}