{
  "title": "Tool Acquisition HOWTO",
  "ns": 0,
  "id": 1066,
  "slug": "Tool_Acquisition_HOWTO",
  "latest_revision": {
    "id": 4505,
    "timestamp": "2018-09-28T02:57:18Z",
    "contributor": {
      "username": "Meznak",
      "ip": null,
      "id": 48
    },
    "comment": "/* The responsibilities of a Machine Champion */ Update tool proposal requirement per HYH 20180927",
    "text": "'''WIP'''\n\nSo you have an idea for some really neat tools or equipment that you think the lab should acquire? EXCELLENT! Now for the hard part: making it happen.  This is a multi-step process, with few hard and fast rules. But this guide here aims to walk you through the best practices of going about this, so you have no more headaches than are absolutely necessary.\n\n\n== The responsibilities of a Machine Champion ==\n\nTool purchases are an important part of furthering that goal by expanding the arsenal by which we can make and educate. As much as possible, responsibility to Make Stuff Happen is placed on all the individuals that make up our community. So if you want to see something happen (for our purposes, getting some equipment), then YOU need to take upon yourself the mantle of Machine Champion.\n\n''The Machine Champion is just a name for whomever '''Gets It Done'''.'' Your responsibilities as an MC are to:\n\n# Share your vision of how this can make the space a better place.\n# Research everything there is to know about the machine, and share your knowledge.\n# Lead the discussion of the pros and cons of getting the machine. \n# Make sure all questions and concerns are addressed.\n# Make the final proposal for members to vote upon.\n\n\nA proposal is necessary if you want to use HeatSync funds for purchase or if the new tool or equipment uses more than four (4) square feet of space.  For the purpose of this procedure “tool or equipment” includes tables, permanent displays or anything else that would take additional space. A proposal must be submitted one week in advance of the next Hack Your Hackerspace. After a week of discussion on the mailing list, ideally all concerns have been raised and addressed, and it can simply be put to a vote. Any lingering doubts will almost certainly be raised before the vote, so it is important to be present to answer any questions the day the proposal is voted upon. If you have done your job correctly, everyone in the community will have had their concerns addressed before then, and it will simply be approved.\n\n== Financing And Purchasing the Machine == \n\nBefore answering the next set of questions, review your options. There are \nseveral:\n\n# Donation. A sponsor or individual member could purchase and donate the entire machine. \n# All HeatSync Funds: Use money from the HeatSync budget to pay for the entire cost.\n# Crowd-Funding: Pool everybodies resources! Thats the point of a community like this after all \n\n\nCrowd-funding is often the best way to finance a very large purchase. You can do it entirely through a crowdfunding site like Kickstarter or IndieGoGo. Or you can use a combination of member and sponsor contributions and HeatSync funding. This method is known as SyncStarter.\n\nThe important thing to remember about SyncStarter is that it is a pretty general term for combining member and sponsor donations with HeatSync general funds. There are not actually any hard and fast rules for how a SyncStarter works. IIn order for a SyncStarter fundraising effort to succeed, YOU must decide what the best crowd-funding model is for this particular purchase, and decide the specifics. The specific mechanisms for how the funding will work must all be there in the proposal! \n\nFor best results, make sure the proposal is specific about:\n\n# How much money must come out of the general HeatSync funds.\n# What happens if fundraising efforts fail\n# How future upkeep and maintenence will be paid for.\n\n\nAn example proposal: \n\n<blockquote>\nI propose that HeatSync labs purchase _____ for the total price of $____ to be paid with $____ from the general funds and the rest from donations collected from individual donors. If sufficient funds cannot be gathered through donations by ____ date, all donations will be refunded and the machine will not be purchased.\n</blockquote>\n\n== Submitting the Proposal, and the Vote == \n\nWhen your proposal is ready, submit it on the discussion group with a title \nstarting with “PROPOSAL” in all caps. Make sure it is posted at least one \nweek in advance of the next Hack Your HackerSpace event. Continue to answer \nquestions and address concerns. Get with the Treasurer and get some hard \nnumbers about where the lab stands financially. \n\nAt the Hack Your Hackerspace where the proposal will be voted upon, be sure \nyou are there to answer any last lingering questions, which will almost \ncertainly include a request for the current state of HSL finances. Then the \nvoting members will vote, and if everyone shares your vision and all \nconcerns have been addressed, then it is almost certain to be approved. \nAfter all, we like shiny new tools!\n\n== Questions that need answers ==\n\nTo guide your research and discussion with the community, the following are questions that should be addressed. You don’t have to find the answers to them all by yourself. After all, the wide range of skills and expertise in our community is what makes us so great! But it is important that all these questions have satisfactory answers. \n\nRemember that, ideally, the MC has found satisfactory answers to all the below questions and other issues raised before the proposal is voted on.\n\n==== The Big Picture ====\n\n* What equipment is it you want to see added to the lab?\n* What capabilities does this equipment give us?\n* How does this equipment further the goals of HeatSync lab?\n* Are you passionate about the possibilities this equipment opens up? Why?\n\n==== Available Lab Resources ====\n* What safety risks does the machine pose?\n* What space is there within the lab available to store and operate it?\n* What sort of power is available to run the machine?\n* What space is available to store additional accessories and materials?\n\n==== Machine Specifics ====\n* What machine (make, model, etc) do you propose we get?\n* What other alternative models are available?\n* What makes the chosen machine the best option for the lab?\n* What specific safety risks apply to that specific machine?\n* How much space does the machine occupy?\n* How much space must there be around the machine to operate it safely?\n* Can the lab provide the necessary power to run that machine?\n* What accessories, additional equipment, and consumable materials will be  necessary to use the machine effectively and efficiently?\n* Where will additional accessories, equipment, raw materials, etc be stored?\n* What sort of training might members need to use the machine correctly?\n* What safety rules may be necessary in using the machine?\n* Who would provide any necessary training on the machine?\n\n\n==== Can We Afford It? ====\n* How much does the machine cost?\n* How much do additional accessories, tools, and raw materials cost?\n* What is the total cost of the machine with all necessary accessories, tools, and raw materials for members to begin using the machine?\n* What funds are currently available for use towards purchasing this machine?\n* Are there other large purchases on the horizon that may require some of the available funds?\n* Are there any competing financial priorities besides spending money on this machine?\n* How important is purchasing this machine in comparison to other financial priorities?\n* Where might this machine purchase fit into the long-term financial goals of HeatSync Labs?",
    "bytes": 7272
  },
  "revision_count": 6,
  "first_revision_timestamp": "2012-12-04T21:43:19Z",
  "is_redirect": false
}