{
  "title": "Ultimaker Quickstart Guide",
  "ns": 0,
  "id": 982,
  "slug": "Ultimaker_Quickstart_Guide",
  "latest_revision": {
    "id": 5342,
    "timestamp": "2022-09-20T17:28:43Z",
    "contributor": {
      "username": "Eric Ose",
      "ip": null,
      "id": 681
    },
    "comment": "",
    "text": "'''<span style=\"color: green  \">The Ultimaker 1 *IS* working! THANK YOU ERIC WOOD! </span>'''\n\n'''<span style=\"color: green  \">The Ultimaker 2 is working! </span>'''\n\n'''<span style=\"color:#009900\">The <s>Coocheer</s> Choocher (Prusa i3 clone) is working!</span>'''\n\n=I WANT TO USE THE UM2=\n'''Are you familiar with the Cura workflow? Skip down to [[#Common Issues]]'''\n\nThe Ultimaker 2 is our wonderful fancy Dutch 3D printer. Due to increasing globalization and lost traditional \nvalues, the UM2, much like their shoes, is no longer made of wood as it used to be.\n\nWe are currently using Cura for our slicing, because its quick and easy to use. If you get more into 3d printing \nyou will find that using another program, such as Repetier host, will give you more control over the parameters \nof the slicing than Cura does.\n\n== Getting your STL ==\n\nIf you're downloading your model from [http://thingiverse.com Thingiverse],\nit'll probably have an STL file available. If they don't, match their file\ntypes with the sections below, or [http://google.com ask the internet].\n\nIf you have your own file say from Solidworks or Autodesk Inventor, make sure \nyou export it as an .stl. you can then load it onto a flash drive and bring it \nover to the 3d printing station computer. Another way to move the file to the \n3d printing computer from your own is using the shared file network that we \nhave at the lab. If you are going to use the shared file network i would \nrecommend making yourself a folder in this location \\\\files\\shared\\users. Once \nyou are logged onto the Wifi you can export your files onto our shared network \nby exporting them to \\\\files\\shared\\users\\\"your name here\". using the file \nnetworking can save you a lot of time if you are editing your file and checking \nit on the 3d printing computer.\n\nThe Ultimaker slicing programming (Cura) will only import STL files\ncurrently. Getting STLs out of your program of choice depends on your program\nof choice. If yours is not documented [http://google.com ask the internet] and\nthen document it here.\n\nPlace your downloaded STL on the HSL 3D Printing Station Computer in the\nDownloads/ folder, in a directory with Your Name. Files floating around freely\nin Downloads will be mercilessly deleted.\n\n=== OpensCAD (*.scad) (0$) ===\n\nOpenSCAD natively exports STL files after building. Construct your model, and\nthen go to the Design menu and hit \"Compile and Render (CGAL)\". After that,\nhit the \"Export as STL\" option in that same menu.\n\n== Slicing with cura ==\n\nSlicing is what turns the STL model (consisting of a list of the triangles in\nthe model), into a list of commands that the printer understands. This list\nis called [http://linuxcnc.org/docs/html/gcode/overview.html GCode].\n\n* Open the model in Cura by double clicking on it\n* Here you can rotate, move, and resize the model,\n** Your model will print as it appears in the build preview. Make sure that \nit is centered and on the build platform, laying flat, using the move, rotate \nand resize tools.\n* Cura has many helpful view modes, available in the upper right corner of the \nscreen\n** 'Layers' allows you to preview how it will print, layer by layer, showing \nshells, fill, support, etc. in different colors\n** 'Overhang' highlights overhanging areas in red, suggesting the need for \nsupport\n** 'Normal' allows for resizing and rotating the object\n* Click the \"Save Toolpath\" button (floppy disk icon) to save the gcode to the \nSD card.\n\n=== Adjusting print profile settings ===\nIf your just printing a bracket or something simple with no overhangs, the \nstock settings will work fine. However If your printing something like a \nskeleton or a small model of a person, you will probably need some custom \nsettings to make it work right. A good rule of thumb is anything that is \norganic in shape or has overhangs will need some custom cura settings to \nwork.\n\nThis is an example of the type of 3d print that will need custom settings.\n\n[[File:isis-one-desktop-3d-printer-5.jpg|left]]\n<br clear=\"all\"/>\nIf those defaults don't make sense to you for some reason (You're printing a\nstructural piece for example and need a stronger infill) you can adjust the\nsettings, but realize that will probably affect print time and final weight and \nwill make Moheeb cry.\n\nIf you do modify the print settings make sure you switch back to 'quick print' \nwhen you are done.\n\n\n== 3D Printing Station Donations ==\n\n* While we dont charge to use our printer(s), some people choose to donate a \nfew dollars whenever they print things so the lab can get more plastic for \nthe printer and maintain it. You can also donate a roll of 3mm filament of any type!\n\n== Getting GCode on the Printer ==\n* Pull the SD card out of the front of the UM2 and put it in \nthe computer\n* In Cura, Click the \"Save Toolpath\" button (floppy disk icon) to save the \ngcode to the SD card.\n* Press the eject (up arrow) that just popped up at the bottom of the screen to eject the SD card\n* Put the SD card back in to the printer.\n\n== Print ==\n\nWe use hairspray to make PLA stick to the bed, and gluestick to make ABS stick to the bed. \n\nPLEASE DO NOT USE ABS JUICE AS THIS MAKES A DISASTER AREA OF A MESS\n\n* Push the button to get in to the menu\n* Navigate to \"SD Card Menu\" and push the button\n* Navigate to your print and push the button\n\nThe machine will zero itself and begin heating the machine for the print. When\nit has reached temperature it will begin printing.\n\n== Oh noes! ==\n\nWhen something goes wrong on your print, don't panic, even if the heated\nnozzle is crashing in to the Heated glass build platform.\n\n=== Stop the Print ===\n\nIf it's not a \"HOLY SHIT THE MACHINE IS BROKEN/REPRODUCING\" issue, i.e. your\nprint messed up or the hot end stopped extruding, you can just stop the print.\n\n* Scroll the button to 'Tune'\n* Scroll the button to \"Abort\" and press the knob\n\nYour print will stop within 30 seconds and you can peel your failed print off.\n\n=== KILL IT WITH FIRE ===\n\nIf something is going haywire, i.e. the machine has generated a small \nmushroom cloud, is crashing uncontrollably, or has started to make another \n3d printer on its own, shut the machine off using the switch on the right side \nand move the bed down, by spinning the large screw under the bed counter \nclockwise, then you can push the head out of the way by hand. If the machine \nis not in order to print after this, don't worry unless its trying to make \nanother printer, please make a note, place it on the bed, and inform PBorJ ASAP \nso we can get the printer back in working order again.\n\n== Cleaning Up ==\n\nNow my favourite part, when you're done, clean up the build area, deposit any excess \nplastic into a trashcan, it was once believed you could reuse the plastic and make \nit into new filament, this is not true unfortunately. Do three cartwheels \nand clap your shoes together in the air. Make sure the machine is turned off, and \nyou're done. \n\n== Common Issues ==\n* If you cut the filament flat when loading it, it will sometimes catch at the exit of the bowden tube. To avoid this, please cut the filament at an angle, to make a shape that looks like a sharpened pencil. This will guide the filament around the shoulder and reduce your frustration.\n* If you pause before you abort, the filament will retract twice. This is a known bug. \n**If this happens, you can either start a print and wait for the filament to come out, knowing you will need to abort said print and start it again WITHOUT pausing first\n** Or you can just reload the filament.\n\n==If the machine doesn't go goodly==\n# Read the above common issues first\n# Reload the filament once, twice, even maybe three times if you think it might help\n## Make sure to check for filament breakage. If the filament breaks inside the bowden tube, see next step\n# At this point, please email PBnJ (contact info is on the sign)\n* The machine is rarely actually clogged. Please **do not** take any actions beyond reloading the filament.\n* DO NOT REMOVE THE HOTEND SCREWS\n* DO NOT ATTEMPT TO INSERT SMALL OBJECTS INTO THE NOZZLE (EVER)\n\n[[Category:3D-Printing]]",
    "bytes": 8086
  },
  "revision_count": 46,
  "first_revision_timestamp": "2012-08-15T01:00:43Z",
  "is_redirect": false
}