{
  "title": "User:RobertBushman",
  "ns": 2,
  "id": 1291,
  "slug": "User_RobertBushman",
  "latest_revision": {
    "id": 5402,
    "timestamp": "2022-09-28T01:28:57Z",
    "contributor": {
      "username": "RobertBushman",
      "ip": null,
      "id": 713
    },
    "comment": "/* Integrity */",
    "text": "= On HeatSync Labs =\n\nI believe in advancing the following characteristics of HeatSync Labs, until I hear better ones.\n\n== Vision (Why) ==\n\nHacking is the art of discovering what is possible by doing it. At HeatSync Labs, we gather together to hack.\n\n== Mission (What) ==\n\nAt HeatSync Labs, we create an environment that gives people joy in making.\n\n== Principles (How) ==\n\n=== Integrity ===\n\nHeatSync Labs does good on its own terms. We hope people and orgs will recognize that and support us. We do not pander to money. Our benefactors support us because we serve our mission, not to entice us to serve theirs.\n\n=== Honesty ===\n\nHeatSync Labs is open and honest about what we do and where we are going. We encourage our community to join in and work with us to open new paths forward.\n\n=== Positivity ===\n\nAt HeatSync Labs we strive to create a positive, welcoming environment and to communicate respectfully.\n\n=== Growth ===\n\nHeatSync Labs provides an important service to the community. The more people we reach, the more good we can do. Growth helps us to fulfill our purpose.\n\n== Operations ==\n\nIn October 2022 I intend to run for the Operations position on the board. I've noticed a few opportunities to improve that I'd like to work on for the next year.\n\nWe have people who come to the org who want to help out, but don't have a strong way to onboard them into volunteer opportunities. We have a lot of things that people want improved, but they're vague and not documented. We have different people with all the needed skills to make a team, but no good pipeline for getting together. And we have developed some unhealthy habits in how we express criticism toward people who are trying to help.\n\nOver the coming year I will attempt to develop our ability to execute on operational projects, especially those that work best with more than one person working together.\n\n=== Main Objectives ===\n* Identify projects that would benefit HeatSync Labs.\n* Create a simple project tracking system.\n* Recruit people to act as project leads.\n* Help project leads to gather initial requirements.\n* Help project leads to build a team to execute.\n* Track, guide, and encourage project teams.\n* Advocate for project teams and celebrate their accomplishments.\n* Encourage the community to help build project team pride.\n* Manage naysayers to make criticism less disruptive.\n\n=== Team Project Examples ===\n* Member Database Upgrades\n* Vetting a Potential New Building\n* Developing a New Class\n* Team Build: Make something complex.\n* Event Planning: Host something big.\n* Revenue Growth: Deploy a Point of Sale at the Lab.\n\n== Summary ==\n\nIn October 2022 I will run for the Operations position on the HeatSync Labs board. I intend to develop our ability to execute on operational projects and to foster a vibrant, positive, and growing hackerspace.",
    "bytes": 2840
  },
  "revision_count": 21,
  "first_revision_timestamp": "2020-09-14T10:09:46Z",
  "is_redirect": false
}