{
  "title": "User:NohbdyAhtall",
  "ns": 2,
  "id": 1713,
  "slug": "User_NohbdyAhtall",
  "latest_revision": {
    "id": 6676,
    "timestamp": "2025-03-18T03:23:48Z",
    "contributor": {
      "username": "NohbdyAhtall",
      "ip": null,
      "id": 727
    },
    "comment": "Major edit, gist as origin",
    "text": "<!-- NBD-HSL-Wiki-NBD_UserPage.txt ~ Find at https://gist.github.com/NohbdyAhtall/0b947db040c8b5a7a7856bfa664c188e -->\n= Nohbdy Ahtall / Ryan =\n[[User:NohbdyAhtall|☯Nohbdy Ahtall🪷]] ([[User talk:NohbdyAhtall|talk]]) 20:23, 17 March 2025 (MST)\n== Self-Descriptor ~ v202517-01 ==\nMulti-faceted ideastormer ~ technosolutionist ~ game programmer / developer / club-founder(GPDMCC).</ br>\n\n\n= Makerspatial Mayhem =\nM(h)a(c)ker-Spatial MayHum / Makerspatial Mayhem\n\n== NBD-HSL ==\ntoRename? Here is where HSL-given tools, games, snippets, assets, etc would be given to HSL as created by [[User:NohbdyAhtall|☯Nohbdy Ahtall🪷]] ([[User talk:NohbdyAhtall|talk]]) 20:23, 17 March 2025 (MST) .</ br>\nNote: It is very likely that all creations are created outside of HSL, first, and have a primary source that is more permissively licensed(if not public domain) than what HSL might prefer to have(i.e. I may prefer CC0 over CC-BY-..etc, or 0BSD over MIT).</ br>\n\n=== Programs ===\nSee StormVolex programs.\n\n=== Projects ===\nSee StormVolex projects.\n\n==== Ideastorming ====\n* Digital Twin, core + addons + HSL-specificity\n* Ping\n\n\n== StormVolex ==\ntoRename? Here is where \"HSL-like\" tools, games, snippets, assets, etc would be created, the name implying relevance to HeatSync Labs, yet with intent to avoid utilizing the same namespace, trademark, etc. This is probably where most pre-NBD-HSL items would go and remain at their core, if not elsewhere.\n\n=== Programs ===\n* [[https://github.org/stormvolex/svx-ui.git \"SVX-UI - A Godot-based Graphical User Interface\"]]\n* ...\n=== Projects ===\n* ...\n==== Ideastorming ====\n* Digital Twin, core functionality\n* Digital Twin, plugins/addons/extensions\n\n== Other ==\nNohbdy may be working on ideas outside of either of these domains; even StormLine Creatorship is technically meant to be outside the domain in the sense that it would be relevant to all HSL-like endeavors such as Hackerspaces. There are still likely a bulk of useful tooling, projects, ideas, etc that are not \"HSL-like\" which make up components, sub-components, packages, and package groups that in-turn empower StormLine Creatorship, which in-turn empower NBD-HSL, which in-turn empower HeatSync Labs.\nNohbdy is particular at trying to create in a way that is for all of humankind, life, nature, etc and does not wish to work in reverse. See [todo][section explaining Nohbdy's views on Intellectual Property or why I choose public domain, extreme open-source, etc]\n\n----\n\n= Check This Out =\nCheck these resources, links, videos, etc out.\n== Game Programming and Development ==\n* Godot Engine\n* GDSCript\n=== Game Programming ===\n* GDScript\n* C++\n* Zig\n* Julia\n* Ruby\n=== Game Design ===\nSee GDD.\n==== Game Design Document (GDD) ====\n* Studio Blue's Game Design Document(GDD) + my Obsidian-friendly markdown template from that.\n* ...\n\n== Mob Programming ==\n* Mob Mentality YT Channel\n* ...\n\n== ClubDev ==\nClub Development, or ClubDev, is the development of clubs, phyles, guilds, and so on utilizing game development(GameDev) techniques and mindsets.</ br>\nsee GPD concepts below in regards to the GPD template </ br>\n\n== Cyberspace: Cybercivilization ==\nNote that \"civilization\" isn't always a positive concept\n\n== eSports ==\neSports has valuable ideas in regards to training techniques and scenarios, enhancing the potential of gaming sessions and teamwork tactics for all manner of \"multiplayer\" concepts. Such ideas to integrate the skills learned in eSports include: voting, phonetic call-outs, comms systems, standardized\n* Also see Mob Programming for eSports inspiration.\n\n=== eSports combined with GameDev ===\nAlso see: \n* Gaming + GameDev, \n* Gaming-as-GameDev, and \n* GameDev-as-Gaming.\n\n== Play, Ludos, Gaming ==\nThe concept of play, or ludos, in general.\n* ...\n\n== Game-Based Learning/Training ==\nThe techniques of using games and gaming itself to teach and learn-from. I'm particularly interested in self-contained teaching, but also of multiplayer and mob-programming-style situations.\n* ...\n\n== Gamification ==\nIncentive-based systems, which are vital to all manner of activities, and in fact exist invisibly whether they are \n* ...\n\n== Autonomous Drones/Quadrotors ==\n* ...\n=== Construction with Quadrotors ===\n* ...\n=== Aggressive Quadrotor Maneuvers ===\n* ...\n=== Assorted ===\n* ...\n== Autonomous Construction ==\n* Major interest[HSL, OSE, PPJ]\n* ...\n== Autonomouse Other ==\n* ...\n\n\n= R Projects and Programs =\nRyan's (i.e. \"R\") projects, programs, and so on.</ br>\n== GPD, GPDMCC, Game Programming & Development ==\nA club, phyle, and/or template for other clubs. GPD and GPDMCC tend to refer to the club I founded in 2014.</ br>\n\n=== GPD as a ClubDev Template ===\nThe goal of GPDMCC is to build up a template or \"starter-pack\" of sorts, for others to create their own clubs. Since GPDMCC will likely be outputting public domain knowledge, information, and tools for others to start their own clubs. It is also planned that there is a sort of internal network of sharing, where a threshold of aligning to each-other opens up more direct communication and sharing. (Threshold_Example): Assuming GPDT for the template, GPDMCC for my club, and GPDMPE for a Money, Profit, and Employment focus there may be reason(or not) for GPDMCC and GPDMPE to disconnect from the network. An example being that GPDMPE has been focusing on \"making money\" but without relying on intellectual property or paywalling members, but once they cross the threshold of making changes that embrace those concepts, GPDMCC and neighboring clubs disconnect GPDMPE from the \"network\" of shared comms, asset workflow access, donation fund streams, or anything of that nature. It needn't imply a negative disconnect, but is possible\n* ...\n\n=== GPDMCC ===\nhttps://GPDMCC.org/ An opinionated GPD club with my own biases and variance.</ br>\n* ...\n\n== MD0 License ==\nhttps://gitlab.com/GPDMCC/MD0 - A license modified from CC0.\n\n----\n\n= Membership-A =\nMembership details of myself.\n== Membership Status ==\nisMember: Yes, Basic $50 Member</ br>\nmemberType = \"Basic Member\"</ br>\n\n= Tracker/Log/Contributions =\nTrackers, logs, and contributions.\n== Food-Drink Take-vs-Donate ==\n* EXPERIMENTAL, ignore until ready, but feel free to peruse what I'm trying for.\nKey: (Dn:Donated, Tk:Took, N:None)\nDonated = \"I dontated more than I took\" Took = \"I took more than I donated\" None = \"Nothing taken nor donated\".</ br>\nIn cases where more than ~$5 worth is taken or donated, it may be shown as Dn(15), Tk(5), etc.</ br>\nI tend to look up the prices of the item I'm taking before doing so.</ br>\n202503 to 202504</ br>\n0304: ; 0305: ; 0306: P; 0307: N</ br>\n\n== Cleaning & Usage ==\n* EXPERIMENTAL</ br>\nHave I cleaned more than I've dirtied: Yes</ br>\nDetails:</ br>\nHave I donated more than I spent?: Yes, as of 2025 12:20, 8 March 2025 (MST) </ br>\nDetails: See #Food-Drink Take-vs-Donate\n\n= MetaData =\n* EXPERIMENTAL< /br>\n== Membership-B\nLongest Membership Streak: 2025-\nmember\nmembeshipDurationTotal: <1 month\nmembershipDurationStreakRange: 2025-03-04 to Present\n\n== DetaMata ==\n* EXPERIMENTAL\nrnd-tbd\n= test_zone-a =\ntst<br />\nhttps://github.com/heatsynclabs\n== test_zone-a-01 ==\ntst->tst\n[ColumnStuff](https://www.w3.org/TR/css-multicol-1/)",
    "bytes": 7222
  },
  "revision_count": 3,
  "first_revision_timestamp": "2025-03-07T22:57:17Z",
  "is_redirect": false
}