{
  "title": "Walk Through Orientation",
  "ns": 0,
  "id": 397,
  "slug": "Walk_Through_Orientation",
  "latest_revision": {
    "id": 6747,
    "timestamp": "2025-10-03T16:51:07Z",
    "contributor": {
      "username": "Jaymcgavren",
      "ip": null,
      "id": 731
    },
    "comment": "Clarify \"Where to Find Things\" heading",
    "text": "It's very important that we train everyone similarly, in a culture of cleanliness, do-it-yourself, and safety otherwise the hackerspace can go to hell quickly.\n\n== Greetings, Humans ==\n* Talk briefly about what the new members are interested in.\n** Tools they want to use, projects they want to build, classes they want to take\n** Discuss ways they may want to volunteer and mention [[Hosting#Co-Hosting | co-hosting]] as a good entry point\n* Let this help guide the discussion\n* Recap these points at the end\n\n== Important things ==\n* Encourage new members to be familiar with the following;\n** Wiki; [[Main Page]], [[Bylaws]], [[Faq]] \n** [[Bylaws#CODE_OF_CONDUCT | Code of Conduct ]]\n** [[Liability Waiver]]\n\n== Safety ==\n\n* Wear safety glasses when you are in an area tools are in use by yourself or others. Always exercise caution, this is a hazardous environment. Always look & listen to check if tools are in use, and do NOT disturb or distract members operating said tools. If you see someone without safety glasses while a tool is in use, hand them a pair of safety glasses.\n* If you have a kid, please accompany them through the shop (even to the bathroom / parking lot) especially if they're prone to running / touching or aren't experienced in behaving safely / paying attention to surroundings. Be proactive and mention any risks you notice to them so they can be aware.\n* Every member has the right, maybe even the responsibility to kick someone out for dangerous behavior. \n* All the insurance and waivers and training in the world won't save us, but each member having a safe mindset and speaking up / preventing incidents can.\n*'''No Brake Cleaner in the lab!'''\n** When tetrachloroethylene is exposed with excessive heat and argon used in MIG and TIG welding it produces phosgene which is deadly.\n\n== Membership==\n\n* What level are you and what do you get?\n** Everyone gets access to \"open hours\" and events.\n** Associate Member ($25) adds attend also during member hours, make proposals, and vote on proposals.\n** Basic Membership ($50) adds a box for storing stuff, and eligible to be nominated for 24/7 card access\n** Plus Membership ($100) adds a locker instead of a box\n* How you can get card access\n** Card access is a privilege based on trust, not a right. Come during open hours, help during HYH, make friends, make things, ask for proposal, gets voted on during HYH. If you can't come in during open hours, make friends online and ask for favors. It's tough but we're a community not a business.\n* Member money helps us pay the rent, but members still need to contribute to the community; that means helping clean, maintain, help others, and participate in our self-governance otherwise our co-op model won't work. Don't just come in, use the tools, and leave.\n\n== Misc ==\n\n* Public/private space\n** HeatSync Labs is a shared space. It isn't a public space.\n** Webcams & Video recording -- no expectation of privacy\n** We don't guarantee security of stuff in your box & ESPECIALLY not stuff left around the lab!\n** No taking equipment offsite or touching people's boxes/lockers.\n** HeatSync Labs stuff shouldn't be left in your box, your stuff shouldn't be left laying around the lab.\n** If you need to leave something in the lab, put a parking pass on it so we know it's yours and how to contact you.\n** Ideally, propose to the community that it be given space in the lab.\n* The Wifi password is above the front doors below the exit sign in green vinyl lettering.\n* HeatSync is a hackerspace first, coworking space second. Our primary purpose is to provide tools for people to create things, and it can be a loud/dirty place. \n** There are tons of other places with WiFi, desks, couches, and projectors. There's only one place where you can use a bandsaw.\n\n== Hack Your Hackerspace Meetings ==\n* [[Hack Your Hackerspace]] is when our community gets together to improve the space and clean up.\n** The 2nd Thursday 7pm each month and 4th Saturday each month.\n* To make proposals, just send an email to the google group with the word proposal in the subject.\n** A week before the next meeting, draft proposals are due and a community member should compile the proposals into an agenda for voting.\n** Final/amended proposals are due 24 hours before the meeting.\n** The person who made the proposal or someone they choose in advance needs to be there to represent the proposal.\n\n== Making Projects and Using Tools ==\n* Generally speaking, ask another member prior to using a tool you haven't used in the lab before. We do things differently than at your home, ask so you know how to use OUR tools right.\n** Some equipment requires certification before use.\n* Encourage cleaning culture by cleaning up after yourself, offering to clean something with someone, and helping others learn where things go.\n* Tools and workstations should be kept usable, operable, complete, and clean.\n** If a anything goes wrong with a tool or station you are using try to help remedy it. If you aren't sure how then post to relevant Slack channel or on the discussion group to engage with the Station Champion and others who may able to help resolve it.\n* If you use consumables, consider replacing them. We currently have no budgets or caretakers for consumables.\n** Exception: the tear apart bins and scrap; feel free to use for good projects, but no need to replace.\n* Sign up [https://www.heatsynclabs.org/register] to get notifications about classes you are interested in.\n\n== Who is in Charge ==\n* While we do have a Board of Directors and Station Champions everyone is empowered to make HeatSync Labs better\n* Station Champions are volunteers who make an area useful for everyone, with maintenance, fielding questions, and coordinating events related to their station.\n* If there's something you'd like to see at HeatSync Labs that isn't happening yet this falls under what we call Do-ocracy.\n** Do-ocracy: the people who get to decide are the people who get off their butts and commit to making something happen.\n** Easiest way to Do-ocracy: announce \"Thursday I'm going to work on ____, if you're interested please join me\" or \"would anyone object if I did ____?\" -- better than \"what color should the bike shed be?\" \"who wants to build a bike shed?\" -- schedule/plan it like it's a party.\n** Consult Station Champions before doing cool projects that upgrade 'their' area\n** If you are a station Champion be welcoming of ideas for 'your' area\n* The HeatSync Labs Discussion Group [http://groups.google.com/forum/?fromgroups#!forum/heatsynclabs] is our main method of communicating\n* Hosting the lab and it's guests\n** Whoever unlocks the doors or opens the door for someone is responsible for them even if it is another paying member. \n** If you're not comfortable with that responsibility, you don't have to let them in.\n** You can lock the doors any time; we're a private member organization.\n*** Do not simply open the doors and then leave; hand off responsibility for the doors to someone when you step out, or lock the doors until someone else takes responsibility.\n\n== Where to Find Things ==\n* MSDS / Safety Data Sheets: In the kitchen in the window.\n** If you bring things and store them in the lab they need to be entered into the Safety Data Sheets\n* Cleaning supplies: In the kitchen on the rack and in the cupboards next to the rack.\n* Dumpsters & recycling: Out the back door to the left (West) 225 feet down the alley (use the wheelbarrow for trash)\n** Padlock code for the dumpsters is on the exit sign above the back door.\n* Fire extinguisher: in hallway\n* Safety glasses: Hung on he wall outside the metal shop\n* Vehicle parking passes: next to safety glasses\n** Green Lot and Orange Lot parking is 3 hours max between 8am - 8pm.\n** The 30 W. Pepper Parking Garage is available to everyone on Saturday and Sunday\n* Light Switches: in hall near metal shop\n* First aid kit and eye wash: in hallway in front of small bathroom door\n* Metal shop and welding areas\n* Fire Extinguisher\n* Avoid putting extension cords or other trip hazards in this area especially\n* Light switches: bottom of stairs for upstairs lights\n* Upstairs storage/IT\n* Thermostat: doorway by laser into hallway\n** Please do not set the thermostat at a temperature that will result in a high electric bill\n* Fire extinguishers: under thermostat near the laser\n* Ear protection and dust masks: on top of nuts and bolts near hallway entry.\n* Safe: for payments and mail under soldering table\n* Sharps bin for tools: on the nuts and bolts shelf. Not to be confused with bio-hazard sharps bin\n* Project parking passes/tickets: On the lockers between the Jewelry Station and Tech Tear Apart shelves\n* Light switch: near trash by the snacks \n* Light switches: in the corner with the vinyl cutter\n* Fire extinguisher: front door\n* Door locks: make sure front door locks when going out\n* Facility Manager phone number: on the front door sign bottom corner\n** Please notify the Facility Manager immediately of anything critical related to the building, or safety. Leaks, electrical problems, damage to building, fires (after calling 911).\n** Also notify of any safety supplies, or cleaning supplies that are low.\n* [https://forms.gle/zss1bJSN7ocKQudz6 Liability Waivers] now online or at the front computer.\n\n== Wrap up ==\n* Questions?\n* How can I help you get started on something?\n* Please fill out the online [https://www.heatsynclabs.org/register/ class interest form] on our home page.\n* Are there any classes you would want to teach?\n* Welcome and thanks!",
    "bytes": 9547
  },
  "revision_count": 121,
  "first_revision_timestamp": "2011-07-04T06:11:44Z",
  "is_redirect": false
}