{
  "title": "Web",
  "ns": 0,
  "id": 1084,
  "slug": "Web",
  "latest_revision": {
    "id": 4044,
    "timestamp": "2013-03-17T00:24:48Z",
    "contributor": {
      "username": "Jjrosent",
      "ip": null,
      "id": 14
    },
    "comment": "",
    "text": "How do I add things to the heatsync website - Or, neat site, what technology did you use?\n\nSource is hosted on github where you can file issues and submit changes. Actions speak louder than words. Shout at us with code.  \nhttps://github.com/heatsynclabs/new-hsl\n\nWe deploy from there to our production server with a web hit to http://heatsynclabs.org/new-hsl/deploy.php\n\nThe old wordpress blog content is still around, now available at blog.heatsynclabs.org with all old links still valid. They're being themed by a [https://github.com/heatsynclabs/new-hsl-wp wordpress theme] altered from the github source. Follow directions there to install.\n\nFlickr photo is fed by [http://www.flickr.com/photos/hslphotosync/ hslphotosync]. If you want access to help clean and tag photos there, please offer. We're also going to log in a station in the lab into that account. When you find a good front page photo or want to advertise something, give it the tag 'publish' and it will automatically be used on the front page within a few minutes. (dont forget a title!)\n\nCalendar is fed by google calendar. There are several volunteers scheduling things based on discussion in the google groups. Ask there to schedule something, or ask to volunteer to help schedule things.\n\nGroups is fed by top 3 most recently bumped discussions. Sometimes these will not be awesome, but we're a community not a business so thats OK. \n\nTwitter is fed by -- twitter. Im current tweeting and if you want to be able to hilight cool tweets throughout the week I can add you to our grouptweet tag and when you include #hsl in your message your tweet will automatically be retweeted by HeatSync. This is great for event coverage!\n\nBlogs are fed by a yahoo pipes of all your awesome work.\nhttp://pipes.yahoo.com/pipes/pipe.info?_id=eb41a075801cf56d9a76ea48deea1612\nIf you're not on here and you want to be you can use the same flickr station and login to add yourself or ask for help.\n\nLive is of course fed by our awesome webcams. Live.heatsynclabs.org still exists for now for larger pictures and Pamela login information.",
    "bytes": 2089
  },
  "revision_count": 3,
  "first_revision_timestamp": "2013-03-17T00:18:43Z",
  "is_redirect": false
}