{
  "title": "Woodshop",
  "ns": 0,
  "id": 646,
  "slug": "Woodshop",
  "latest_revision": {
    "id": 3272,
    "timestamp": "2012-03-31T00:05:45Z",
    "contributor": {
      "username": "Rbb36",
      "ip": null,
      "id": 239
    },
    "comment": "",
    "text": "This first picture is just a screenshot of the woodshop Sketchup model.\n\nSee Also: [[Sander Dust Collector]]\n\n----\n\n[[File:Woodshop-1.jpg|400px|thumb|none|Model Screenshot]]\n\n----\n\nThis image shows the extra bench stacked on top of the East bench, forming a shelf unit until the extra bench can be moved to its new home. I kind of like the layout, so I tossed the stick lumber up there, which will let us remove the track shelving and install the French cleat system Brian has in mind on the South wall. Of course, if that bench is going somewhere else eventually, those shelves should probably be kept empty -- and the stick lumber should go elsewhere. Perhaps under the South bench.\n\n[[File:Woodshop-stack-bench.jpg|400px|thumb|none|Stacked East Bench]]\n\n----\n\nThe next image shows the table saw on a stand, and with no material storage in the woodworking space.\n\n[[File:Woodshop-table-saw-stand.jpg|400px|thumb|none|Table Saw on a Stand]]\n\n----\n\nIn the previous image, it is not clear where the table saw would be stowed when not in use. There may be room against the West wall -- with the bandsaw, scroll saw, sander, and air compressor -- but those tools may fill that space. If so, another option is to slide the North bench hard up against the East wall, like this:\n\n[[File:Woodshop-stow-table-saw-0.jpg|400px|thumb|none|North Bench Moved East to Allow Table Saw Stowage]]\n\n----\n\nMoving the North bench 2' East provides enough room next to the radial arm to stow the table saw when it is not in use.\n\n[[File:Woodshop-stow-table-saw-1.jpg|400px|thumb|none|Table Saw Stowed]]\n\n----\n\nWhen the table saw is stowed, it leaves both the main walkway and the woodworking space open.\n\n[[File:Woodshop-stow-table-saw-2.jpg|400px|thumb|none|Walkway With Table Saw Stowed]]",
    "bytes": 1768
  },
  "revision_count": 20,
  "first_revision_timestamp": "2012-03-09T07:28:27Z",
  "is_redirect": false
}